[
  " \n\n \n\nCITY COUNCIL \nBruce T. Roundy, Mayor \nSalina Edwards, Vice Mayor \nDennis G. Hoffman \nWilliam \"Billy\" Irvin \nJames Paschall, Sr. \n\nCITY OFFICIALS \nAngela Crook \nAssistant City Manager/City Clerk \nDeysy Guerrero \nCity Treasurer \n\nY \n\nAN \n\nINCORPORATED 1909 \n\n815 Fourth Street \nORLAND, CALIFORNIA 95963 \nTelephone (530) 865-1600 \nFax (530) 865-1632 \n\nCITY MANAGER \nPeter R. Carr \n\nFindings Following Appeal: City of Orland Personnel Rule 643 \n\nOrland Police Department Patrol Officer Bryan Simpson \n\nAppeal Hearing: August 5, 2019 \n\n1.",
  "Background. Following an internal investigation, a Notice of Intent to Discipline was issued to City of \nOrland Police Department Patrol Officer Bryan Simpson (Simpson) on April 30, 2019.",
  "A Skelly \nHearing was scheduled before City Manager Peter Carr (Carr) and took place on.",
  "June 4, 2019. Present at that hearing were Simpson and his counsel, Richard Fisher.",
  "Following the Skelly hearing, Can issued a Notice of Disciplinary Action on June 18, \n\n2019, as follows: \n\n1. 2.",
  "Badge: Proposed 3-day suspension is sustained for making inaccurate and \ninconsistent statements when questioned by the Chief of Police and others.",
  "Text conversation: Proposed 3-day suspension is sustained not only for \nthis stand-alone incident but also in recognition of progressive discipline \nwarranted by previous incidents as documented in Simpson's personnel \nfile in 2013, 2014 and 2015.",
  "These incidents indicate a pattern of \ninappropriate communication and insubordinate behavior to your superior \nofficers.",
  "3. K9 Drug Kit: Proposed Letter of Reprimand is retained.",
  "This LOR will be \nplaced in your personnel file for failure to properly document the change \nin K9 drug training aids.",
  "Simpson timely appealed this Notice of Disciplinary Action to the Orland City Council \npursuant to City of Orland Personnel Rule 6-7.",
  "An Orland City Council closed session for the \npurpose of hearing the appeal and deliberating thereon was duly noticed for Monday, August 5, \n2019 at 4:00 PM.",
  "Findings Following Appeal: \nCity of Orland Personnel Rule 6-13 \nOrland Police Department Patrol Officer Bryan Simpson \nPage 2.",
  "The closed session was convened as scheduled.",
  "Present for the City Council were Mayor \n\nBruce Roundy, Vice Mayor Salina Edwards, Council Member Dennis Hoffman and Council \nMember James Paschall, Sr.",
  "Officer Simpson was present with counsel, Richard Fisher.",
  "Can \npresented the matter for the City.",
  "Present also and testifying was Sergeant Sean Johnson.",
  "City \nAttorney Greg Einhom was present on behalf of the City Council.",
  "No objections were raised as to notice, and the hearing proceeded as scheduled. 2. Evidence Presented.",
  "Can presented a binder with 137 pages of materials to the Council and to Simpson.",
  "This \n\nevidence was received without objection and is incorporated, in full, into these Findings.",
  "Simpson did not present any additional documentary evidence.",
  "Simpson and Johnson were sworn in by the Mayor. Both testified.",
  "Mr. Fisher and Mr. \nCan both presented their respective positions to the City Council.",
  "No objections were made as \nto insufficient time for these presentations.",
  "At approximately 5:25 PM, the hearing was concluded.",
  "All participants were excused, \n\nand the City Council thereafter considered the evidence presented and deliberated thereon.",
  "Having concluded their deliberations, the City Council instructed the City Attorney as to the \nFindings, and further directed the City Attorney to prepare the same.",
  "3. Findings. A. \n\nBadge. from three to two days. The facts are not in dispute.",
  "The City Council sustains the suspension of Simpson without pay, but reduces the term \n\n\fFindings Following Appeal: \nCity of Orland Personnel Rule 6-13 \nOrland Police Department Patrol Officer Bryan Simpson \nPage 3.",
  "On August 29, 2018 at 11:49 AM, Simpson sent a photo of his \"shadowbox\" containing \n\nOPD Badge #16.",
  "Simpson explained that this shadowbox contains various law enforcement \nmemorabilia.",
  "Chief Tolle asked Simpson where the badge came from.",
  "Simpson responds: \"Stop \nasking questions.\"",
  "Less than 90 minutes later, on August 29, 2018 at 1:13 PM, Simpson sends an email to \nTom at Uniforms, Tuxedos and More asking Tom to order Simpson a badge.",
  "The e-mail reads: \n\"Yes less order me the following badge.",
  "Instead of \"16\" please put \"K-9\".",
  "Thanks\" \n\nOn August 29, 2018 at 4:17 PM, Chief Tolle asks Officer Simpson again where the badge \n\ncame from.",
  "On August 29, 2018 at 7:38 PM, Tom at Uniforms, Tuxedos and More responds to \n\nOfficer Simpson's email by replying, \"Whaaat?\"",
  "The following day, August 30, 2019, Chief Tolle sends a department-wide email stating \n\nthat badge #16 flat badge and #17 uniform badge are missing.",
  "He instructs anyone in possession \nof them to return them to a Sergeant.",
  "Later that day, Simpson responds to Chief Tolle's \ndepartment email stating that he believed he purchased the badge through Tom and that he is \nhaving Tom look through his receipts.",
  "On October of 2018, Sergeant Johnson spoke with the investigator (Lefdal) who was \n\nconducting Officer Simpson's background investigation for the GCSO.",
  "Lefdal advised that he \nspoke with Tom at Uniforms, Tuxedos and More, and Tom stated he had not sold Officer \nSimpson an OPD badge.",
  "On October 21, 2018, Simpson told Lefdal that Simpson purchased the badge from Tom \n\nand states in the interview that he asked Tom for a receipt and Tom could not find it.",
  "That same day, Chief Tolle advised Sergeant Johnson to open an Administrative \n\nInvestigation; Sergeant Johnson undertook a complete search of the equipment room.",
  "Completing that search, Sergeant Johnson checked the training file of a previous Officer and \nlocated a memo stating that Officer Simpson had been issued badge #16.",
  "On November 2, 2018, Sergeant Johnson spoke with Tom at Uniforms, Tuxedos and \n\nMore about the badge.",
  "Tom stated he could not order the badge even if he wanted to.",
  "Further, \nTom had no recollection of Simpson asking for a receipt for a badge purchase.",
  "Findings Following Appeal: \nCity of Orland Personnel Rule 6-13 \nOrland Police Department Patrol Officer Bryan Simpson \nPage 4.",
  "On November 30, 2018, Sergeant Johnson interviewed Simpson with Mr. Fisher present.",
  "Simpson stated that he emailed Tom to ask for a receipt and he could provide the receipt.",
  "Simpson stated that Tom's reply to his email was, \"What?\"",
  "Simpson denied any other \nconversations with Tom about a receipt or the badge (verbal, text, and email).",
  "On December 2, \n2018, Simpson forwarded Sergeant Johnson the email Simpson had sent to Tom on August 28, \n2018.",
  "Simpson argued that his inconsistency about where he obtained the badge was due to \n\nforgetting where it came from and his mind searching for an answer because he did not want to \nsay, \"I don't know.\"",
  "Simpson also said he was positive that he had purchased it from Tom, so \nthat appears why he stuck with that story until he was pushed and pushed for a different answer.",
  "This would have been an acceptable explanation save for one significant problem: \nSimpson emailed Tom at Uniforms, Tuxedos and More on August 29, 2018 less 90 minutes after \nChief Tolle asked him where the badge came from and before Chief Tolle asked him a second \ntime.",
  "Officer Simpson later stated that he had asked Tom for a receipt, but when he provided the \nemail where he allegedly asked for a receipt, the email clearly indicates his desire to purchase an \nOPD badge, changing the \"16\" on the badge in the photo to \"K-9\".",
  "The fact is that Simpson stated repeatedly that he believed he purchased the badge from \n\nTom and had requested a receipt from Tom.",
  "However, Simpson never request a receipt from \nTom.",
  "Instead, he asked Tom to purchase a badge.",
  "Each time Simpson stated that he asked Tom \na receipt, Simpson knew that was false.",
  "As stated, there was no dispute as to these facts.",
  "As stated, the suspension is upheld, but reduced to two days. B. Text Conversations.",
  "This issue concerned text messages between Simpson and (former) Chief Tolle.",
  "Simpson testified that the context of these exchanges is important: these were delivered \n\nand received as banter.",
  "The former Chief is no longer employed by the City, and therefore was not present.",
  "Findings Following Appeal: \nCity of Orland Personnel Rule 6-13 \nOrland Police Department Patrol Officer Bryan Simpson \nPage 5.",
  "As a result, the three-day suspension is dismissed. C. \n\nK-9 Drug Kit.",
  "Simpson admitted that he \"made a mistake\" by not accounting for K9 Drug Kit materials, \n\nconsisting of controlled illegal substances.",
  "As a result, the discipline of a letter of reprimand is upheld.",
  "Further, it appears that Simpson does not have the right to appeal a written reprimand to \n\nthe City Council, as provided by Personnel Rule 5-11.",
  "Pursuant to Personnel Rule 6-13, these Findings are deemed final.",
  "Dated:  ei—IJ,—A0i7  \n\nMayor Bruce Roundy, for the \nOrland City Council"
]