[
  "Inglewood \n\nCalifornia \n \n\nINTER-DEPARTMENTAL COMMUNICATION \n\n \n \n \nDecember 20, 2019 \n \n \nTO: \n \nFROM: \n \nSUBJECT:  OFFICER INVOLVED SHOOTING – FINAL REPORT      \n \n\nSERGEANT GEOFFREY P. MEEKS \n\nCHIEF OF POLICE \n\nINTERNAL AFFAIRS DIVISION CASE #FD2019-001 \n \n\n \nINTRODUCTION: \n \nThe  following  is  a  chronological  narrative  of  events  leading  up  to  and  surrounding  the \nofficer involved shooting incident involving on-duty Inglewood Police Officers Jonathan \nRivers  and  Julian  Baksh  on  Wednesday,  March  27,  2019.",
  "The  following  summary  is \npredicated  on  information  obtained  through  administrative  and  investigative  interviews \nconducted by the Inglewood Police Department’s Officer Involved Shooting Investigation \nTeam and the Inglewood Police Department’s Detective Bureau.",
  "Evidence collected by \nthe  Inglewood  Police  Department  Forensics  Division,  and  examined  by  the  Forensics \nDivision and the Los Angeles County Sheriff’s Department Crime Lab, and all materially \nrelated Inglewood Police Department documents pertaining to this incident were reviewed \nand incorporated in the summary.",
  "SYNOPSIS:   \n \nOn  the  afternoon  of  Wednesday,  March  27,  2019  at  approximately  1523  hours,  the \nInglewood  Police  Department  Communications  Division  received  an  emergency \ntelephone call from the Church of Scientology (315 S. Market Street).",
  "the \nCommunity Public Receptionist for the Church of Scientology, initiated the telephone call \nto report that a man with a sword was inside of the Church of Scientology.",
  "described the individual as a male Asian wearing a black hat, black pants and a black \nAsian style jacket.",
  "The male subject had the sword on his back and was also equipped \nwith a cane.",
  "told Inglewood dispatcher #6 (Inglewood Public Safety Dispatcher Christina \nOdom)  that  the  subject  did  not  appear  to  be  under  the  influence  of  a  drug  or  alcohol, \nhowever she described the male subject as looking weak.",
  "did state that the \nsubject was walking around fine.",
  "Approximately, (2) minutes and fifty (50) seconds into \n\n\f \n\n  told  Inglewood  dispatcher  #6  that \n\n told dispatcher #6 that the subject was asked to put the \nthe telephone call, \nweapon away and he proceeded to walk outside of the church and put it into his vehicle.",
  "The vehicle was described as a two door Chrysler that was pearl white in color.",
  "Shortly \nafter, the male subject re-entered the Church with a backpack on his back and was met \n the Director of Special Affairs for the Church of Scientology Inglewood \nby \nlocation.",
  "took  the  male \nsubject to the right side of the building, into the testing area.",
  "Five (5) minutes and forty \n relayed to Inglewood dispatcher #6 \n(40) seconds into this telephone call, \nthat a supervisor went outside to speak with a responding Inglewood Police Officer.",
  "At  approximately  1528  hours,  Inglewood  dispatcher  #8  (Inglewood  Public  Safety \nDispatcher  Stacie  Lampkin)  broadcast  to  assigned  units,  a  radio  call  of  a  suspicious \nsubject to the rear of the Church of Scientology.",
  "This radio call was initially broadcast to \nInglewood police units 4L12B (Officer Rivers) and 4P25 (Officer Baksh) and an additional \nunit to assist, with Officer Rivers acknowledging the radio call, via the radio.",
  "4L11 (Officer \nArmando Ortiz) acknowledged the radio call as an assisting unit and stated that he was \nin route from Hyde Park Boulevard and La Brea Avenue.",
  "Officer Baksh acknowledged \nthe  radio  call  by  showing  himself  in  route  to  this  call,  via  his  vehicle’s  mobile  data \ncomputer (MDC).",
  "The patrol sergeant, 4S20 (Sergeant Freeman Smith) acknowledged \nthe radio call as well.",
  "The information broadcast by dispatcher #8 was that a male Asian \nwas  a  wearing  a  black  hoodie;  black  pants;  and  carrying  a  sword  on  his  back.",
  "The \nbroadcast also informed that the subject arrived in a two door white newer Chrysler and \nhad been on scene for approximately five (5) minutes.",
  "Within approximately one (1) minute and twenty-two (22) seconds of the radio call being \nbroadcast by dispatcher #8, Officer Rivers broadcasted, via the radio, that he was going \non scene to the location of this particular radio call.",
  "After approximately one (1) minute \nand sixteen (16) seconds of being on scene, Officer Rivers broadcasted, via the radio, \nthat he was off with a reporting party and the male subject in question no longer had the \nsword.",
  "Approximately  two  (2)  minutes  and  forty  (40)  seconds  after  Officer  Rivers \nbroadcast that he was off with a reporting party and that the subject in question no longer \nhad  the  sword,  Officer  Baksh  arrived  on  scene  to  the  Church  of  Scientology.",
  "Approximately  one  (1)  minute  and  eighteen  (18)  seconds  after  Officer  Baksh  placed \nhimself on scene, via his vehicle’s MDC, Officer Rivers broadcasted, via his radio, that \nshots were fired.",
  "Special Enforcement Team (SET) officers Wunderlich and Bobbs (4E5) were immediately \non scene as Officer Bobbs broadcasted that officers were hit.",
  "Officer Bobbs broadcasted \nthat an officer was hit in the arm and the suspect was down.",
  "Seconds later, Officer Bobbs \nrelayed another radio broadcast that a second officer was hit.",
  "Moments after this radio \nbroadcast, Sergeant Smith arrived on scene and began to coordinate both a pathway for \nemergency medical first responders to reach the two (2) officers and the subject involved \nin this incident as well as crime scene containment and a corresponding perimeter.",
  "Officer Rivers appeared to have suffered a gunshot wound to the right forearm area as a \nresult of this incident.",
  "Officer Rivers was alert and immediately transported by McCormick \n\n\f \n\nAmbulance to UCLA Westwood Medical Center for emergency treatment.",
  "Officer Baksh \nappeared to have suffered a gunshot wound to his left hand, primarily the left thumb area, \nhowever, Officer Baksh  was  alert.",
  "Officer  Baksh  was  transported to  UCLA Westwood \nMedical Center by McCormick Ambulance for emergency medical treatment.",
  "The male \nsubject appeared to have suffered two (2) gunshot wounds to the upper torso and was \nnon-responsive.",
  "Emergency medical treatment efforts were administered to the subject, who was lying on \nthe  ground,  by  several  responding  Inglewood  Police  Department  officers  on  scene.",
  "Moments  later,  Los  Angeles  County  Fire  Department  personnel  arrived  on  scene  and \ncontinued lifesaving efforts on the subject.",
  "The subject was also transported to UCLA \nWestwood Medical Center by McCormick Ambulance.",
  "On Wednesday,  March  27,  2019,  at  approximately  1633  Hours,  the  male  subject  who \nsuffered two (2) gunshot wounds to the upper torso, inside the Church of Scientology, \nwas  pronounced  deceased  by  the  UCLA  Medical  Center’s  attending  emergency  room \ndoctor, Doctor James Jiang.",
  "Inglewood Police Officer’s Martha Lopez and Rueben Alfaro \nresponded to UCLA Medical Center and spoke with emergency room medical personnel.",
  "After speaking with emergency room medical personnel, the two (2) officers contacted \nthe  Los  Angeles  County  Coroner’s  Office.",
  "The  Los  Angeles  County  Coroner’s  Office \naccepted  this  case  and  provided  the  officers  with  a  coroner  case  number  that  was \ndocumented  in  Inglewood  Police  Follow-up  Report  #3  under  Inglewood  Police \nDepartment General Offense number 2019-20361.",
  "The preliminary investigation revealed the identity of the deceased male subject as Brian \nLeslie Statler.",
  "Brian Statler is a Caucasian adult who was born on December 22, 1988.",
  "Brian  Statler  had  a  criminal  record  in  the  State  of  California;  with  a  felony  domestic \nviolence  conviction  in  2016  and  an  arrest  for  driving  a  vehicle  without  a  valid  driver’s \nlicense or without the owner’s consent in 2017.",
  "Brian Statler was involved in a dating \nrelationship with a female employee of the Church of Scientology located in Inglewood, \nnamed \n had a two (2) year old \n  Brian Statler and Ms. \ndaughter  together  at  the  time  of  this  incident.",
  "Ms. \n  was  at  work  inside  of  the \nChurch of Scientology on the day of this incident, however, she did not make physical or \nvisual contact with Brian Statler.",
  "A detailed account of the relationship between these \ntwo  (2)  individuals  is  documented  within  Inglewood  Police  Follow-up  Report  #4  under \nInglewood Police Department General Offense number 2019-20361.",
  "INTERVIEWS: \n \nSummarized Statement of Officer Julian Baksh: \n \nOn Wednesday, August 21, 2019, at approximately 1237 hours, Sergeant Marvin Aguilar \nand I conducted an administrative interview with Officer Julian Baksh within the interview \nroom of the Inglewood Police Department’s Internal Affairs Division.",
  "Officer Baksh was \npresent  with  his  legal  counsel,  Mr.  Bijan  Darvish.",
  "Sergeant  Oswald  Figueroa,  an \nassigned Internal Affairs Sergeant, was present during this interview as an observer.",
  "At \n\n\f \n\nthe  onset  of  the  interview,  Officer  Baksh  was  read  a  Miranda  Admonishment  from \nSergeant Aguilar via  a  department  approved  Miranda Admonition form.",
  "Officer Baksh \nwas advised by his attorney, Mr. Darvish to not waive his rights and say no.",
  "Officer Baksh \ndeclined to waive his rights in regard to the Miranda Admonishment.",
  "Sergeant Aguilar \nthan read Officer Baksh a Lybarger Admonition from a department approved Lybarger \nAdmonition  form.",
  "Officer  Baksh  stated  that  he  understood  this  admonition  by  stating, \n“Yes.” \n \nOfficer Baksh told Sergeant Aguilar and I, that he had been employed as a Police Officer \nwith the Inglewood Police Department for approximately twelve (12) years at the time of \nthe  incident  in  question.",
  "Officer  Baksh  told  us  that  he  had  three  (3)  years  of  prior \nexperience  as  a  Field  Training  Officer  (FTO)  with  the  Inglewood  Police  Department.",
  "Officer Baksh also confirmed that he has six (6) years of experience as a current member \nof  the  Inglewood  Police  Department’s  Special  Weapons  and  Tactics  Team  (SWAT).",
  "Officer Baksh stated that his current role on the SWAT team was that of a back-up scout \nand  he  confirmed  that  he  had  extensive  training  in  firearms  manipulations,  gunfire \ndiscipline and threat acquisition.",
  "In terms of Wednesday, March 27, 2019, Officer Baksh confirmed that he began his work \nshift at approximately 1000 hours and was assigned as a Paul unit, 4P25.",
  "Officer Baksh \ncould  not  recall  being  involved  in  any  incident  or  with  any  individuals  that  he  could \ndescribe as being a threat to his safety or the safety of the community between the work \nshift hours of 1000 hours and 1520 hours.",
  "At approximately 1528 hours, Officer Baksh recalled a radio call of a suspicious subject \nat the Church of Scientology being broadcasted by Inglewood Police Communications.",
  "Officer  Baksh  stated  that  he  responded  to  this  radio  call  from  the  area  of  Manchester \nBoulevard and Oak Street.",
  "As he was traveling to this radio call, Officer Baksh stated \nthat he was thinking of a strategy as well as a contingency on dealing with this particular \nradio call.",
  "Officer Baksh relayed to Sergeant Aguilar and I that he heard Officer Rivers place himself \non scene several minutes after this radio call initially was broadcasted.",
  "Shortly after going \non scene, Officer Baksh stated that he heard Officer Rivers broadcast, via the radio, that \nhe was off with a reporting party and the subject in question had put the sword away, “or \nsomething to that effect.”  Officer Baksh believed that there could still be other weapons \ninvolved so he was still thinking about contingency plans while in route to the Church of \nScientology.",
  "Officer Baksh stated that he believed he would be updated with information \nfrom Officer Rivers as he was on scene, and Officer Baksh would use that information to \nformulate a plan.",
  "Officer Baksh believes he arrived on scene approximately one (1) to \ntwo (2) minutes after Officer Rivers broadcasted that the subject put the sword away.",
  "As Officer Baksh arrived to the location, he parked his patrol vehicle in front of the Church \nof Scientology and did not see anyone standing on the sidewalk.",
  "Officer Baksh attempted \nto contact Officer Rivers via “mobile” on his radio since he had not heard any additional \nupdates from Officer Rivers.",
  "Officer Baksh stated that Officer Rivers did not respond to \n\n\f \n\nhis  attempt  to  raise  him  on  the  radio,  via  “mobile”,  which  made  Officer  Baksh  a  little \nnervous.",
  "Officer Baksh stated that he started thinking of things that could be going wrong \ninside and he began thinking of a lot more contingencies.",
  "Officer Baksh looked inside the \nfront doors of the Church of Scientology and saw Officer Rivers standing approximately \nforty (40) to fifty (50) feet away to Officer Baksh’s left (southern portion of the Church).",
  "Officer Rivers was motioning frantically with an unknown hand for Officer Baksh to come \ntoward him.",
  "Officer Baksh told Sergeant Aguilar and  I, that when he looked at Officer \nRivers,  he  recalled  that  his  eyes  were  really  wide  and  he  immediately  thought  that \nsomething was not right with the situation.",
  "Officer Baksh stated that he approached Officer Rivers to observe what he was currently \nseeing.",
  "Officer Rivers was on one side of the wall, which was serving as cover, and the \nsubject was on the other side of that wall.",
  "There was an opening allowing Officers Rivers \nand Baksh to look into the area beyond the wall and have eyes on anyone in that particular \narea.",
  "Officer Rivers shouted commands to the subject to, “stop reaching” or “get your \nhands out of your pocket” while Officer Baksh looked around the wall to observe what \nOfficer Rivers was seeing.",
  "Officer Baksh remembers seeing the subject sitting down in \na chair rocking back and forth with his hands moving into his clothing.",
  "The subject was \ntalking real fast to himself and his eyes were real wide.",
  "Officer Baksh believed that the \nsubject was either under the influence of some sort or was suffering from a mental health \nissue.",
  "Officer Baksh told Sergeant Aguilar and I, that up to this point, he had not had a chance \nto  speak  with  a  representative  of  the  Church  of  Scientology  in  regard  to  the  subjects \ndemeanor.",
  "Officer Rivers had provided Officer Baksh with minimal commentary in regard \nto  the  subject,  however  Baksh  was  able  to  visually  observe  the  male  subject.",
  "Officer \nBaksh confirmed that based on the totality of the circumstances up to this point, he felt it \nwas in the best interest of everyone inside of the Church of Scientology to take a hands \non approach and detain this subject.",
  "Officer Baksh stated that no radio traffic had been broadcasted by either him or Officer \nRivers in terms of what was transpiring.",
  "Officer Baksh was aware that additional units \nwere coming and were not too far behind.",
  "Nevertheless, based on the fact that the subject \nwas refusing to comply with commands to remove his hands from his clothing coupled \nwith Officer Rivers’ demeanor, it reinforced for Officer Baksh that he and Officer Rivers \nneeded to take control of the subject quickly.",
  "Officer  Baksh  described  this  particular  area  in  which  he,  Officer  Rivers  and  the  male \nsubject were located as being south of the lobby area.",
  "There was a ceiling length wall \nseparating the little area where the subject was sitting from the lobby area.",
  "That particular \narea appeared to be semi-private with a large walk-thru opening.",
  "Officer Baksh stated \nthat there were no employee’s right in that area, however, he believed the male subject \ncould easily run through him and Officer Rivers and make his way toward an employee \nor even escape.",
  "Officer Baksh and Officer Rivers formulated their plan to contact the subject and as the \n\n\f \n\nofficers began to move toward the subject, Officer Baksh heard the male subject say, “I \ndon’t wanna go to jail.",
  "I don’t wanna go to jail.”  At that point Officer Baksh stated that he \nbegan speaking calmly to the subject in an effort to re-assure the subject that everything \nwas alright.",
  "The subject continued to rock back and forth while sitting in the chair stating \nthat he did not want to go to jail.",
  "As both officers went hands on, Officer Baksh grabbing \nthe subject’s right arm and Officer Rivers on the subjects left side, the subject immediately \ntensed up and resisted placing his arms behind his back.",
  "Officer Baksh continued to talk to the subject telling him things were going to be alright, \nhowever, the subject attempted to stand up.",
  "Officer Baksh thought that he and Officer \nRivers were not in sync.",
  "Officer Baksh described it as a push-pull effect between him \nand Officer Rivers.",
  "Officer Baksh began to give direction to Officer Rivers in terms of how \nto detain this subject as Officer Baksh wanted to stand the subject up and use a nearby \ndesk  for  leverage  against  the  resisting  male  subject.",
  "Officer  Baksh  stated  that  he \nattempted to broadcast radio traffic during this struggle, however, his radio mic had fallen \noff his uniform shirt.",
  "During this struggle, Officer Baksh lost the grip he had of the subject’s right arm so he \ngrabbed  the  subject  up  around  his  shoulders  with  his  left  arm  across  the  front  of  the \nsubject’s  upper  torso.",
  "During  this  struggle,  Officer  Baksh  saw  the  subject  punching \nOfficer Rivers with his free right arm.",
  "Officer Baksh thought these punches were directed \ntoward Officer Rivers’ stomach area.",
  "As Officer Baksh was setting himself up to conduct \na leg sweep takedown of the subject, he heard a heavy distinct sound of something hit \nthe ground.",
  "Officer Baksh looked down on the ground and saw what he recognized as a \nGlock handgun with a tactical light.",
  "Officer Baksh immediately felt that his initial thoughts of conducting a leg sweep were no \nlonger an option and he simply wanted to get the subject as far away from the gun as \npossible.",
  "As Officer Baksh attempted to pull the subject backwards from the area of the \ngun, which is now on the ground to the left of him and the subject, the subject deliberately \nlunged forward toward the Glock firearm.",
  "The subject grabbed the gun with his right hand \nas Officer Baksh still had a grasp of the subject’s shoulders while he was pulling back on \nthe  subject.",
  "After  grabbing  the  gun,  the  subject  was  pulled  backward  onto  the  top  of \nOfficer Baksh.",
  "Based on the circumstances to this point and the fact that Officer Baksh was scared that \nthe subject would use the gun to shoot Officer Rivers and himself, Officer Baksh drew his \ngun in his right hand and fired one (1) round toward the subject’s upper torso.",
  "After that \ninitial  shot,  the  subject  was  still  moving  so  Officer  Baksh  fired  two  (2)  rapid  fire  shots \ntoward the subject’s upper torso.",
  "During this deadly confrontation, Officer Rivers was on \ntop  of  the  subject  which  scared  Officer Baksh  even  more.",
  "Officer  Baksh  re-assessed \nafter  his  two  rapid  fire  shots  and  saw  that  the  subject  was  no  longer  moving.",
  "Officer \nBaksh immediately transitioned and placed handcuffs onto the male subject.",
  "Immediately after, Officer Baksh realized that he had been shot in the thumb and Officer \nRivers  told  him  he  had  been  shot  in  the  arm.",
  "Officer  Baksh  stated  that  the  only \n\n\f \n\ncommunication he had with Officer Rivers during the height of this struggle is when he \nyelled out, “Gun!",
  "Gun! Gun!”   \n \nOfficer Baksh told Sergeant Aguilar and I, that he was not able to focus on his gun sights \nwhen firing at the subject.",
  "The subject had fallen on top of him coupled with the urgency \nof the situation, Officer Baksh was only able to fire the gun with one hand, his right, and \nforced to point the gun in the direction of the subject which was to his left.",
  "Officer Baksh \nwas cognizant that Officer Rivers was right there and there were possibly employees in \nthe vicinity so he utilized fire discipline and attempted to end this encounter with as few \nrounds as possible.",
  "Officer  Baksh  was  not  aware  if  the  subject  fired  Officer  Rivers’  gun  and  did  not  hear \nadditional gunshots being fired.",
  "Officer Baksh did not see or know how Officer Rivers \nrecovered his firearm from the subject, however, Officer Baksh took Officer Rivers’ gun \nfrom him  and  rendered  the firearm  safe  by  removing  the magazine  and ejecting  a  live \nround from the chamber.",
  "Immediately afterwards, the first responding Inglewood Police \nDepartment Officers arrived on scene.",
  "Summarized Statement of Officer Jonathan Rivers: \n \nOn  Wednesday,  September  4,  2019,  at  approximately  1225  hours,  Sergeant  Marvin \nAguilar and I conducted an administrative interview with Officer  Jonathan Rivers within \nthe interview room of the Inglewood Police Department’s Internal Affairs Division.",
  "Officer \nRivers  was  present  with  his  legal  counsel,  Mr.  Andrew  Dawson.",
  "Immediately,  Mr. \nDawson  objected  to  the  merits  of  this  interview  and  the  circumstances  by  which  this \ninterview  was  being  conducted.",
  "Mr.  Dawson’s  objections  were  noted  and  Sergeant \nAguilar proceeded to read Officer Rivers a  Miranda Admonishment from a department \napproved Miranda Admonition form.",
  "Officer Rivers stated that he understood his rights \nand  declined  to  waive  his  rights  in  regard  to  the  Miranda  Admonishment.",
  "Sergeant \nAguilar  than  read  Officer  Rivers  a  Lybarger  Admonition  from  a  department  approved \nLybarger Admonition form.",
  "Officer Rivers stated that he understood this admonition by \nanswering, “Yes.” \n \nAt  the  onset  of  the  interview,  Mr.  Dawson  established  the  fact  that  Officer  Rivers  was \nunder Doctor prescribed medication.",
  "I proceeded to establish the fact, based on Officer \nRivers’ account,  that  he  took medication  at  0400  hours on  this  day  and  again  at  1000 \nhours.",
  "Mr. Dawson asked Officer Rivers what the effect of the medication would be on \nhis personal being and Officer Rivers responded that he did not know, but he felt good \nenough to proceed with this interview.",
  "Officer  Rivers  stated  that  he  had  been  employed  as  an  Inglewood  Police  Officer  for \napproximately five (5) years at the time of this incident.",
  "Officer Rivers acknowledged that \nhe  has  received  department  training  in  terms  of  use  of  force  and  tactics  surrounding \nresponses to radio calls.",
  "Officer Rivers did relay that he has not signed onto the Lexipol \nwebsite  to  acknowledge  the  Inglewood  Police  Department  Use-of-Force  policy,  policy \n300.",
  "In terms of Wednesday, March 27, 2019, Officer Rivers confirmed that he began his work \nshift  at  0600  hours.",
  "Officer  Rivers  could  not  recall  his  patrol  assignment  on  this  day, \nhowever he was assigned as 4L12B.",
  "Officer Rivers does not recall being involved in any \ncritical incidents, including use of force incidents on this work day between the hours of \n0600 and the broadcast of the radio call pertaining to this incident.",
  "At  approximately  1526  hours,  Officer  Rivers  received  the  radio  call  pertaining  to  the \nChurch of Scientology, however, he does not know exactly where he was located in the \ncity  upon  receiving  this  radio  call.",
  "Officer  Rivers  does  recall  hearing  at  least  one  (1) \nadditional patrol unit acknowledge their response to this radio call.",
  "As Officer Rivers arrived on scene to the Church of Scientology, he parked on Market \nStreet just north of the Church.",
  "As Officer Rivers exited his vehicle and made it to the \nwest sidewalk of Market Street, he was met by an employee of the Church of Scientology.",
  "Officer Rivers met this employee just north of the Church, however, due to the front façade \nof the Church being glass, Officer Rivers was able to somewhat see inside of the Church.",
  "Officer Rivers was told by the employee that he contacted, that there was a subject inside \nof  the  Church  that  was  acting  erratically  and  had  been  armed  with  a  Samurai  sword, \nhowever, he no longer had the sword as the subject placed it inside of a parked white \nvehicle in front of the church.",
  "Officer Rivers waited on the sidewalk for an assisting unit to respond at which time he \nlooked inside of the church and saw a female employee [\n standing at a front \ncounter  [the  reception  desk]  frantically  waving  for  him  to  come  inside.",
  "Officer  Rivers \nattempted to access his radio to broadcast information, however, he believes his radio \ntraffic was canceled out by other officer radio traffic, which prevented him from offering \nupdated information.",
  "Officer  Rivers  walked  into  the  business  believing  that  something  may  have  been \nhappening  that  was  causing  the  female  employee  distress,  however,  she  did  not  say \nanything to him.",
  "She merely pointed south of her direction, causing Officer Rivers to turn \nhis attention south of the reception area.",
  "Officer Rivers heard loud talking coming from \nthat  particular area  and  proceeded to  walk over to  the  southern  area of  the  Church to \ninvestigate.",
  "Officer  Rivers  tactically  pied  [physically  and  visually  angled]  an  opening \nleading  to  a  room  and  immediately  saw  two  (2)  employees  sitting  at  a  desk  with  the \nsubject in question.",
  "Officer Rivers did state that when he pied, his hand was on his gun, \nhowever, his gun was still holstered as there was no reason for him to have his firearm \nout.",
  "The retention lock was still engaged on Officer Rivers’ department issued holster at \nthis moment in time.",
  "Officer Rivers estimates that he was within three (3) to ten (10) feet of the subject, who \ngave off a mean, deranged and confused look.",
  "No assisting officer had arrived on scene, \nbut nevertheless, Officer Rivers made verbal contact with all three (3) individuals seated \nat the desk.",
  "Officer Rivers learned from one (1) of the employees that the subject was \nnot  welcomed  inside  of  the  Church  and  was  being  requested  to  leave.",
  "Officer  Rivers \n\n\f \n\nstated that he turned his attention to the male subject, introduced himself and told the \nsubject he was free to leave.",
  "Officer Rivers told Sergeant Aguilar and I, that he heard radio traffic, but he was focused \non the subject he was dealing with.",
  "In terms of broadcasting radio traffic, Officer Rivers \nstated that he attempted to ask Inglewood Police Communications about the status of his \nback-up unit via his radio, however, he believes there was police radio traffic that covered \nhim.",
  "Unable to determine the vicinity of his assisting unit, Officer Rivers attempted to have a \ndialogue with the male subject.",
  "He proceeded to tell the subject that he could gather his \nbelongings and leave, however, the subject was mumbling and looking around the room.",
  "Officer Rivers advised the two (2) employees to step away when almost simultaneously, \nthe subject took an unidentified dark color object off of the table and placed it inside of his \npocket.",
  "Officer  Rivers  relayed  that  he  felt  uncomfortable  at  this  exact  moment  not \nknowing what the subject took off of the table and placed into his pocket.",
  "Officer Rivers \nsaid that he increased his distance from the subject after he grabbed the item off of the \ndesk from an initial point of three (3) to five (5) feet to now seven (7) to ten (10) feet.",
  "At  this  particular  moment,  Officer  Rivers  noticed  that  his  first  assisting  patrol  officer, \nOfficer Baksh, had arrived and was inside the Church with him.",
  "Officer Rivers briefed \nOfficer Baksh on the fact that the subject was not adhering to his commands and had \nplaced an unknown item from the top of the desk into his pocket.",
  "Officer Rivers nor Officer \nBaksh  had  their  guns  drawn  at  this  point  and  Officer  Rivers  did  not  clearly  articulate \nwhether he drew his less lethal conducted energy weapon (CEW).",
  "Officer Baksh attempted to engage the subject in dialogue, all the while Officer Rivers \nobserved that the subject’s head remained in a downward position.",
  "Officer Rivers relayed \nto Officer Baksh that the subject had not been searched yet.",
  "Officer Rivers was not aware \nof any additional police units being on scene as he told Sergeant Aguilar and I, “My main \nfocus was the individual who was in front of me.”  Officer Rivers was greatly concerned \nby the fact that the subject had not been searched yet.",
  "Out of fear of the subject not being searched coupled with the fact that the subject was \nnot  being  compliant  with  Officer Rivers or Officer Baksh,  both  officers approached  the \nsubject to go hands on and detain him.",
  "Officer Rivers approached the subject on his left \nside while the subject was still seated.",
  "Officer Rivers grabbed the subjects left bicep and \nleft wrist.",
  "Officer Rivers believes that Officer Baksh grabbed the subject’s right wrist as \nhe was on the right side of his body.",
  "Officer Rivers stated that both he and Officer Baksh \nwere giving commands to the subject.",
  "Officer Rivers stated that he advised the subject \nthat he was no longer free to leave at which time he noticed the subject became resistive.",
  "Officer Rivers stated that the subject was mute and clenching his fist, all the while still \nseated.",
  "Officer Rivers described the next chain of events as being, “overpowered.”  Officer Rivers \nstated that the subject stood to his feet and immediately started pulling and tugging on \n\n\f \n\nhis holstered gun.",
  "Officer Rivers recalled the subject grabbing his gun with his left hand \nand  thinking  that  he  had  to  maintain  that  firearm  inside  of  his  holster.",
  "Officer  Rivers \nmaintained his initial grip on the subjects left wrist and bicep and yelled out, “He’s going \nfor my gun” several times.",
  "Officer Rivers placed his right hand on top of his gun for the \nsole purpose of retaining his gun in his holster.",
  "Both he and the subject were forcefully \nstruggling over the gun as the subject was pulling on the gun while it was still holstered.",
  "As Officer Rivers is yelling for the subject to stop, Officer Rivers sees that the subjects \nright hand is free and is now utilizing both hands to pull on his gun.",
  "While in the fight for \nhis  gun,  Officer  Rivers  could  see  that  the  subject  was  looking  at  his  gun  during  this \nstruggle.",
  "Officer Rivers placed his left hand against the subject’s throat while trying to \nkeep his gun locked into his holster with his right hand.",
  "Officer Rivers told Sergeant Aguilar and I, that he was scared at this exact moment in the \nstruggle, however, it was important to him to ensure that his firearm stayed inside of its \nholster.",
  "Officer Rivers was not really aware of what Officer Baksh was doing, however, \nhe  was  aware  that  at  one  point  during  this  altercation,  Officer  Baksh  placed  his  arm \naround  the  subjects  head  area.",
  "Communication  between  Officer  Rivers  and  Officer \nBaksh was limited as Officer Rivers stated that he was yelling and couldn’t hear if Officer \nBaksh was saying anything.",
  "Officer Rivers stated that the subject did not state anything \nduring  this  confrontation  and  gave  no  indication  to  him  that  he  wanted  to  engage  in  a \nphysical altercation.",
  "Nearing  the  conclusion  of  this  physical  struggle,  Officer  Rivers  stated  that  he  felt  the \nretention lock disengage and the subject had a grip on his gun.",
  "Officer Rivers kept his \ngrip on his gun and all three (3) of them fell forward to the ground.",
  "While on the ground, \nOfficer Rivers describes him and the subject facing each other, with both of them gripping \nhis gun.",
  "Before he could communicate anything to Officer Baksh, Officer Rivers heard \nOfficer Baksh yelling, “Gun! Gun! Gun! Gun!",
  "Gun!”  Believing that the subject was going \nto kill him, Officer Rivers continued fighting to maintain a grip on his gun.",
  "Moments later, \nOfficer Rivers heard one (1) gunshot.",
  "He heard Officer Baksh yell out, “Fuck, I’m hit, I’m \nhit.”    Officer  Rivers  saw  his  gun  fall  to  the  ground  between  the  subject’s  feet  so  he \ninstinctively kicked the gun away as the subject continued to fight with the officers on the \nground.",
  "As officer Rivers attempted to get up to retrieve his gun, he realized that he had \nbeen shot.",
  "Officer Rivers told myself and Sergeant Aguilar that at that moment, he heard a second \nshot.",
  "Simultaneously, Officer Rivers retrieved his gun from off of the floor and saw that \nthe subject was no longer fighting him and Officer Baksh.",
  "As he looked at the subject, he \nsaw that he was not moving and there was blood coming from the subject’s upper torso \narea.",
  "As Officer Rivers held his firearm in his left hand, Officer Baksh took his gun from \nhim and  rendered  it  safe by  removing  the magazine  and  clearing  the  live  round  in the \nchamber.",
  "Shortly after, several Inglewood Police Officers arrived on scene.",
  "Summarized Statement of Officer Armando Ortiz: \n \nOn Tuesday, October 8, 2019 at approximately 1800 hours, Sergeant Marvin Aguilar and \n\n\f \n\nI conducted an administrative witness interview with Officer Armando Ortiz.",
  "This interview \nwas conducted within the interview room located in the Inglewood Police Department’s \nInternal Affairs Division.",
  "Sergeant Aguilar read Officer Ortiz a Lybarger Admonition from \na  department  approved  Lybarger  Admonition  form.",
  "Officer  Ortiz  stated  that  he \nunderstood this admonition by stating, “Yes I do.” \n \nOfficer Ortiz stated that he was employed as an Inglewood Police Officer for a time period \njust shy of one (1) year at the time of this incident.",
  "In terms of Wednesday, March 27, \n2019, Officer Ortiz was assigned to Day Watch Shift A with a start of duty time of 0600 \nhours.",
  "On this particular day, Officer Ortiz was working as 4L11.",
  "Officer Ortiz confirmed \nthat he was aware of a suspicious subject radio call that was generated by the Church of \nScientology located at 315 S. Market Street.",
  "Officer Ortiz responded to this radio call as \nan assisting unit from the area of La Brea Avenue and Hyde Park Boulevard.",
  "Based on the nature of the radio call, Officer Ortiz stated that he felt this call could develop \ninto something dangerous.",
  "To him, it sounded more high priority than the original radio \ncall that he was responding to.",
  "Officer Ortiz believed that he heard radio traffic that an \nofficer might have been off with a reporting party, however, that is the only radio traffic he \nremembers possibly hearing while being in route to this radio call.",
  "Officer Ortiz arrived on scene and parked on Market Street, just north of Nutwood Street.",
  "As he was walking toward the Church of Scientology, he heard possibly four (4) gunshots.",
  "Officer  Ortiz  sprinted  toward  and  inside  of  the  Church  and  saw  Officer  Baksh  giving \ndirections  to  responding  officers.",
  "Officer  Ortiz  saw  that  Officer  Rivers  was  bleeding \nprofusely  from  his  right  arm  and  attempted  to  render  medical  aid  to  him.",
  "Officer  Ortiz \ninitially  saw  both  Officers  Troy  Wunderlich  and  Nicholas  Bobbs  tending  to  the  subject \ndown on the ground before turning his attention to officer Rivers and placing a tourniquet \non his right arm.",
  "Summarized Statement of Officer Troy Wunderlich:   \n \nOn Tuesday, October 8, 2019 at approximately 1828 hours, Sergeant Marvin Aguilar and \nI  conducted  an  administrative  witness  interview  with  Officer  Troy  Wunderlich.",
  "This \ninterview  was  conducted  within  the  interview  room  located  in  the  Inglewood  Police \nDepartment’s  Internal  Affairs  Division.",
  "Sergeant  Aguilar  read  Officer  Wunderlich  a \nLybarger  Admonition  from  a  department  approved  Lybarger  Admonition  form.",
  "Officer \nWunderlich stated that he understood this admonition by stating, “Yes.” \n \nOfficer Wunderlich established that he has currently been employed with the Inglewood \nPolice Department for approximately eleven (11) and one half (1/2) years.",
  "His experience \nincludes being a current defensive tactics instructor and assigned to the Special Weapons \nand Tactics Team.",
  "On Wednesday, March 27, 2019, Officer Wunderlich was assigned as a member of the \nSpecial  Enforcement  Team  and  was  working  with  Officer  Bobbs.",
  "Officer  Wunderlich \nremembered hearing a radio call go out at the Church of Scientology regarding, “A man \n\n\f \n\nwith a sword.”  Officer Wunderlich remembers hearing one (1) unit show themselves on \nscene,  however,  he  did  not  remember  who  that  particular  officer  was.",
  "Based  on  the \nnature of the radio call, Officer Wunderlich felt he needed to respond.",
  "Officer Wunderlich could not recall hearing additional radio traffic specific to this radio call \nas he responded from the area of Cable Way.",
  "As he went on scene, he parked his patrol \nvehicle  just  north  of  the  location  on  Market  Street.",
  "Officer  Wunderlich  told  Sergeant \nAguilar  and  I,  that  he  was  not  aware  of  what  was  transpiring  inside  of  the  Church  of \nScientology due to the fact that he had not heard any radio broadcast from the officers \ninside of the Church.",
  "As Officer Wunderlich was about to open the main entry/exit glass doors, he heard what \nhe believed to be three (3) gunshot sounds come from within the Church of Scientology.",
  "Officer Wunderlich rushed into the Church and was directed by several people crouching \ndown  by  the  front  reception  desk  to  focus  toward  the  southern  portion  of  the  Church.",
  "Officer Wunderlich  made  his way  to  where  Officer Baksh  and  Officer Rivers  were  and \nvisually took in the scene.",
  "Officer Wunderlich saw Officer Baksh on top of the subject, \nwho was lying on the ground.",
  "He saw a gun on the ground next to Officer Rivers and his \narm hanging and bleeding.",
  "Officer Wunderlich tended to the subject on the ground by first, rolling him over onto his \nside.",
  "He retrieved a stun gun from the subject’s right front pants pocket and unwrapped \nthe garb from around his face.",
  "Officer Wunderlich stated that the subject was making \n“weird” noises, but did not speak any actual words to him.",
  "Officer Elias Alvarez assisted \nOfficer  Wunderlich  in  rendering  medical  aid  to  the  subject  by  starting  the  process  of \ncutting the clothing off of the subject.",
  "At that moment in time, Los Angeles County Fire \npersonnel arrived on scene and took over medical treatment of the subject.",
  "In terms of the gun that was on the ground, Officer Wunderlich stated that the gun was \nwithin one (1) arm’s length of Officer Rivers.",
  "He stated the gun appeared to be within \nthree (3) arm’s lengths of the subject who was on the ground.",
  "Summarized Statement of Officer Nicholas Bobbs: \n \nOn Tuesday, October 8, 2019 at approximately 1900 hours, Sergeant Marvin Aguilar and \nI  conducted  an  administrative  witness  interview  with  Officer  Nicholas  Bobbs.",
  "This \ninterview  was  conducted  within  the  interview  room  located  in  the  Inglewood  Police \nDepartment’s Internal Affairs Division.",
  "Sergeant Aguilar read Officer Bobbs a Lybarger \nAdmonition from a department approved Lybarger Admonition form.",
  "Officer Bobbs stated \nthat he understood this admonition by responding, “Yes.” \n \nOfficer Bobbs told Sergeant Aguilar and I, that he was employed as a Police Officer with \nthe Inglewood Police Department for just under four (4) years during the time of March \n2019.",
  "During his time with this police department, Officer Bobbs has been a Field Training \nOfficer  (FTO)  and  has  collateral  duties  of  being  assigned  to  the  Bike  Team  and  the \nRecruitment Cadre.",
  "On Wednesday, March 27, 2019, Officer Bobbs was assigned to the \n\n\f \n\nSpecial Enforcement Team.",
  "In regard to Wednesday, March 27, 2019, Officer Bobbs stated that he heard a radio call \ngo  out  of  a  subject  with  a  sword.",
  "Officer  Bobbs  stated  that  he  heard  Officer  Rivers \nbroadcast that he was on scene and that the subject in question did not have the sword \nin  his  possession.",
  "Based  on  the  circumstances  of  the  call,  Officer  Bobbs  wanted  to \nprovide additional assistance, so he and his partner Officer Wunderlich began to travel to \nthe radio call.",
  "Officer Bobbs stated that he and Officer Wunderlich parked on Market Street, just north \nof the Church of Scientology once they arrived on scene.",
  "While in route to this radio call \nhowever, Officer Bobbs stated that he was aware that Officer Baksh was on scene this \nparticular call as well.",
  "Officer Bobbs told Sergeant Aguilar and I, that he heard Officer \nBaksh ask Officer Rivers what his location was  on the radio, via mobile.",
  "Officer Bobs \nstated  that  he  did  not  hear  Officer  Rivers  respond  to  Officer  Baksh  on  the  radio,  via \nmobile.",
  "Officer Bobbs believes that he and Officer Wunderlich were around the corner \nfrom  the  Church  of  Scientology  when  Officer Baksh attempted  this  radio  dialogue  with \nOfficer Rivers.",
  "As  Officer Wunderlich  and  Officer  Bobbs  were  standing  in  front  of  the  entry/exit  glass \ndoors,  Officer  Bobbs  heard  three  (3)  gunshot  sounds  come  from  within  the  Church  of \nScientology.",
  "He and Officer Wunderlich immediately went into the Church and Officer \nBobbs stated that he initially only saw Officer Baksh and Officer Rivers.",
  "Officer Bobbs \nstated that he was told by the two (2) officers involved in this incident that the subject had \nalready been detained.",
  "In visually examining the initial aftermath, Officer Bobbs told Sergeant Aguilar and I, that \nOfficer Baksh was standing just slightly behind Officer Rivers on his left side with his gun \ndrawn.",
  "Officer  Rivers  was  hunched  over  dangling  his  right  arm,  which  was  bleeding.",
  "Officer Bobbs believes that Officer Rivers was in possession of his firearm.",
  "The subject \nwas lying on the ground face down in front of Officer Baksh.",
  "Officer Bobbs described the \nsubject as being one (1) arm length away from Officer Baksh and one (1) and one half \n(1/2) arm lengths away from Officer Rivers.",
  "Officer Bobbs stated that he physically saw Officer Baksh remove Officer Rivers’ firearm \nfrom his possession and render it safe and place it on top of a table.",
  "After observing this, \nOfficer Bobbs saw that Officer Rivers in fact suffered a gunshot wound to his right arm, \njust above his elbow.",
  "Officer Bobbs also saw  what he believed to be two (2) gunshot \nwounds to the back area of the subject who was lying on the ground.",
  "Officer Wunderlich \nand Officer Bobbs searched the subject lying on the ground for weapons and then Officer \nBobbs proceeded to broadcast radio traffic asking for paramedic assistance.",
  "Officer Bobbs did state that why he and Officer Wunderlich conducted a search of the \nsubject,  a  stun  gun  and  a  Los  Angeles  Police  Department  Sergeant  badge  were \nrecovered.",
  "Summarized Statement of Officer Elias Alvarez: \n \nOn Wednesday, October 9, 2019 at approximately 1740 hours, Sergeant Marvin Aguilar \nand  I  conducted  an  administrative  witness  interview  with  Officer  Elias  Alvarez.",
  "This \ninterview  was  conducted  within  the  interview  room  located  in  the  Inglewood  Police \nDepartment’s Internal Affairs Division.",
  "Sergeant Aguilar read Officer Alvarez a Lybarger \nAdmonition  from  a  department  approved  Lybarger  Admonition  form.",
  "Officer  Alvarez \nconfirmed he understood this admonition by responding, “Yes.” \n \nAt the onset of this interview, Officer Alvarez told Sergeant Aguilar and I, that he has been \nemployed with the Inglewood Police Department as a Police Officer for over thirteen (13) \nyears.",
  "Officer Alvarez is currently a Filed Training Officer (FTO) and a department First \nAid and cardiopulmonary resuscitation (CPR) instructor.",
  "Officer Alvarez is a member of \nthe Bike Patrol Team and a member of the defensive tactics cadre.",
  "Officer Alvarez is \nalso a former SWAT team member.",
  "On Wednesday, March 27, 2019, Officer Alvarez was working with an officer that he was \ntraining  at  the  time,  Officer  Christian  Tapia.",
  "Officer  Alvarez  recalls  hearing  Inglewood \nPolice  Communications  broadcast  an  “11-99  officers  need  help”  radio  call  for  315  S. \nMarket Street.",
  "Due to the fact that Officer Alvarez was already on a call for service at the \nVons Market (500 E. Manchester Boulevard) with his second phase trainee, he did not \nreally  pay  attention  to  the  initial  radio  call  at  the  Church  of  Scientology  and  any \nsubsequent radio transmissions prior to the 11-99 being broadcast.",
  "Being mere blocks away from the Church of Scientology, Officer Alvarez and his partner \nresponded upon hearing this call for help go out.",
  "As Officer Alvarez arrived on scene on \nMarket Street, he recalled seeing several parked police vehicles on Market Street.",
  "Officer \nAlvarez  made  his  way  into  the  Church  of  Scientology  and  saw  Officer  Rivers  with  a \ntourniquet on his arm sitting in a chair.",
  "Officer Rivers was still bleeding from his arm so \nOfficer Alvarez applied his tourniquet to Officer Rivers’ arm to halt the bleeding.",
  "Officer \nAlvarez then turned his attention to the subject that was lying on the ground suffering from \ngunshot wounds.",
  "Officer Alvarez began to cut the subjects shirt off to render medical aid \nto him and saw that he was shot in the chest.",
  "As this was unfolding, Los Angeles County \nFire personnel arrived and took over emergency medical aid for the subject.",
  "Officer Alvarez told Sergeant Aguilar and I, that he had no idea what transpired inside of \nthe Church of Scientology prior to him arriving on scene and entering the Church.",
  "Officer \nAlvarez  had  no  idea  regarding  the  role  the  subject  lying  on  the  ground  played  in  this \nincident, nevertheless, Officer Alvarez felt it was necessary to render medical aid to the \nsubject.",
  "Officer Alvarez stated, “It was a person who was bleeding at that point in time \nand I needed to stop the bleeding.” \n \nSummarized Statement of Sergeant Freeman Smith: \n \nOn Thursday, October 31, 2019 at approximately 2305 hours, Sergeant Marvin Aguilar \nand I conducted an administrative witness interview with Sergeant Freeman Smith.",
  "This \n\n\f \n\ninterview  was  conducted  within  the  interview  room  located  in  the  Inglewood  Police \nDepartment’s Internal Affairs Division.",
  "Sergeant Aguilar read Sergeant Smith a Lybarger \nAdmonition  from  a  department  approved  Lybarger  Admonition  form.",
  "Sergeant  Smith \nstated that he understood this admonition by responding, “Yes.” \n \nSergeant  Smith  established  that  he  has  been  employed  with  the  Inglewood  Police \nDepartment for approximately twenty-two years (22) with the last five (5) years being as \na Sergeant.",
  "Sergeant Smith currently has ancillary duties as an investigator assigned to \nthe  department’s  officer  involved  shooting  response  team  and  the  department’s  crises \nnegotiation team.",
  "Sergeant Smith confirmed that on Wednesday, March 27, 2019, he was working uniform \npatrol  as  a  field  supervisor  with  the  call  sign  of  4S20.",
  "Sergeant  Smith  stated  that  he \nremembered a suspicious subject radio call being broadcasted with additional information \nthat a subject was armed with a sword inside of the business.",
  "Sergeant Smith responded \nto this radio call from the area of Florence Avenue and Eucalyptus Avenue.",
  "While Sergeant Smith was in route to this radio call, he stated that he was aware that \nboth Officer Rivers and Officer Baksh were responding to this radio call.",
  "Sergeant Smith \ntold Sergeant Aguilar and I, that he remembered hearing Officer Baksh attempt to raise \nOfficer Rivers on the radio via mobile, however, he never heard Officer Rivers respond.",
  "Officer Baksh was asking Officer Rivers where he was and what needed to be done.",
  "Sergeant Smith recalls hearing a radio broadcast that the subject was no longer armed \nwith the sword as he was still in route to the Church of Scientology.",
  "Based on the lack of \nradio traffic by the officers that were on scene, Sergeant Smith was not aware that officers \nhad made their way into the Church of Scientology.",
  "Sergeant Smith did relay that in his \nopinion, the radio traffic that Officer Baksh broadcasted, via mobile, was an attempt by \nhim to coordinate a game plan with Officer Rivers in how to contact the subject.",
  "Sergeant \nSmith  did  not  recall  hearing  radio  traffic  in  which  multiple  transmissions  were  being \nbroadcasted at the same time causing an officer’s broadcast to not be heard.",
  "The Officer Involved Shooting occurred just prior to Sergeant Smith arriving on scene.",
  "As \nSergeant Smith arrived on scene, he made his way into the Church of Scientology and \nobserved Officer Baksh and his injury as well as Officer Rivers and his injury.",
  "Sergeant \nSmith stated that the subject was lying on the ground with Officer Wunderlich holding him \ndown.",
  "Sergeant Smith was not sure if the subject on the ground was handcuffed or not.",
  "Seeing  that  he  had  several  assisting  officers  inside  of  the  Church  of  Scientology, \nSergeant  Smith  walked  outside  to  the  front  of  the  Church  to  coordinate  a  medical \nresponse as well as the crime scene perimeter.",
  "Summarized Statement of Witness \n \nThis  interview  was  conducted  on  Wednesday,  March  27,  2019  at  approximately  1815 \nhours by Inglewood Police Detective Jeremy Crossen.",
  "This interview was conducted at \nthe Inglewood Police Department in the Detective Bureau Interview room.",
  "told Detective Crossen that she is employed with the Church of Scientology \nas  the  Community  Public  Receptionist.",
  "Her  job  includes  meeting  with  the  people  that \ncome into the Church and answering telephone calls.",
  "has been employed \n  told \nwith  the  Church  of  Scientology  for  approximately  four  (4)  years.",
  "Detective Crossen that she began her workday at the Church of Scientology at 8:45am.",
  "described the beginning of her work day as light and airy and like a breeze. months ago.",
  "received  a  telephone  call  at  the  reception  desk  from  a \nLater  in  the  day \n stated that she used to live with Brandon \ngentleman she knows as Brandon.",
  "stated that Brandon no longer lives \nand his girlfriend \n and her young daughter still live there.",
  "Nevertheless, \nat the apartment, however, \nduring this initial phone conversation, \n stated that Brandon asked to speak \nwith two different people at the church and eluded to needing to take care of his daughter.",
  "during this phone conversation that he \nThis male subject on the phone told \nmay come over today and he’ll be packed.",
  "took this subject’s statement to \nmean that he was going to have a weapon.",
  "let another female employee know what just transpired over the phone and \nwas  asked  to  write  a  report  detailing  the  telephone  call.",
  "Shortly  after  completing  the \nreport, a gentleman she recognized as Brandon walked into the Church.",
  "Brandon entered \nthe Church wearing Japanese garb and utilizing a cane with a sword attached to his back.",
  "that  he  needed  to  speak  with  another  female  employee  or \nBrandon  told \nsomebody, at which time a male employee contacted him.",
  "stated that a male employee told Brandon that he had to take \nUltimately, \nhis sword outside, at which time Brandon placed it inside of his parked vehicle in front of \n  telephoned  Inglewood  Police  Communications  in  regard  to \nthe  Church.",
  "stated that a “black officer” arrived and walked into \nwhat was transpiring.",
  "stated that she directed the officer \nthe Church asking, “Where are they at?”  \nto where Brandon was.",
  "Moments later she heard the officer say, “Do as I tell you” and \nwhen she looked over to where they were from her position at the reception desk, she \ncould see that the officer was on the floor.",
  "told Detective Crossen that she could not see the entirety of the struggle \nbetween the officer and Brandon and admitted to Detective Crossen that she did not see \n did hear two (2) \none of the officers [Officer Baksh] come into the Church.",
  "gunshots during this incident.",
  "did not see who shot a gun or who had the \ngun in their possession.",
  "told Detective Crossen that she assumes the officer \nhad the gun because she could see him from the waist down.",
  "if she saw any other officer go to the back room \nDetective Crossen asked \nand \n \nwas asked if she could have missed another officer going back there and she responded, \n“Oh no.” \n \n\n told Detective Crossen that it was just the black officer.",
  "Summarized Statement of Witness \n \nThis interview was conducted on Thursday, July 25, 2019 at approximately 1026 hours.",
  "The interview was conducted by Inglewood Police Detective Michael Han in the interview \nroom located within the Inglewood Police Department’s Detective Bureau.",
  "This was the \nsecond time\n had been interviewed by detective personnel.",
  "The first interview \nwas  conducted  on  the  evening  of  March  27,  2019,  however  that  interview  was  not \nrecorded.",
  "told Detective Han that he has been a member of the Church of Scientology \nsince 1986, however he has been employed by the Church for approximately seventeen \n position is the Director of Special Affairs and he also deals \n(17) months. with Community Relations.",
  "stated that he was inside of the \nIn terms of Wednesday, March 27, 2019, \nChurch  of  Scientology  in  a  downstairs  office  when  he  received  a  phone  call  from  the \nreceptionist that a man with a sword was inside of the Church.",
  "When \n arrived \nupstairs he saw a male employee speaking with a subject who was seated in a chair.",
  "The \n stated that the \nsubject that was seated had a sword attached to his back.",
  "male employee was doing a good job and asked the subject to place the sword into his \nvehicle.",
  "The subject went outside and placed his sword into a vehicle parked in front of the Church \n \nand came back inside.",
  "Since the subject did not have the sword with him anymore, \n verbally engaged the subject and walked him to an area around the corner from \n  describes  this  area  as  the \n described the subject as being dressed “kind of weird” \n thought  the  subject  was  a \n\nthe  reception  area,  near  the  testing  area.",
  "audio/visual room. with  “ninja  style  type  of  stuff” with  a  hood  on.",
  "white-guy with a touch of Asian.",
  "While \n  thought  the \nsubject was kind of strange.",
  "He thought the subject was saying silly things.",
  "The subject \nwas also in possession of a long decorative cane.",
  "Shortly after, a black officer walked in \n \nand \n stated that the subject had his hand on the cane and the officer asked the subject \nto take his hands away from the pole.",
  "stated that the subject would not move \nso the officer pulled his gun at that point.",
  "The officer again ordered the subject to get his \nhands off of the pole.",
  "stated that the subject definitely was not responding \nto the officer.",
  "and a female employee to come from \nAt that point the black officer asked \nout of that particular area and walk toward him.",
  "stated that as he and  the \nfemale employee were getting ready to comply with the officer, the subject picked up a \ncellular phone which the officer ordered the subject to put back down and the subject was \n and the female employee reached the reception desk \nnot responding.",
  "As \n  described  this \narea,  a  second  officer entered  the  Church  of  Scientology.",
  "told Detective Han that the officer “was probably a little nervous.”  \n\n  is  sitting  down  speaking  with  the  subject, \n\n\f \n\nsecond officer as white, “for sure.” \n \nAs \n was standing near the reception desk area, he admitted that he could not \nsee what was going on within the area in which the subject and the two (2) officers were.",
  "He  told  Detective  Han  that  there  was  a  wall  and  he  could  hear noises  as  if  they  were \n \nslamming  against  the  wall  and  the  noise  was  very  loud.",
  "After  several moments, \n stated that he could barely see one (1) officer.",
  "After a second of barely seeing \n  told \nthat  one  (1)  officer, all  three  (3)  subjects  went  crashing  to  the  floor.",
  "Detective Han that there were tables and chairs on that side, however, he could see the \nblack officer and his hands.",
  "He could see that the black officer was “struggling like crazy” \nto  get  the  subject’s  arm  behind  his  back.",
  "During  the  struggle \n  heard \nsomeone, who he could not make out from within the struggle, say the word “shit” very \nclear.",
  "stated that at this moment, the black officer was very visible to him and he \nsaw that black officer reach, pull his firearm and fire two rounds toward the subject.",
  "After \nthose two rounds were fired, \n stated that the officer placed his gun back into \nhis holster.",
  "was convinced that there was something going wrong during the \nstruggle for someone to yell out “shit.”  He did not see what went wrong and he does not \nknow for sure, but he believes something went wrong which caused the black officer to \nshot.",
  "EVIDENCE: \n \nSenior  Forensic  Specialist  Celeste  Hewson,  Forensic  Specialist  Vanessa  Tovar  and \nForensic  Specialist  Aundria  Anderson  of  the  Inglewood  Police  Department’s  Forensic \nServices  Division  responded  to  315  S.  Market  Street,  the  Church  of  Scientology,  to \nprocess this crime scene.",
  "In processing this crime scene, Forensics personnel notated, \nphotographed  and  collected  all  evidence  that  was  discovered  inside  of  the  Church  of \nScientology as well as within the perimeter of this crime scene.",
  "Evidence that was identified within the Church of Scientology and recovered by Forensics \npersonnel would be the following: \n \nWithin the Testing Area:     \n\n  \n\n(1) Firearm belonging to Officer Rivers \n(1) Law enforcement badge \n\n \n \n  Officer Rivers’ duty belt, vest, T-shirt, baton, magazine \n  Officer Rivers’ belt keepers, hobble and radio mic.",
  " \n  Vape pens/vape accessories, stun gun \n  Suspect clothing \n  Bloodstains \n\n(1) Live 9mm round \n\n \nWithin the Test Evaluation & Registration Area: \n(3) expended cartridge cases, 9mm \n\n \n\n\f \n\n  Sunglasses \n  Hat \n  Pepper Spray \n  Cellular phone \n  Cane \n  Fan \n  Backpack \n\n \nWithin the Introductory Films & Bookstore Area: \n\n \n \n \n\n(1) DVD damaged from a projectile \n(1) projectile that damaged the DVD \n(1) Projectile  \n\n \nEvidence  that  was  identified  outside  of  the  Church  of  Scientology  yet  inside  of  the \nperimeter of the crime scene would be the following: \n \nIn front of 315 S. Market Street: \n\n  Ford Explorer Police vehicle #1424, License #1462962 \n  Subject’s identified vehicle – 2005 white Bentley with paper plates \n  Ford Explorer Police vehicle #1438, License #1547133 \n\n \nOn Thursday, March 28, 2019, Celeste Hewson, Vanessa Tovar, Aundria Anderson and \nSergeant  Blaylock  were  present  in  the  Inglewood  Police  Department’s  Forensic \nLaboratory at approximately 1330 hours.",
  "At this time, an evidentiary weapon inspection \nwas conducted of both Officer Baksh and Offer Rivers’ duty weapons.",
  "Officer  Baksh’s  department  issued  Glock  17  9mm  semi-automatic  handgun  (serial \nnumber  FNA754)  was  loaded  with  one  (1)  live  9mm  round  in  the  chamber.",
  "His  duty \nmagazine  was  loaded  with  fourteen  (14)  live  department  issued  9mm  rounds.",
  "Officer \nBaksh had two (2) additional duty magazines that were recovered from his duty belt.",
  "Both \nof those magazines were loaded with seventeen (17) live department issued 9mm rounds.",
  "Officer Rivers’ department issued Glock 17 9mm semi-automatic handgun (serial number \nHEL447) did not have a live round in the chamber.",
  "His duty magazine was loaded with \nseventeen (17) live department issued 9mm rounds.",
  "There were two loaded magazines \nthat  were  recovered  from  Officer  Rivers’  duty  belt.",
  "Both  magazines  were  loaded  with \nseventeen (17) live department issued 9mm rounds.",
  "On  April  4,  2019,  the  Verdugo  Regional  Crime  Laboratory  received  reference  DNA \nsamples  pertaining  to  both  Officer  Rivers  and  Officer  Baksh.",
  "On  April  9,  2019,  the \nVerdugo Regional Crime Laboratory received swabs from Officer Rivers’ gun and holster, \nthe subject’s (identified as Brian Statler) stun gun and cane and Officer Baksh’s holster \nand gun.",
  "On June 5, 2019, a Forensic Biology Report was produced which concluded that the DNA \nprofile obtained from Officer Rivers’  gun swab is a mixture DNA profile which includes \n\n\f \n\nthree  (3)  individuals.",
  "Comparisons  of  the  profiles  and  those  conclusions  would  be \ndocumented  in  a  supplemental  report.",
  "On  June  8,  2019,  a  second  Forensic  Biology \nReport was completed in reference to this case.",
  "This report concluded that Officer Baksh, \nOfficer  Rivers  and  the  subject  (Brian  Statler)  were  contributors  to  the  DNA  profile  on \nOfficer  Rivers’  gun.",
  "This  report  also  concluded  that  the  probability  of  an  individual \nunrelated to these three (3) being included as possible contributors is 1 in 440 trillion.",
  "SCENE DESCRIPTION: \n \nThe Church of Scientology is a two-story building with a basement that is below ground \nlevel.",
  "The front entrance to the building is located along Market Street and faces east.",
  "The entire front façade of the Church of Scientology is glass with glass entry/exit doors.",
  "There is a parking lot belonging to the Church of Scientology just south of the building.",
  "The parking lot is enclosed by a black wrought iron fence.",
  "Just  inside  of  the  entry/exit  glass  doors  is  a  brown  wood  type  reception  desk  with  a \npartition several feet behind the desk.",
  "The north/east area of the Church of Scientology \nwas occupied by several burgundy colored chairs, one (1) built-in brown wood type desk \nand  several bookcases.",
  "This  area  is the  bookstore area  as  identified  by  an  overhead \nsign  which  reads,  “Bookstore.”    This  particular  area  is  immediately  to  the  right  of  the \nreception area and the entry/exit glass doors.",
  "Immediately  to  the  left  of  the  entry/exit  glass  doors  and  the  reception  area  is  an  area \nwhich encompassed one (1) built in brown wood type desk, two (2) movable brown wood \ntype desk with each desk containing room for four (4) individuals to sit with accompanying \nbrown wood type chairs.",
  "This area was identified by an overhead sign as the “Testing” \narea.",
  "Just west of the testing section is a large opening which leads to a new section \nwithin the Church of Scientology.",
  "This section was clearly identified with an overhead \nsign  as  the  “Test  Evaluation  &  Registration”  section.",
  "Within  this section  were  several \nbrown wood type desk with several chairs.",
  "The way in which this particular section was \ndesigned within the Church of Scientology, the only way to enter the test evaluation and \nregistration section is to go through the testing section.",
  "In terms of the crime scene, it appeared this incident took place in the southern portion \nor section of the Church of Scientology, on the main entry level.",
  "This particular section \nof  the  main  entry  level,  also  identified  as  the  ground  floor,  is  identified  as  the  testing \nsection  to  Church  of  Scientology  employees  and  patrons.",
  "Based  on  the  physical \nevidence  as  well  as  witness  interview  accounts,  this  incident  began  in  the  “Test \nEvaluation & Registration” section and spilled out into the “Testing” section.",
  "BACKDROP: \n \nThis incident occurred within the Church of Scientology in the southern most portion of \nthe building.",
  "Based on the fact that this shooting occurred while all three (3) individuals \nwere on the ground tussling, there was no definitive backdrop for Officer Baksh.",
  "Based \non evidence discovered and recovered at the scene, Officer Baksh fired his duty weapon \n\n\f \n\nfrom  the  “Testing”  area  of  the  Church  in  a  northern  direction.",
  "Directly  north  of  the \n“Testing” area is the “Bookstore” and “Introductory Films” area.",
  "PERSONNEL INVOLVED: \n \nOfficer Julian Baksh and Officer Jonathan Rivers were the only two (2) Inglewood Police \nOfficers  involved  in  this  incident.",
  "Officer  Baksh  was  the  only  officer that fired  his  duty \nweapon during this incident.",
  "Officer Baksh as well as Officer Rivers were dressed in a \ncomplete Inglewood Police Department Class B uniform.",
  "Officer Baksh was  equipped \nwith  his  department  issued  Glock  17  9mm  semi-automatic  handgun  (serial  number \nFNA754).",
  "Officer  Baksh  previously  qualified  with  his  department  issued  handgun  on \nWednesday, February 6, 2019, with Inglewood Police Department Range Master, Officer \nMax Koffman.",
  "ADDITIONAL INFORMATION: \n \nSergeant Juan Torres obtained a public safety statement from Officer Julian Baksh prior \nto Officer Baksh being transported from the Church of Scientology to UCLA Westwood \nMedical  Center.",
  "Details  regarding  this  public  safety  statement  were  documented  in \nInglewood  Police  Follow-up  Report  #16  under  Inglewood  Police  Department  General \nOffense number 2019-20361.",
  "Sergeant Freeman Smith obtained a public safety statement from Officer Jonathan Rivers \nwhile on scene at UCLA Westwood Medical Center.",
  "Details regarding this public safety \nstatement were documented in Inglewood Police Follow-up Report #17 under Inglewood \nPolice Department General Offense number 2019-20361.",
  "Officer Rivers and  Officer Baksh  were  transported  together in  the  same ambulance  to \nUCLA Westwood Medical Center.",
  "Officer Landon Poirier rode in the ambulance with the \ntwo  (2)  officers  and  no  sergeant  was  present  during  this  ambulance  transport.",
  "Both \nOfficer Rivers and Officer Baksh stated that they did not discuss details of this shooting \nincident while in the ambulance.",
  "Officer  Christian  Tapia,  the  partner  of  Officer  Elias  Alvarez  during  this  incident,  is  no \nlonger an Inglewood Police Department employee as he resigned in May of 2019.",
  "There  is  a  discrepancy  in  terms  of  time  between  the  time  documented  on  all  call  logs \npertaining to this event and the time stamp on all audio pertaining to this event.",
  "The time \nstamp on the audio recording of this incident and the radio transmissions pertaining to \nthis incident are approximately two (2) minutes sooner than the time documented in the \ncall logs for the same telephone call and radio transmissions.",
  "INCIDENT SUPERVISORS / INVESTIGATORS: \n \nWatch Commander  \nField Sergeant \n \nCriminal Investigators \nScientific Services Section \n\n \n \n \n\n \n \n \n\nLieutenant Greg Held \n \nSergeant Freeman Smith   \nDetectives Michael Han and Cesar Jurado \nCeleste  Hewson,  Vanessa  Tovar  and  Aundria \nAnderson  \nSergeants Marvin Aguilar and Geoffrey Meeks \n\n \n \n\n \n\nOfficer Involved Shoot Team \n \n \n \nGEOFFREY P. MEEKS \nSergeant/Officer Involved Shooting Investigation Team"
]