[
  "ORANGE COUNTY DISTRICT ATTORNEY’S OFFICE \nBUREAU OF INVESTIGATION \n \nINTERVIEW REPORT \n\n \n \n\n \n\nSA 18-015 \n\n \n\n \n\n \n\n \n\nCASE NAME:  RODNEY JOHN DANIELS JR \n\nCLASSIFICATION:  CUSTODIAL RELATED DEATH \n\nINTERVIEW OF: \n\n \n\nPRESENT:  DETECTIVE JUSTO CAPACETE SAPD \n\nDATE AND TIME:  4/24/18 0855 HOURS \n\n \n\nLOCATION:  NOVA ACADEMY 500 WEST SANTA ANA BLVD \n\n \n\nOn 04-24-18, at 0855 hours, Detective CAPACETE and I interviewed \n\nthe  interview  was  audio  recorded.",
  "works  for  Nova  Academy  as  an  Administrative \n\nAssistant.",
  "was working 4-20-18, and her desk is in the front of the Nova Academy, \n\nwith a clear view outside, into the walkway area, of Ross Street and 4TH Street.",
  "saw a \n\nmale  subject  walking  across  the  street  at  Ross  Street  and  4th  Street.",
  "The  subject  was \n\nblocking traffic, and he was trying to open car doors on vehicles that were stopped.",
  "observed the subject exit the street and sit briefly by the trees, north of the \n\nNova Academy; the subject sat there briefly before walking back out in the street.",
  "saw \n\n  (Universal  Security  assigned  to  Nova  Academy)  and \n\n \n\n \n\n \n\n (custodian/security for Nova Academy) trying to get the subject to sit down; the \n\nsubject was not cooperating with them.",
  "Investigator: Holford \n\nDate of Report:4-27-18 \n\n  Approved By: \nDate:05/04/18 \n\n \n\nPage 1 of 3 \n\n\fThe  school  bell  rang,  and  students  were  exiting  the  school.",
  "saw \n\n, \n\n \n\nSA 18-015 \n\n, and \n\n(assistant principle for Nova Academy) standing by the \n\nsubject, who was now sitting on the school’s front steps.",
  "The Nova Academy staff was trying \n\nto make sure the subject did not interact or contact any of the students as they were exiting \n\nthe  school.",
  "estimated  six  police  officers  arrived.",
  "saw  the  police  officers \n\napproach the subject and talk to him briefly.",
  "After talking to the subject, the officers tried \n\nhandcuffing him; the subject kicked and swung his arms to avoid being handcuffed.",
  "did not see the police officers using any force while trying to handcuff the subject. I then ended the interview.",
  "Investigator: Holford \n\nDate of Report:4-27-18 \n\n  Approved By: \nDate:05/04/18 \n\n \n\nPage 2 of 3 \n\n\f \n\n \n\n \n\nSA 18-015 \n\nInvestigator: Holford \n\nDate of Report:4-27-18 \n\n  Approved By: \nDate:05/04/18 \n\n \n\nPage 3 of 3"
]