[
  " \n\n \n\nINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR'S FOLLOW-UP REPORT \n \n \n\n \nDATE: \n\nVICTIM 1.",
  "January 30, 2021 \n\nCRIME:  245(A) 2 P.C.",
  "/ OIS \n\nDR#  2021-6027 \n\n  \n\n   VICTIM 2.",
  "SUSPECT 1. REED, KAMERON \n\n  \n\n   BOOKING NO.",
  "SUSPECT 2. SNODDY, KRISTAL \n\n   BOOKING NO. SUSPECT 3. BOOKING NO.",
  "INVESTIGATED BY: \n\nInformation Obtained \n\n           \n \n L. RODRIGUEZ #839 \n\nFollow-up investigation: \nOn Saturday 1/30/21, at approximately 1245 hours, I (Detective L. Rodriguez #839) received a call from \nIPD Sgt.",
  "C. Islas #870 informing me that an Officer Involved Shooting had occurred in the city Inglewood \nand requested for me to respond as the lead Investigator and investigate the incident.",
  "Sgt. Islas also \ntold me that the incident was still active the suspect was still outstanding and IPD Patrol units were \nestablishing a containment.",
  "IPD Detectives A. Cornejo #904, J. Aranda #691, W. Salmon #686, H. \nMorgan #1004, and J. Crossen #977 were also called out and assigned to assist me in the investigation.",
  "At approximately  1300  hours, I  was  informed  by  Sgt.",
  "Islas that  the male  suspect  (later  identified as \nKameron Reed) was found hiding within the containment and taken into custody by IPD Patrol Officers \nwithout  incident.",
  "Suspect  Reed  had  sustained  a  single  gunshot  wound  to  his  left  forearm  and  was \ntransported to Centinela Medical Center for further treatment.",
  "Prior to being transported to the hospital, \na  field  show-up  was  conducted  of  S-Reed  by  Inglewood  Police  Patrol  units  and  he  was  positively \nidentified by the victim (Identified as \n as the suspect who shot at him during a traffic \ncollision in the area of Prairie Avenue and Arbor Vitae street.",
  "I also learned there was a female suspect \n(later identified as Kristal Snoddy) was also taken into custody and she was positively identified by the \nvictim during a field show up at the scene and booked at IPD Jail.",
  "For further details of the arrests, see \narrest supplemental reports completed by Officers M. Austin #1062 and J. Delgado #1034.",
  "At approximately 1400 hours, I arrived at the Inglewood Police Station and met with Sgt.",
  "Islas, Lt. G. \nHeld #834, Detectives A. Cornejo, J. Aranda, W. Salmon, H. Morgan, J. Crossen and IPD Forensics \nSupervisor R. Paul.",
  "We were then briefed on the circumstances of the case.",
  "I learned that on today’s \ndate (1/30/21) at approximately 1200 hours, Inglewood Police Officers were dispatched to a radio call \nof  an  assault  with  a  deadly  weapon  at  Inglewood  Avenue  and  Hillcrest  Boulevard  in  the  city  of \nInglewood (Incident #2021-6027).",
  "IPD Dispatched advised the reporting party / victim \n was involved in a collision with \nanother driver and shortly after, the driver described as a male Black with a female black passenger \nshot at the reporting party / victim \n with a firearm, but he was not struck by the bullet.",
  "The reporting party / victim \n was following the suspect who was driving a black Infiniti and \nheaded northbound La Brea Avenue at Florence.",
  "IPD Patrol units responded to the area and Officer \nRogers #1046 (Patrol Unit 4L12) observed the black Infiniti driving at a high rate of speed northbound \nLa Brea Avenue from Florence Avenue and followed him.",
  "The black Infiniti then turned west on Hyde \nPark Boulevard where it collided with a tree on the 100 block of W. Hyde Park Boulevard.",
  "Suspect K. \n\n \nIPD FORM MWS 9529 \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 2 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \nReed exited the black Infiniti and an Officer Involved Shooting occurred.",
  "Suspect Reed fled the location \non foot and a containment was set up.",
  "The female suspect passenger (Kristal Snoddy) was detained \ninside the black Infiniti and taken into custody.",
  "I  spoke  with  Patrol Sgt. V.  Serrano  and he provided  me  the Public  Safety  Statement  obtained from \nOfficer Rogers at the scene. Sgt.",
  "Serrano stated the Officer Involved shooting occurred at La Brea \nAvenue and Hyde Park Boulevard and involved IPD Patrol Officer Rogers #1046.",
  "Officer Rogers fired \napproximately 5-8 rounds from his duty weapon in a northwest direction from Hyde Park Boulevard and \nJuniper Street and his backdrop was a grey colored stucco building (H-HY Tech Spinning Inc. 115 W. \nHyde Park Blvd.)",
  "The outstanding suspect was described as a male Black, 20-25 years, wearing a black shirt, red jogging \npants  and  was  armed  with  a  blue  steel  handgun  in  his  right  hand.",
  "Suspect  was  last  seen  running \nnorthbound alley of Lamos street from westbound Hyde Park Boulevard. Sgt.",
  "Serrano confirmed the \nfemale  suspect  passenger  was  detained  at  the  scene  and  positively  identified  by  the  victims  then \ntransported to hospital for treatment of her injuries as a result from the traffic collision.",
  "Sgt. Serrano \nalso said there was a containment was established in the area where S-Reed was last seen running \n(La Brea Avenue, Plymouth Street, Eucalyptus Avenue and Hyde Park Boulevard).",
  "Inglewood Police Officer Rogers #1046 was escorted to the Inglewood Police Department Station by \nSgt.",
  "Espinoza #893 and the Legal Attorney firm was notified.",
  "Attorney Bijan Darvish was informed and \nrequested to response.",
  "The on-duty Watch Commander, Lt. Figueroa notified the Los Angeles County \nDistrict  Attorney’s  Office  and  D.A.",
  "Investigator’s  Deborah  Delport  and  Investigator  Yatman  were \nassigned to the case.",
  "At  approximately  1500  hours,  I  spoke  with  Deputy  D.A.",
  "Deborah  Delport  from  the  Justice  System \nIntegrity Division.",
  "She informed me that she and her Senior D.A.",
  "Investigator Christie Yatman would \nbe in-route to the station for the investigation regarding the Officer involved shooting.",
  "At approximately \n1540 hours, D.A.",
  "Delport and Investigator Yatman arrived at the Detective Bureau and I briefed them \non the circumstances of the case.",
  "Assisting IPD Detective W. Salmon and J. Crossen responded to \n \n \nthe crime scene and transported the victims, \n\n and witnesses \n\n \n\n \n\n \n\n \n\n and \n\n \n\n for follow up interviews.",
  "Interview was audio and video recorded \n\n \nStatement from Witness \n \nDetective A. Cornejo conducted the follow-up interview of witness \naudio and video recorded.",
  "I spoke with Detective Cornejo and he told me in summary that W-\nwas in the area of Hyde Park Boulevard and Lamos Street working with other employees for \n\n  The interview was \n \n \n when he heard 3 to 4 gunshots and saw a male subject running past him on the sidewalk.",
  "W-\n described the subject to be a male Black wearing all red clothing and his hair in dreadlocks.",
  "was not sure how tall the subject was believed he was of normal height and average build \nNFD.",
  "W-\n said he could not identify the subject if seen again and did not want to look at any \nphotographic  line-ups.",
  "For  further  details  of  the  interview,  see  supplemental  report  completed  by \nDetective A. Cornejo.",
  "Statement from Witness \n \nDetective  W.  Salmon  conducted  the  follow-up  interview  of  witness \naudio and video recorded.",
  "I spoke with Detective W. Salmon and he told me in summary that W-\n\n    The  interview  was \n \n\n  Interview was audio and video recorded \n\n \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 3 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \nwas in the area of Hyde Park Boulevard and La Brea Avenue with two co-workers loading a large trash \ncontainer on the garbage truck.",
  "W-\n said he heard a loud noise coming from near where they were \nloading the truck.",
  "He then saw a subject running towards their direction and the sound of two or three \nwhat he believed to be gunshots.",
  "The subject ran past him, his coworkers, and the garbage truck on the sidewalk.",
  "The subject turned \non a different street and ran out of sight.",
  "He did not see the subject carrying anything in his hands.",
  "described  the  subject  as  the  following:  male,  black  adult,  between  twenty  and  thirty  years  old, \n\n if he could \n marked the paper where the garbage and scout truck where.",
  "He then \n\nwearing a red shirt, red pants, with a dark complexion.",
  "Utilizing a map of the area where the incident took place, Detective W. Salmon asked \nshow me where he was.",
  "showed me where he heard the noise coming from and where the subject ran from and to.",
  "Detective Salmon said he labeled the paper with the report number and the locations of the scout and \ngarbage truck.",
  "Detective W. Salmon asked \n if he could identify the subject if he saw him again, he \n was presented with a photographic line-up by Assisting Detective J. \nsaid he did not think so.",
  "W-\nAranda,  however  he  was  unable  to  identify  the  Suspect  Kameron  Reed.",
  "For  further  details  of  the \ninterview, see supplemental report completed by Detective W, Salmon.",
  "in  the \nAt  approximately  1600  hours,  I  conducted  the  follow-up  interview  of  victim \npresence of D.A.",
  "Delport and D.A. Investigator Yatman.",
  "The interview was audio and video recorded.",
  "Summarized Statement from Victim \nI asked V-\ntoday’s date (1/30/21) she was with her son, named \ndriving to her restaurant (\nsome food products.",
  "seated in the back seat. They were traveling southbound Prairie Avenue from Manchester Boulevard.",
  "Interview was audio and video recorded  \n began by saying that on \n \n to deliver \n and she was \n\n \n) located at\n was driving her black \n\n to go over the details of what happened today.",
  "V-\n\n said her son \n\n  (Aka: \n\n \n\n \n\n \n\n \n\n said at some point, \n\n tried to go around a black Infiniti vehicle, so he honked at the vehicle \n said as they drove past the black Infiniti, the vehicle sideswiped \nand the vehicle honked back.",
  "her vehicle and collided into her right rear bumper area.",
  "said her son, began to pull over to the \nside of the road on the southbound Prairie Lanes, when the other black Infiniti drove next to him on the \n \ndriver’s side and she saw a female black passenger yell out, “You stupid Bitch” seconds after \nsaid she heard a loud gunshot.",
  "described the female passenger as a female black, thin build, \nwith dark complexion and wearing an orange colored scarf on her head.",
  "I asked her if she can identify \nthe female if she saw her again and she said no, because he never saw her face clearly.",
  "I asked her if \nshe ever saw the suspect driver and she said no.",
  "said after the gunshot, the black Infiniti drove away and her son followed the vehicle and called \n handed her his cell \n911 to report the shooting and try to get the license plate of the vehicle.",
  "phone and told her to inform the 911 operator of their location.",
  "said her son attempted to catch \nup to the suspect vehicle, but they were unable to.",
  "When they reached the area of La Brea Avenue \nand Florence Avenue,\n said they flagged down a CHP Patrol Officer and told him what happened.",
  "They continued driving southbound La Brea Avenue and when they arrived to La Brea Avenue and \n said she saw several Inglewood Police cars in the area and she saw the \nHyde Park Boulevard, \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 4 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \n  said  she  saw  the  Officers  removing  the  female \nsame  black  Infiniti  had  crashed  into  a  tree.",
  "passenger from  the  Infiniti.",
  "said  she  identified  and told  the  Officers  that the female  was  the \nsame female that yelled out, “You stupid Bitch”, but she did not see the driver flee.",
  "Detective J. Aranda \nadmonished \n and showed her a photographic lineup of the female subjects, but she was not able \nto identify anyone.",
  "At  approximately  1656  hours, I  conducted  the  follow-up  interview  of  victim \n  in  the \npresence of D.A.",
  "Delport and D.A. Investigator Yatman.",
  "The interview was audio and video recorded.",
  "Interview was audio and video recorded \nSummarized Statement from Victim \n  said  on \nI  asked  Victim \ntoday’s date (1/30/21) he was with his mom in her vehicle (\n was \ndriving and his mother was seated in the back seat, because they were bringing cargo from downtown \nL.A. to his mom’s restaurant, \n \nAs he was driving southbound on Prairie Avenue and stopped at the red signal at Kelso and Prairie \nAvenue, he saw there was a black Infiniti Q50 vehicle driving very slow (approx.",
  "10 miles per hour) in \n said he tried to go around the vehicle, so he honked his horn and the black \nfront of him.",
  "Infiniti honked back. said as he past him on the left side, the vehicle sideswiped him on the \nright rear bumper.",
  "said he started to pull over to the right to exchange information, but the \nvehicle pulled up next to him on the driver’s side (approx.",
  "10 feet away) and he saw a female front \npassenger yell out her window, “You stupid bitch!” and then he saw a handgun come up from within \nthe vehicle and saw the handgun fired one round in his direction.",
  "to  go  over  the  details  of  what  happened  and  he  did. ). .",
  "called 911 and gave the phone to his mother \n\n said he remembered seeing the gun smoke from firing and he even smelled the smoke as \n said it was so close that he could taste the gun smoke.",
  "The \nit traveled into his vehicle.",
  "black Infiniti then drove away at a high rate of speed, \n said he had been shot in the past so \nhe did not want the suspect to get away.",
  "He began to follow the vehicle so he can get a license plate \nnumber.",
  "and told her to talk to the \n said he was not struck by the bullet, but the bullet \noperator and tell them what happened.",
  "hit his mother’s vehicle on the front driver’s door.",
  "said he continued to follow the suspect \n said at some point he flagged down \nvehicle but he could not catch up to get a license plate.",
  "a CHP Patrol Officer and told him what happened and they continued driving in the area of where they \nlast saw the suspect vehicle which was southbound La Brea Avenue at Florence Avenue.",
  "I asked \n if he saw who was driving the black Infiniti and he said it was a male Black, 22-27 \nyears, with thick dreaded hair, medium to dark complexion and medium build 185-200Lbs.",
  "and he had \nan  unknown  type  of  tattoo  on  his  right  arm.",
  "then  described  the  female  passenger  as  a \nfemale Black, skinny, 18-25 years old, medium to dark complexion and wearing a bonnet or scarf on \nher head.",
  "if he saw who shot at him and he said it was the male driver, because he saw his \nI asked \n  said  he  could  not  describe  the \nright  arm  with  the  handgun  and  fired  one  round  at  him.",
  "handgun, but he believed it was a semi-auto handgun, but was not sure.",
  "He also said he believed it \nwas black handgun.",
  "said when he was shot at, the suspect was approximately 3 to 4 feet \naway from him.",
  "said he had never seen the suspects before and said he can identify them \nif seen again.",
  "I then asked \n\n what he saw when they arrived to Hyde Park Boulevard and La Brea Avenue \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 5 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \n\n \n\n to go over the details of what he saw today.",
  "of  the  photographic  line-up  and  he  said  he \n\n \nand he said he saw the Officers pulling out the female from the black Infiniti, but he did not see the \ncollision and he did not see the male suspect driver.",
  "said he identified the female suspect \n a Google \nto the Officers as the same female who yell at him after the collision.",
  "I showed \nSatellite  map  of  the  area  at  Prairie  Avenue/Manchester  Boulevard/Arbor  Vitae  Street  and  La  Brea \n then indicated with a pen the path he and the suspect drove during the incident.",
  "I \nAvenue. if he was able to see the license plate of the black Infiniti when he was chasing him, \nasked \nbut he could not make out any numbers or letters.",
  "Detective  J.  Aranda  then  admonished \nunderstood.",
  "Detective  J.  Aranda  showed \n  the  constructed  photographic  line-ups  and  after  carefully \nlooking at the photos he positively identified the suspect Kameron Reed in photo #2 as the suspect \nwho shot at him.",
  "He also partially identified the female suspect Krystal Snoddy in photo #4 or photo #1 \nas the female suspect passenger who yell, “You stupid bitch”.",
  "said it was between number \n4 and number 1.  \n \n  in  the \nAt  approximately  1740  hours,  I  conducted  the  follow-up  interview  of  witness \npresence of D.A.",
  "Delport and D.A. Investigator Yatman.",
  "The interview was audio and video recorded.",
  "Summarized Statement from Witness \nI asked W-\nof Hyde Park Boulevard and Lamos street with his co-workers for \nwas inside a smaller pickup truck called a “Scout truck”  I showed \nmentioned and had him point out where he was at when the incident occurred.",
  "was inside his truck he heard a loud sound of a crash, but he did not see the crash or the vehicle.",
  "said he looked through his right rear view mirror and saw a male subject running \nSeconds later, \n then said that while the subject was running \nin his direction (westbound) on the north sidewalk.",
  "illustrated  with  his  hands,  reaching  for  his \nhe  tried  to  grab  something  from  his  jacket  and \n also said he saw the subject begin to turn his body around, while holding his \nmidsection area.",
  "midsection area, then he heard the gunshots.",
  "I asked \n if he could describe the subject and he \nsaid he did not see his face, but remembered he was wearing red shirt and black pants or vice versa.",
  "The subject also had medium length braided hair and was approx. 5’9” to 6’ tall.",
  "I asked him if he saw \nanything  in  the  subject’s  hands  and  he  said  no,  but  he  believed  he  was  trying  to  retrieve  or  hold \n was asked if he knew which hand was the subject had in \nsomething in his front pocket jacket.",
  "his jacket pocket but he said he could not tell.",
  "said he heard someone yell, “Get down, get down, get down” then he heard three \nAt this time, \n belived that at this time, the subject running was struck by gunshots, because he \ngunshots.",
  "saw him get hit by the gunfire.",
  "said the subject continued to run northbound Lamos street from \nwestbound Hyde Park Boulevard and then he saw the subject’s right hand in a throwing motion over \n said he believed the subject threw an unknown object over a tall sheet metal wall \nhis head.",
  "located on the west side of the property at 711 N La Brea Avenue Quality Equipment Rentals.",
  "I asked \nhim if he heard the object land and he said no because he heard a lot of Police sirens.",
  "said \nafter the subject threw the unknown object over the wall, he continued to run through the business at \n711 N La Brea Avenue and out of sight.",
  "Interview was audio and video recorded \n said he was working in the area \n said he \n  \n a google map of the area he \n said when he \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 6 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n could not positively identify anyone.",
  "of the photographic line-up and he said he understood.",
  "the constructed photographic line-ups and after carefully looking \n\n \nDetective J. Aranda then admonished \nDetective J. Aranda showed \nat the photos \n \nAt approximately 1800 hours, Officer Rogers was escorted to the Inglewood Police Forensics Lab to \nhave  his  duty  weapon  examined  and  recovered  for  processing  by  Forensics  Investigators  R.  Paul \n#3104.",
  "Officer Rogers was accompanied by his Attorney Bijan Darvish.",
  "Also present in the lab was \nInternal Affairs Sgt.",
  "F. Smith #695 and Sgt. F. Ruiz #901, Sgt.",
  "V. Serrano #885, and IPD Homicide \nDetective J. Aranda #691.",
  "During the examination of the duty weapons for Officer Rogers we discovered the following.",
  "Officer \nRogers’ duty weapon was a Glock 17 9MM, serial #BEZV018 equipped with an X300 Stream light.",
  "The \nhandgun was loaded with (1) live round in the chamber and magazine had (17) live rounds.",
  "Magazine \n#2  had  a  total of  (11) live  rounds.",
  "The  third  magazine  had  a  total  of  (17)  live  rounds.",
  "His  back-up \nhandgun was a Smith & Wesson .38 caliber revolver, serial #DKD3885 loaded with (5) live rounds.",
  "For \nfurther details, see photographs taken by Forensics Investigator R. Paul.",
  "Officer  Rogers  Attorney,  Bijan  Darvish  advised  us  that  Officer  Rogers  would  not  be  providing  a \nvoluntary statement regarding the events of the Officer Involved Shooting.",
  "Suspect Kameron Reed Invoked: \nAt approximately 1830 hours, Detective A. Cornejo and I went to our jail to obtain a statement from S-\nKameron Reed.",
  "I introduced myself to Reed as the handling Detective and told him that I needed to \ntalk to him about the case, but he immediately invoked and said he wanted his attorney to be present \nbefore giving a statement.",
  "Suspect Krystal Snoddy invoked: \nAt  approximately  1845  hours,  S-Kristal  Snoddy  was  brought  to  the  interview  room  and  I  introduced \nmyself as the handling Detective.",
  "I also introduced D.A. Delport and Investigator Yatman.",
  "I advised \nSnoddy of her Miranda rights per our Department Miranda form and she said she understood.",
  "Snoddy \nresponded by saying that she wanted to have her Attorney present before giving a statement.",
  "Snoddy \nsaid she wants to answer questions, but only if her attorney was there. The interview was concluded.",
  "At approximately 1923 hours, I conducted the follow-up interview of witness IPD Officer N. Mann #1026 \nin the presence of his Attorney Darvish, D.A.",
  "Delport and D.A. Investigator Yatman.",
  "The interview was \naudio and video recorded.",
  "Summarized  Statement  from  Witness  IPD  Officer  N.  Mann:    Interview  was  audio  and  video \nrecorded \nI confirmed with Officer N. Mann #1026 that he was not being ordered to give a statement and that he \nwas giving this statement on his own free will.",
  "I went over Officer Mann’s work schedule and he was \nworking patrol as a single man unit and call sign 4L11B.",
  "While working, Officer Mann said he heard a \nradio  call  come  out  of  unknown  trouble.",
  "The  reporting  party  indicated  that  they  were  following  the \nsuspect vehicle after the suspect had shot at them.",
  "The updated information was that they were now \nin the area of La Brea Avenue and Queen Street.",
  "Officer Mann said he put himself assisting in the \nradio call and began to drive in that direction.",
  "INGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 7 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \nOfficer Mann said when he reached the area of La Brea Avenue and Florence Avenue, he saw the \nsuspect vehicle and described it as a black Infiniti sedan.",
  "Officer Mann said he continued to follow \nOfficer  Rogers  patrol  vehicle  which  was  traveling  northbound  La  Brea  Avenue  towards  Hyde  Park \nBoulevard.",
  "Once Officer Mann arrived to the intersection of La Brea Avenue and Hyde Park, he saw \nthat the black Infiniti had already collided into a tree at the northwest corner of Hyde Park Boulevard \nand La Brea Avenue.",
  "Officer Mann  then illustrated with a pen the location of the suspect’s vehicle, \nOfficer Roger’s vehicle and his patrol vehicle on a Google Maps of the area.",
  "I asked Officer Mann what \nhe sees as he pulls up and he said he heard approximately 1 to 5 gunshots and saw smoke in the air \naround the area where Officer Rogers was standing.",
  "I asked if he saw the suspect at that time and he \nsaid no.",
  "Officer Mann said he exited his vehicle and ran towards Officer Roger’s location, next to his vehicle, he \nsaw  a  male  subject  running  northbound on Lamos  street from  Hyde  Park Boulevard.",
  "Officer Mann \ndescribed the suspect as a male Black wearing red clothing, but he never saw his face.",
  "Officer Mann \nsaid he saw that the suspect had braided hair, thin to medium build, tall.",
  "Officer Mann said he never \nsaw any weapons on him or in his hands.",
  "I asked if Officer Rogers said anything to him and he said \nno.",
  "Officer Mann said they both entered their patrol vehicles and drove to northbound to Lamos street.",
  "Officer  Mann  said  he  was  told  by  employees  of  the  rental  equipment  place  that  the  suspect  ran \nnorthbound through the business and out of sight.",
  "A containment was established by assisting units and Officer Mann said he was later told by IPD Officer \nDelgado that witnesses saw the suspect possibly tossed an unknown object over the west wall of the \nEquipment Rental business.",
  "While checking the area, Officer Mann said he located a semi auto green \nwith black slide handgun laying on the ground just east of the aforementioned wall.",
  "The weapon was \nsecured and later photographed and recovered by IPD Forensics personnel.",
  "I asked Officer Mann if \nhe recalled seeing a female occupant inside the suspect’s vehicle and he said yes, but he did not recall \nwhere she was seated in the car.",
  "The interview was concluded. At approximately 2030 hours, I responded to the crime scene and met with Patrol Sgt.",
  "P. Manning and \nIPD Forensics R. Paul who briefed me on the crime scene and evidence.",
  "I saw the area was secured \noff by IPD Patrol Units and yellow crime scene tape.",
  "A crime scene log and checklist was monitored \nand  completed  by  Officer  L.  Guananja  #1068.",
  "Inglewood  Police  Department  Forensics  personnel \n(Forensic  Investigators  R.  Paul  #3104,  C.  Hewson  #3111)  processed  the  crime  scene  by  taking \nphotographs, measurements and collecting evidence.",
  "For further details, see forensics report under \nsame GO number.",
  "I canvassed the crime scene and observed the following; on the northwest corner of Hyde Park Avenue \nand La Brea Avenue there was a black Infiniti 4 door sedan Model Q60 bearing temporary license plate \n crashed into a tree located on the north sidewalk of Hyde Park Boulevard just west \nnumber \nof La Brea Avenue.",
  "The vehicle had significant damage to the front end and both front doors were \nopened.",
  "Approximately 20 feet east of the black Infiniti, there was an Inglewood Police Unit SUV parked along \nthe north sidewalk of Hyde Park Boulevard.",
  "Approximately 15 feet south of the black Infiniti driver’s door was in the middle of Hyde Park Boulevard \nthere was a 9mm cartridge (magazine) containing several 9mm live rounds laying on the street.",
  "I also \nobserved two expended casings laying on the street pavement of Hyde Park Boulevard, approximately \n\n\fINGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 8 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \n15-20 feet southeast of the black Infiniti.",
  "I also observed a black folding blade knife just one foot south \n \nof the driver’s door area.",
  "Approximately 20-30 feet west of the black Infiniti there was a large \n Trash Dump truck in the middle of the street facing westbound on Hyde Park Boulevard just \n “Scout pickup truck” facing \n\neast of Lamos street.",
  "On Lamos street, there was a small\nsouth along the east sidewalk.",
  "I also observed a blood trail that started on the north sidewalk of Hyde Park Boulevard, approximately \n15 feet  east from Lamos  street.",
  "The blood  trail  continued  to northbound Lamos  street and  into  the \nQuality Equipment Rental business at 711 N. La Brea Avenue.",
  "I observed an Inglewood Police Patrol \nunit  #991  (Black  and  White  Ford  Crown  Victoria  License  Plate  #1386583  parked  on  Lamos  street, \nfacing north at the entrance to the west driveway of the Quality Equipment Rental Business.",
  "Once inside the business, I observed the aforementioned firearm (green polymer with black slide semi-\nauto handgun and one live 9mm round) described by Officer Mann laying on the ground just east of the \nwest wall off of Lamos street, within the yard of Quality Equipment Rental.",
  "Inside the yard of Quality \nEquipment rentals was an Inglewood Police Patrol Unit #1447 (Black and White Ford Explorer License \nPlate #1533007) facing east, just west of the east Lamos Street entrance.",
  "The blood trail continued to north through the business and over a north gate of the property and onto \n737 N. La Brea Avenue, which is an abandoned Used Car Dealership.",
  "The blood trail continued north \nthrough Lamos Street towards the end of the street located to the rear of 800 N. Eucalyptus Avenue \napartment  complex.",
  "The  blood  trail  then  continued  to  the  rear  of  818-824  N.  Eucalyptus  Avenue \napartment complexes, then to the rear of 128 W. Plymouth Street.",
  "While walking through the area, the resident of 128 W. Plymouth Street came out of his residence and \nspoke  with  Detective  A.  Cornejo.",
  "The  resident  said  he  witnessed  a  subject  running  through  his \nbackyard so he notified Police Officers that were holding the containment.",
  "For further details of his \nstatement, see Detective A. Cornejo’s supplemental report.",
  "The blood trail then continued east through \nthe  rear  parking  lot  of  817  N.  La  Brea  Avenue  (LA  City  Cars  Auto  Dealership)  and  ended  on  the \ndriveway of 114 W. Plymouth Street residence, where the suspect was found hiding underneath the \nresident’s parked vehicle.",
  "The  Traffic  collision  report  and  CHP-180  was  completed  by  Officer  Guananja  under  the  same  GO \n#2120-6027.",
  "Suspect Reed’s vehicle was towed, impounded and held for evidence at Bryant’s Towing.",
  "A forensics request form was submitted for suspect’s vehicle by Officer Guananja.",
  "IPD Officer Blaylock \n#1012 and Officer J. Pena #1065 responded to the area of Manchester Boulevard and Prairie Avenue \nto  assist  in  locating  evidence of  the original crime,  245  (a) P.C.",
  "/ Assault  with  deadly  weapon.",
  "For \nfurther see Officer Pena's supplemental report under the same GO #.",
  "Assisting Inglewood Police Detectives H. Morgan #1004 and J. Crossen #977 also responded to the \narea  of  Prairie  Boulevard  and  Kelso  Avenue  to  check  for  video  surveillance  footage.",
  "They  also \nresponded to the location the incident concluded (the intersection of La Brea Avenue and Hyde Park \nBoulevard) to check for video surveillance footage.",
  "For further details of the retrieval of video footage, \nsee supplemental report completed by Detective H. Morgan.",
  "IPD Officer L. Guananja #1068 conducted \ndoor  knocks  of  the  surrounding  businesses  and  residences  for  any  potential  witnesses  and  or \nsurveillance video.",
  "For further, see supplemental report completed by Officer Guananja.",
  "INGLEWOOD POLICE DEPARTMENT \nINVESTIGATOR FOLLOW UP REPORT                                                                                                                Page 9 \n\nINVESTIGAT NG OFFICER \n\nDATE \n\nCHARGES \n\nL. RODRIGUEZ #839 \n\nJanuary 30, 2021 \n\n245(A) 2 P.C.",
  "/ OIS \n\nDR NUMBER \n2021-6027 \n\n \nOn 2/1/21, I learned the female arrestee Krystal Snoddy (booking #6115792) had posted bond for the \ncharge of 245(a) 2 P.C.",
  "/ assault with deadly weapon and was released per Bond #555247661-0 in the \namount of 50,000 and given a return court date of 8/4/21.",
  "On 2/1/21, IPD Detective J. Aranda and IPD Forensics Supervisor R. Paul went to Bryant’s Towing to \nprocess the recovered / stored Inglewood Police Unit #1447 (Driven by IPD Officer J. Rogers #1046).",
  "During the processing Forensics Supervisor R. Paul located 2 expended casings laying on top of the \nleft  and  right  windshield  wipers  and  the  other  2  casings  were  laying  on  top  of  the  windshield  wiper \nguard.",
  "The casings were photographed and recovered by Forensics Supervisor R. Paul, for further \nsee Forensics report completed by R. Paul.",
  "On 2/1/21, IPD Detectives H. Morgan #1004 and H. Quintana #951 responded to  115 W. Hyde Park \nBoulevard (H-Hy Tech Spinning Inc.) and retrieved video footage which depicted the traffic collision of \nS-Reed’s vehicle into the tree at La Brea Avenue and Hyde Park Boulevard.",
  "The video also captured \nS-Reed running away from the site of the collision and holding a handgun in his right hand.",
  "The video \nalso captured him tossing the firearm with his right hand over the west wall of 711 N. La Brea Avenue \n(Quality Equipment Rental).",
  "For further details, see supplemental report completed by Detective H. \nQuintana.",
  "Action taken:     \nBased  on  the  following  facts  of  this  case;  the  victim’s  statements  and  positive  identification  of  the \nsuspects  during  the  field  show  ups  and  photographic  lineups;  the  statements  obtained  from  civilian \nwitnesses and IPD witness Officer Mann; the evidence recovered from the crime scene (firearm, loaded \nmagazine and live round); the blood trail left by the suspect, which lead to the location where he was \nultimately found and taken into custody; video footage obtained from 115 W. Hyde Park Boulevard, \nwhich captured the suspect running away with a firearm in his right hand after colliding into tree and \ntossing it over a wall, and later recovered from the same area; I am submitting this case to the District \nAttorney’s Office for review and filing consideration."
]