[
  "Agency: Sonoma Police Department\n\nCase #: SO220000538.013\n\nSupplement Report\n\nCONTROLLED DOCUMENT - DO NOT DUPLICATE\n\nNarrative\n\nSUPPLEMENT \nWritten by: Berg, Nicholas 1102224\nDate/Time: 10/30/2022 06:16:00\n\nSupplemental Report\n\nSPD Case#: 22-0000538\n\nSgt.",
  "N. Berg\n\n*********************************************************************************************************\n**********************************************************************\n\nOn 10/15/22 I was working uniformed patrol out of the SCSO main office.",
  "I heard this call for service over the radio and began \nresponding out to the area once I heard deputies were trying to apprehend a subject who had brandished a firearm at a person.",
  "I \nwas aware it was believed the suspect was Nathan Smart, which I recalled from an earlier call for service in the Sonoma Valley \narea.",
  "As I was responding to the area, I heard a deputy indicate they had just been in an officer involved shooting.",
  "When I arrived on \nscene, the suspect (later identified as Nathan Smart) was being transported by medics for gunshot wounds.",
  "I assisted with scene management and coordinated resources as necessary.",
  "While on scene, I learned there were multiple \nwitnesses to this incident to include a nearby vehicle that contained several witnesses.",
  "They had been parked near the officer \ninvolved shooting scene and I was told they witnessed aspects of the incident.",
  "I was informed deputies contacted the occupants \nof the vehicle and obtained identifying information.",
  "The witnesses in the vehicle were cooperative, but after awhile asked if they \ncould leave as they had been there for awhile.",
  "I took several photographs of the vehicle in relation to the shooting scene.",
  "I later \nuploaded these to evidence.com.",
  "I confirmed with Lt Piccinini that the witnesses in the vehicle were clear to leave, and Santa Rosa Police investigators would follow \nup with them at a later time.",
  "End of supplement. Printed: 10/31/2022 3:13:03 PM by Inform RMS System Account\n\nCONTROLLED DOCUMENT - DO NOT DUPLICATE\n\nPage 1 of 1"
]