[
  "Menlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nOFFICER INVOLVED SHOOTING \nINVESTIGATION \n\nINVOLVED OFFICERS \n\nSergeant Jaime Romero \nOfficer Scott Mackdanz \nOfficer Nicholas Douglas \n\nINVESTIGATING OFFICER \n\nSergeant William A. Dixon \n\nDECEASED SUBJECT \n\nJerry Lee Matheny \n\nSYNOPSIS \n\nMenlo Park Police Sergeant Romero, Officer Scott Mackdanz, and Officer Nicholas Douglas \nwere dispatched or responded to a reported suspicious person in the area of 64 Willow Road in \nthe City of Menlo Park.",
  "The self-identified reporting party (RP) stated that she just observed a \nsubject who matched the description of a person known within her office as potentially coming \ninto area businesses and stealing purses.",
  "The RP provided a specific description of the \nsuspicious person she had just observed.",
  "The RP stated the subject had \"peeked\" into her office, \nwaved, and then exited.",
  "Before disconnecting the RP provided a license plate number of a white \nFord Taurus associated with the subject and told the dispatcher that the subject had driven away.",
  "Officer Douglas locates the described Ford Taurus unoccupied in the driveway of a nearby \nbusiness.",
  "Officer Mackdanz arrives at the same time as both he and Officer Douglas observe a \nsubject matching the specific description provided by the reporting party.",
  "Officer Douglas \nattempts to contact the subject and he flees on foot northbound through the parking lot.",
  "Sergeant \nRomero arrives and stops his vehicle directly in the path of the fleeing subject.",
  "The subject continues to flee and while doing so produces a semi-automatic firearm which he \nhad concealed on his person.",
  "Officer Douglas who was closest to the fleeing subject discharged \nhis Taser with no effect.",
  "All three officers recall a round being discharged and fired their duty \nweapons at the armed subject.",
  "1 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nOfficer Mackdanz had tripped along the southern most edge of the roadway and fired at the \nsubject from a prone position.",
  "Upon hearing the firearm discharge, Officer Douglas dove to the \nroadway pavement for safety and also fired on the armed suspect from a prone positon.",
  "Sergeant \nRomero fired his department issued semi-automatic from a standing position adjacent to his car \nwith no additional cover.",
  "The subject was pronounced deceased by attending medical personnel shortly after the active \nincident concluded.",
  "All three officers observed that the fleeing subject had armed himself and felt their lives and the \nlives of their fellow officers were in jeopardy.",
  "2 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nINVESTIGATION \n\nOn November 11, 2014 at approximately 1240 hours, I heard Sergeant Jaime Romero broadcast \nover the Menlo Park Police Department main radio channel that there had just been an officer \ninvolved shooting with one subject down.",
  "At the time I heard the radio traffic, I was off duty and was traveling eastbound on Santa Cruz \nA venue in my department vehicle.",
  "Immediately following the initial broadcast of the officer \ninvolved shooting, Sergeant Romero requested medics and stated that the involved officers were \n\"Code Four.\"",
  "Moments later, I also heard Sergeant Romero make a radio request that dispatch advise me what \nhad occurred.",
  "I acknowledged Sergeant Romero's request over the radio and indicated that I was \nenroute.",
  "Sergeant Romero broadcasted, \"We've got a loaded firearm.",
  "He fired at us. We've got \nhim down.\"",
  "While traveling to location of the incident, I contacted Chief Jonsen and advised \nhim of the preliminary information I had heard.",
  "On my arrival at the scene, I observed Sergeant Romero standing near his patrol SUV which was \nparked in the single westbound lane of Willow Road.",
  "Officer Nicholas Douglas was seated on \nthe left side of the concrete portion of the driveway of 68 Willow Road.",
  "There were several \nmembers of the Menlo Park Fire Protection District standing near Officer Douglas.",
  "Officer Scott \nMackdanz was walking in the roadway towards Sergeant Romero's vehicle with a roll of crime \nscene tape in his hand.",
  "A male subject was laying on the ground in the single eastbound lane of Willow Road.",
  "I approached Sergeant Romero and learned that the subject lying in the roadway was believed to \nbe the sole involved subject.",
  "Sergeant Romero briefly explained to me that the subject had fled \non foot from Officers Mackdanz and Douglas directly towards him.",
  "Sergeant Romero believed \nthat Officer Mackdanz, Officer Douglas, and he had all fired their department issued firearms at \nthe subject.",
  "I asked Sergeant Romero where the subject's handgun was and he pointed to a \nnearby sign pole.",
  "Sergeant Romero also told me that he had moved the subject from his original \nposition of rest in an attempt to locate the handgun.",
  "I asked Sergeant Romero if the event had been captured on his department issued Vievu body \ncamera.",
  "Sergeant Romero told me that he had not activated the camera until immediately after \nthe threat presented by the suspect had been eliminated.",
  "Sergeant Romero further explained that \nhe believed that Officer Douglas had also not activated his camera and that Officer Mackdanz's \ncamera had been previously turned in for repair and he had not been issued a replacement.",
  "Sergeant Romero also told me that his \nvehicle doing a ride along at the time of the incident.",
  "In Sergeant Romero's presence, I briefly \nexplained to \nexplained to \nuntil he had provided a statement to investigators.",
  "what I had explained to him. what would be occurring based upon the severity of the incident.",
  "I also \n that he would not be allowed to discuss the incident with Sergeant Romero \n\n indicated that he had understood \n\n, was in his patrol \n\n3 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nOfficer Douglas was transported to Stanford Hospital for an injury that he had sustained during \nthe incident.",
  "I directed Officer Mackdanz to Sergeant Romero's vehicle.",
  "I verbally explained to \nOfficer Mackdanz and Sergeant Romero that they were not to discuss the incident amongst each \nother.",
  "Both indicated that they had understood my instructions.",
  "While Officer Sample and Officer Solis were on scene attempting to obtain witness information, \nI removed numbered evidence identification cards from within Sergeant Romero's vehicle.",
  "I \nwalked through the scene and placed markers near all items that appeared to be of evidentiary \nvalue.",
  "I also took several preliminary photos of the scene in an effort to depict the placement of \nthe suspect's vehicle in relation to the events that followed.",
  "While walking through the area, I observed an extended RCB lying in the roadway to the right of \nthe driveway of 68 Willow Road.",
  "I also observed the white metal wires associated with a \ndeployed Taser cartridge near the same driveway.",
  "Additionally, I observed a small silver \nhandgun was sitting at the base of a sign pole where Sergeant Romero had earlier indicated it \nwas.",
  "There were several expended shell casings throughout the area in addition to one small live  . round.",
  "The live round's size was not consistent with the duty rounds that are issued to our \nofficers or the other expended shell casings I had observed.",
  "I purposely limited my initial involvement and conversations at the scene knowing that I would \nsubsequently be responsible for the department's administrative investigation of the incident.",
  "Shortly thereafter, other Menlo Park Police Department personnel arrived on scene and began to \ntake over the duties of the initial investigation.",
  "At approximately 1338 hours, Chief Jonsen and \nSergeant Kaufman arrived and took over command of the scene.",
  "I transported Officer \nMackdanz, \n, and Sergeant Romero to the Menlo Park Police Department in my \ndepartment vehicle.",
  "Upon our arrival at the station, I arranged for full body photographs of the \nofficers to be taken to depict what they were wearing at the time of the event.",
  "I also took control \nof their department issued safety equipment, duty belt, and firearms.",
  "This equipment was placed \ninto specifically labeled boxes and stored in my locked office for subsequent examination by San \nMateo County District Attorney Investigators and Crime Laboratory personnel.",
  "Officer Mackdanz was sequestered in the report writing room.",
  "Sergeant Romero and \n\n \n were sequestered in the watch commander's office.",
  "All three were again admonished \n\nnot to discuss the incident amongst themselves or with any other Menlo Park Police Department \npersonnel.",
  "I prepared a timeline of the entire incident using time stamped radio traffic (ATTACHMENT \nM), phone recordings (ATTACHMENTS L), time stamped information entered by \nCommunications personnel, and Menlo Park Fire Protection District / San Mateo County \nComputer Aided Dispatch information.",
  "Refer to ATTACHMENT K for the complete timeline.",
  "The interviews of all three involved officers and the civilian ride along were conducted by \ninspectors with the San Mateo County District Attorney's Office for the ensuing criminal \n\n4 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\ninvestigation.",
  "I monitored all the interviews for information regarding the administrative \ninvestigation on behalf of the Menlo Park Police Department.",
  "Based upon the policy of the attorneys for the Menlo Park Police Officers Association, Officers \nMackdanz and Douglas declined to voluntarily provide a blood sample for subsequent further \nexamination.",
  "I completed and served notices to both Officer Douglas and Officer Mackdanz that \nthe department would order them to provide a blood sample pursuant to Menlo Park Police \nDepartment policy 310.7(a).",
  "The department was subsequently unable to find a suitable blood \ntechnician or medical facility that was willing to cooperate or take an involuntary blood draw.",
  "I downloaded the Vievu body cameras for Sergeant Romero and Officer Douglas.",
  "Upon \nreviewing the data contained on each individual camera, I was able to confirm that their cameras \nhad not been activated during the event.",
  "I also confirmed with Officer Mackdanz that he did not \nhave a Vievu camera because the one assigned to him had been sent in for repair.",
  "Officer Douglas had been previously trained with and issued a department owned Taser X26P.",
  "On November 11, he was carrying the department issued Taser X26P (Ser#X120005KH).",
  "Neither Sergeant Romero or Officer Mackdanz had been issued or were carrying a Taser during \nthe incident.",
  "I subsequently requested and received a copy of the device history for Officer \nDouglas' issued Taser.",
  "I noted the report indicated a 2-second-long \"trigger\" event on \nNovember 11, 2014 at approximately 12: 11 :32.",
  "For an unknown reason, the device time stamp \nappears to be off by approximately 29 minutes.",
  "Refer to ATTACHMENTN for further.",
  "5 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation #1426 \n\nSTATEMENTS \n\nThe written statements below were documented chronologically and are not verbatim.",
  "They are \nsummaries of the detailed statements provided to the respective San Mateo County District \nAttorney Office Investigators during their interviews in the Menlo Park Police Department \nInterview Room.",
  "The interview took place on November 11, 2014 at approximately 1535 hours.",
  "Present during \nthe interview was San Mateo County District Attorney Inspector Steve Robinson, Menlo Park \nPolice Detective Ron Venzon, and Menlo Park Police Detective David Apple.",
  "is fifteen years old and is the 1 oth grade of high school.",
  "He is the son of \n\nSergeant Jaime Romero. with Sergeant Romero.",
  "He is familiar with the some of the police jargon used over the radio and \nhistorically when he has not understood what was said, he has asked his father for clarification.",
  "During the course of this ride along, \n\nhas participated in approximately five previous ride alongs \n\n was seated in the front passenger seat.",
  "On November 11, 2014, he and his father arrived at the police department at approximately 0530 \nhours.",
  "They were in briefing until approximately 0700 hours.",
  "Earlier in the shift they responded \nto a female that was under the influence of methamphetamines and then subsequently \nparticipated in the search of the woman's hotel room.",
  "They also had breakfast together.",
  "At the \ntime of the initial broadcast call on Willow Road, he did not know where in Menlo Park they \nwere responding from.",
  "asked his father to clarify what they were \nWhile enroute to the call at 68  Willow Road, \ngoing to.",
  "Sergeant Romero explained they were responding to a call of a man who was peeking \ninto windows because he had stolen purses before.",
  "Based upon \nprevious experience \nduring ride alongs he did not perceive what he had heard or what they were responding to as a \nserious event.",
  "While responding he heard Officer Douglas broadcast over the police radio that he had found the \nsuspect's vehicle.",
  "They were going to \"loop around\" to look at the vehicle when Officer Douglas \ncalled out over the radio that he was in foot pursuit.",
  "observed Matheny running with the two officers running after him.",
  "As they arrived, \n \"Stay here.\"",
  "Sergeant Romero exited \nSergeant Romero put the vehicle in park and told \nthe vehicle and forcefully told the Matheny to get down on the ground twice.",
  "At the same time, \n observed Officers Douglas running with a Taser and Officer Mackdanz running with a \n\nbaton.",
  "Officer Douglas and Mackdanz fell to the ground after running into each other.",
  "subsequently saw the Taser and a baton on the ground.",
  "described the Matheny as being·in between the two pursuing officers and his father, \n\nSergeant Romero.",
  "Matheny looked around as if he did not know what to do and reached around \nto his side and pulled out a gun.",
  "During the interview, \n\n used his right hand to describe \n\n6 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nthe movement he saw however he did not know if Matheny used his right or left hand.",
  "stated that upon exiting the vehicle Sergeant Romero did not have his handgun drawn.",
  "stated he saw Matheny produce a handgun but he could not describe it.",
  "heard \nMatheny \"fire off a couple of shots\" that were followed by gunfire from Sergeant Romero and \nthe two other officers.",
  "fired by Matheny were directed. being fired.",
  "Additionally, \n\n did not see how Matheny's hands were positioned or where shots \n only heard Matheny fire his handgun, he did not see it \n\n never heard Matheny say anything during the incident.",
  "stated Sergeant Romero fired at least one round from his handgun at Matheny.",
  "focus was prominently on his father,  Sergeant Romeo, once he heard \n\nDuring the event \nthe initial gun shots.",
  "He knew Officers Douglas and Mackdanz were on the ground after \nwitnessing them fall but did not see them have their guns out or fire their weapons.",
  "saw Officers Mackdanz and Douglas holstering their firearms so he concluded they had their \nfirearms out.",
  "later \n\n described his view from within the interior of the parked vehicle as clear but obstructed \n\nby the \"door divider\" unless he leaned forward in the passenger seat.",
  "After Matheny had been shot, \n said he saw the gun slide away and come to rest in front \nof a driveway.",
  "He observed the officers check on Matheny and then look for the firearm.",
  "The \nlocation where they found the handgun was in front of the driveway.",
  "At the conclusion of the interview, \nsuspect was upon their arrival (X) and where Sergeant Romero's vehicle was parked (rectangle).",
  "used a Google Earth image to indicate where the \n\n7 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\n.~  \n\nSergeant Jaime Romero \nThe interview took place on November 11, 2014 at approximately 2020 hours.",
  "Present during \nthe interview were San Mateo County District Attorney Inspector Kevin Raffaelli, Menlo Park \nPolice Management Association Attorney Alison Berry Wilkinson, and Menlo Park Police \nDetective David Apple.",
  "Sergeant Romero's statement was provided voluntarily and he was not advised of his Miranda \nrights or given a Lybarger Admonishment.",
  "Additionally, Sergeant Romero verbally indicated \nthat he would be voluntarily willing to submit a blood sample.",
  "Sergeant Romero has been a police officer for over twenty years.",
  "During his law enforcement \ncareer he has worked as a sworn police officer for the Broadmoor Police Department (2 years), \nGilroy Police Department (5 years), East Palo Alto Police Department (5 years) and the Menlo \nPark Police Department.",
  "He has been with the Menlo Park Police Department for approximately \n9 years the last seven and a half to eight years as a Sergeant.",
  "His current assignment is working \ndayshift patrol as a supervisor.",
  "Sergeant Romero started his shift at 0600 hours on November 11  after getting approximately 6 Yi \nto 7 hours of sleep the previous evening.",
  "He had not recently taken any prescribed medication or \nillegal narcotics and does not drink alcoholic beverages.",
  "This shift was the fourth of his \nscheduled four shifts this week and he had not worked any overtime during this week.",
  "During \nthe shift today he was wearing a full Menlo Park Police Department uniform and driving a fully \nmarked black and white Menlo Park Police Department vehicle.",
  "Sergeant Romero recounted hearing a suspicious person call dispatched to the officers working \non his shift.",
  "He could not immediately recall the specific address of where the reporting party \nindicated the event occurred however he knew there had been some interaction between the \nreporting party and the suspicious person.",
  "The reporting party stated that had a flyer detailing several thefts from area businesses where the \nsuspect in those thefts appeared to match the description of the person they had interacted with \nmoments before.",
  "The reporting party also provided a description and license plate number of a \nvehicle they believed to have associated with the suspicious person.",
  "The responding units were \nupdated that using the vehicle information provided by the reporting party matched a A WS hit \nconnecting the same vehicle to several recent commercial burglaries on the peninsula.",
  "Sergeant Romero was traveling on Willow Road and began to respond to the suspicious person \ncall from near the Belle Haven area of Menlo Park.",
  "It took approximately 2-3 minutes for him to \narrive in the area of the suspicious person call.",
  "As he traveled through the intersection of Willow \nRoad and Middlefield Road, he heard Officer Douglas broadcast on the radio that he had arrived \non scene and located the associated vehicle unoccupied.",
  "Sergeant Romero recalled Officer Douglas indicate they should be watching for the suspicious \nsubject near a business called \"garage\" or \"the garage.\"",
  "After just passing the area where the call \nhad originated, Sergeant Romero turned his patrol vehicle around and began traveling eastbound \non Willow Road.",
  "Sergeant Romero was stopped facing or driving slowly past the location when \n\n8 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nhe heard \"foot pursuit, foot pursuit\" over the radio.",
  "He didn't feel comfortable with his position \nbecause his son was seated in the passenger seat now directly between him and the location \nwhere the fleeing subject may be coming from.",
  "Sergeant Romero quickly pulled forward and \nmade a u turn so that his patrol vehicle was again traveling westbound in the westbound lane of \nWillow Road.",
  "He continued driving slowly on Willow Road as he observed a subject matching \nthe description of the suspicious person running out from the business with Officer Douglas and \nOfficer Mackdanz chasing him.",
  "Sergeant Romero placed his vehicle in park and exited while \nsimultaneously yelling at the fleeing subject \"Stop ... get down ... get down ... stop!\"",
  "Approximately 15-20 yards away from Sergeant Romero's SUV, yet still running towards \ndirectly at him, Sergeant Romero observed the fleeing subject begin to reach towards his body.",
  "He could not discern if the subject was reaching for his pocket or his waistband, but the subject's \nright hand was going behind him.",
  "The fleeing subject altered his direction and now began \nrunning eastbound in the middle of Willow Road with Sergeant Romero paralleling him.",
  "Sergeant Romero believed he was beginning to catch up to the fleeing subject and began to \nretrieve his baton to assist in taking him into custody.",
  "As they continued to run approximately 7-\n8 feet from one another, Sergeant Romero observed a silver or chrome handgun being held in the \nsubject's right hand.",
  "Sergeant Romero believes he yelled \"Gun ... gun!\"",
  "and observed the other \nofficers fall to the ground.",
  "He heard what sounded like a gunshot and transitioned from \nattempting to retrieve his baton to immediately drawing his firearm.",
  "Sergeant Romero stated that \nupon drawing his firearm the subject still was armed, he had already observed the other officers \nfall to the ground and heard a gunshot so he fired one round.",
  "After firing one round, Sergeant \nRomero's handgun malfunctioned and he believed he fired another round.",
  "The suspect fell to the \nground and Sergeant Romero heard several other gunshots.",
  "Sergeant Romero described that the suspect had fallen in a prone position in the roadway.",
  "Officer Mackdanz and Douglas began to get up and he could tell that Officer Douglas had \nsustained some injury.",
  "Sergeant Romero approached the suspect with his firearm drawn and \nyelled, \"Let me see your hands, let me see your hands!\"",
  "The suspect was not moving very much, \nhowever his hands were underneath his torso.",
  "While still maintaining his drawn weapon on the \nsuspect, Sergeant Romero verbally and physically described using his right hand to grab the \nsuspect's waistband and moving the suspects body position to the point where he could see his \nhand no longer held the firearm.",
  "With active threat no longer present, Sergeant Romero \nholstered his firearm and began to look in the immediate vicinity for the suspect's firearm.",
  "Sergeant Romero assessed the welfare of both Officer Douglas and Mackdanz.",
  "Sergeant Romero \nalso broadcasted over the radio that an officer involved shooting had occurred, the suspect was \ndown, and requested paramedics.",
  "A short time later, Sergeant Romero stated they found the \nsuspect's firearm along a nearby driveway for the business they were in front of.",
  "A short \ndistance away in the middle of the same driveway he observed a handgun magazine which did \nnot appear to be the type carried by police officers.",
  "Sergeant Romero specifically stated that as the event unfolded and he witnessed the suspect \nproduce a handgun he was \"scared for myself, I was scared for my officers, my son ... and the \ncommunity ...",
  "I could not let this guy get away.\"",
  "Sergeant Romero stated he \"absolutely\" \n\n9 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nbelieved that his life, the lives of Officer Mackdanz and Douglas, and the life of his son were in \ndanger once he saw the suspect produce the firearm.",
  "Sergeant Romero stated that he fired his \nhandgun to \"stop the threat and preserve life.\"",
  "Sergeant Romero later further explained that he recalled seeing the muzzle of the suspect' s \nhandgun pointed directly at him which created no doubt in his mind.",
  "Upon firing his first shot, \nthe suspect stopped running but was still standing upright.",
  "Sergeant Romero fired another round \nwhile he continued to run to remove himself out the potential line of fire of the suspect if he \ndecided to fire back at him.",
  "Inspector Rafaelli inquired further about the initial gunshot Sergeant Romero described hearing.",
  "Sergeant Romero indicated the sound was a \"pop or crack.\"",
  "Given that the suspect was fleeing \nfrom them, disobeying their orders to stop, and had pointed the firearm directly in Sergeant \nRomero's direction he believed that the suspect had fired his gun.",
  "Sergeant Romero did not \nrecall ever seeing a muzzle flash or smoke indicating that the suspect had fired his weapon.",
  "Inspector Rafaelli subsequently provided Sergeant Romero with a Google Earth image of the \narea where the incident occurred and asked him to physically label specific locations where the \nevents he described had taken place.",
  "10 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nOfficer Scott Mackdanz \nThe interview took place on November 11, 2014 at approximately 1917 hours.",
  "Present during \nthe interview were San Mateo County District Attorney Inspector Steve Robinson, Menlo Park \nPolice Officers Association Attorney Jeffery Edwards, and Menlo Park Police Detective David \nApple.",
  "Officer Mackdanz' statement was provided voluntarily and he was not advised of his Miranda \nRights or given a Lybarger Admonishment.",
  "Additionally, after speaking with his attorney, \n· Officer Mackdanz indicated that he would not voluntarily submit a blood sample due to their law \nfirm's policy.",
  "Officer Mackdanz has been employed as a Police Officer with the Menlo Park Police \nDepartment for approximately 15 years.",
  "Prior to that he was employed as a Police Officer for \ntwo years with the San Jose Police Department and as a Correctional Deputy Sheriff with the \nChelan County Sheriff's Department in the State of Washington for two years prior to that.",
  "For the past month, Office Mackdanz has been assigned to dayshift patrol working from 0600 to \n1800 hours on a rotating four on / four off schedule.",
  "Prior to starting this morning, he had slept \nsix hours the previous evening.",
  "During his shift he was wearing a full Menlo Park Police \nDepartment uniform and operating an unmarked Menlo Park Police Department Crown Victoria.",
  "Additionally, Officer Mackdanz stated that he had not ingested any illicit narcotics recently and \nhad consumed a couple of alcoholic beverages at approximately 2000 hours the previous \nevening.",
  "Officer Mackdanz did take medication as prescribed by his physician and those \nmedications do impair his memory, ability to recall events, or operate a vehicle \n\nOfficer Mackdanz explained that initially he was not the Menlo Park Police officer assigned to \nthe suspicious person call on Willow Road.",
  "At the time of the initial broadcast, Officer \nMackdanz was at the Menlo Park Police Department main station report writing.",
  "Given the \nlocation of the call was close to where he was he began to respond to assist.",
  "As he drove out of \nthe police.department driveway he heard dispatch inform responding officers that the suspect \nvehicle had an A WS hit indicating that it was associated with a previous burglary.",
  "While \ntraveling to the location, Officer Mackdanz heard Officer Douglas broadcast that he was with the \ndescribed suspect vehicle however it was unoccupied.",
  "On his arrival, Officer Mackdanz was flagged down by a couple of people near the address who \ntold· him the person he was looking for was near the entryway on Willow Place.",
  "Officer \nMackdanz drove his vehicle into the parking lot and parked behind Officer Douglas' patrol \nvehicle.",
  "Officer Douglas was standing outside the described unoccupied associated suspicious \nvehicle with his own patrol vehicle parked directly behind it.",
  "Officer Mackdanz exited his vehicle and began to walk towards where Officer Douglas who was \nstanding adjacent to the driver's door of the associated vehicle.",
  "Officer Mackdanz then observed \na person walking out of a courtyard area of the associated business.",
  "The subject matched the \ndescription provided by dispatch he had earlier being broadcast as the suspicious person.",
  "Officer \nMackdanz stated that he saw it was a white male with a pony tail.",
  "The subject was wearing a \n\n11 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nwhite colored top with pants that appeared to have items in the pockets although Officer \nMackdanz could not recall their color.",
  "There were no items in the subject hands.",
  "From where the subject exited the business and where Officer Mackdanz was standing, Officer \nDouglas was closer to the subject and the subject appeared to be walking towards Officer \nDouglas.",
  "Officer Mackdanz stated he verbally tried to let Officer Douglas know that someone \nwas approaching him.",
  "Officer Douglas began to verbally engage with the subject however \nOfficer Mackdanz could not discern what specifically was being said.",
  "Officer Mackdanz also \nmade attempts to verbally engage with the subject when it appeared that Officer Douglas' \nattempt was not working.",
  "The subject began to flee north through the parking lot just as he got close to Officer Douglas.",
  "The subject's path of flight began on the asphalt driveway and then transitioned to the concrete \npathway in front of the business.",
  "Both Officer Douglas and Officer Mackdanz gave chase with \nOfficer Douglas closer to the fleeing subject.",
  "The subject continued running closer to the \nbuilding and Officer Mackdanz described seeing the subject moving towards his waistband or \npocket with his right hand.",
  "Officer Mackdanz then saw the subject had, armed himself with a \nchrome or silver pistol from his right front pocket.",
  "When asked about his personal thought process upon seeing the subject had armed himself with \na handgun Mackdanz stated, \"Here is a situation where we had him sort of between the two of \nus ... we're directing him to stop for us ... but he took off running so already he is being \nresistive ... but ifhe had a gun in his pocket, the only reason that I could see why he would pull it \nout was that he was going to shoot us.",
  "Otherwise, if he just wanted to get away ... he would have \njust run away.",
  "So, as soon as I saw him produce the gun I figured he wanted to hurt us or kill \nus ... \" \n\nOfficer Mackdanz had drawn his collapsible baton at some point.",
  "He recalled chasing after the \nfleeing subject while attempting to transition from his baton to his firearm after seeing the \nsubject had armed himself.",
  "Near the edge of the vegetation or at the curb of the roadway, Officer \nMackdanz described tripping or losing his balance and falling to the asphalt of Willow Road.",
  "At \nnearly the same time he heard an officer yell, \"gun!\"",
  "While still on the ground, Officer \nMackdanz heard a single gunshot, drew his own weapon, and fired at the armed subject.",
  "Officer \nMackdanz stated he possibly fired four rounds at the armed suspect but he was unsure of the \nspecific number.",
  "While lying on the roadway on the left side of his body approximately six feet \naway, Officer Mackdanz recalled firing twice and remaining focused on the armed subject.",
  "He \npotentially fired two additional times because the subject appeared to be getting up towards \nOfficer Douglas.",
  "Officer Mackdanz only stopped firing when he assessed that the armed subject \nwas no longer a threat.",
  "Officer Mackdanz' attention was focused on the armed subject.",
  "He knew Sergeant Romero was \nahead of him to the left and Officer Douglas was to his right but he did not see any of their \nmovements or whether or not their firearms were drawn.",
  "The armed subject went to the ground \nyet still continued to move as if to try to continue to flee or determine another avenue of escape.",
  "12 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation #1426 \n\nOnce Officer Mackdanz believed it was safe to do so, he approached the armed suspect to detain \nhim and recover the firearm.",
  "Officer Mackdanz was able to determine that the subject no longer \nhad the firearm in close proximity.",
  "Officer Mackdanz heard Sergeant Romero updating dispatch \nwith what had occurred and requesting medics respond.",
  "Officer Mackdanz subsequently saw the firearm near the sidewalk near a strip of grass adjacent \nto Willow Road.",
  "He did not know how it got to that location.",
  "He never touched or moved the \nhandgun nor did he ever see anyone else touch or move it.",
  "Sergeant Mackdanz subsequently saw the wires from Officer Douglas expended Taser cartridge \nhowever he never saw him deploy it.",
  "Additionally, he did not recall the Taser deploy.",
  "He stated \nhe fired his handgun after hearing a single gunshot however he did not know the source of the \ninitial gunshot nor could he discern what caliber weapon it had originated from.",
  "During the interview, Officer Mackdanz utilized a Google Map image of the immediate area to \nindicate where he had been flagged down while responding (x), where the suspect vehicle was \nparked (o), and where he and Officer Douglas had parked their police vehicles (arrows).",
  "13 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nOfficer Nick Douglas \nThe interview took place on November 11, 2014 at approximately 1813 hours.",
  "Present during \nthe interview were San Mateo County District Attorney Inspector Rich Maher, Menlo Park \nPolice Officers Association Attorney Jay Mark, and Menlo Park Police Detective David Apple.",
  "San Mateo County District Attorney Investigator Maher began by confirming that Officer \nDouglas' presence at the interview was voluntary.",
  "Officer Douglas was not advised of his \nMiranda Rights or given a Lybarger Admonishment.",
  "Officer Douglas was asked to voluntarily \nsubmit to a blood draw.",
  "On behalf of Officer Douglas, his attorney stated they would decline \nbecause it was against the policy of his law office.",
  "Officer Douglas has been employed by the Menlo Park Police Department as a Police Officer \nsince March 2006.",
  "He is currently assigned to dayshift patrol and works from 0600 to  1800 on a \nrotating schedule.",
  "On November 11, 2014 he was assigned to the geographical area of the city \nknown as \"Beat Three.\"",
  "On November 11, 2014, he woke up to prepare for work at 0415 hours after receiving \napproximately 7 hours of sleep.",
  "He did not consume any alcoholic beverages or prescription \nmedication within the previous 24 hour period.",
  "He arrived at the Menlo Park Police Department \nat approximately 0545 hours.",
  "Upon starting his shift at 0600 hours, he was in a full Menlo Park Police uniform with a full duty \nbelt operating a fully marked Menlo Park Police Department police vehicle.",
  "He went to briefing, \nanswered a call or two, and worked on some outstanding reports.",
  "When the initial suspicious person call was broadcasted he responded from the police \ndepartment.",
  "He described learning that a white male with a pony tail had been contacted inside a \ncommercial business which an employee deemed as suspicious.",
  "The subject was reported to \nhave been associated with a white Ford Taurus.",
  "The reporting party had relayed they were in \npossession of a flyer that had been disseminated to other employees indicating that a similar \nlooking subject had possibly been responsible for other previous commercial burglaries.",
  "Officer \nDouglas stated that based upon his prior patrol experience he had done some follow up for a \nsimilar commercial burglary that had previously occurred on Sand Hill Road.",
  "The MO appeared \nconsistent with the call he had just been dispatched to on Willow Road.",
  "Officer Douglas arrived at the location on Willow Road by entering off of Willow Place.",
  "He had \na \"hurried and brief conversation\" with a male and female subject nearby who reiterated that \nwhite Ford Taurus and a male were involved and had recently left their parking lot.",
  "Officer \nDouglas made a u-turn in the cul-de-sac and entered the rear driveway of 68  Willow Road.",
  "As \nhe rounded the curve of the parking lot driveway, he saw the described white Ford Taurus parked \nunoccupied adjacent to the west red curb.",
  "He noticed that the windows of the Taurus were rolled \ndown which led him to believe the subject was still in the area.",
  "He broadcasted over the radio \nthat he had located the Ford Taurus and it was unoccupied.",
  "He approached the Taurus and briefly looked within the interior and began scanning the area as \nother Menlo Park Police units arrived in the area.",
  "He heard the engine of Officer Mackdanz' \n\n14 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\npatrol car rev as he entered the parking lot and then saw a male with a pony tail walk out and \nsmile at him.",
  "The subject stated something to effect of\"oh, that's my car.\"",
  "As the subject \nbriskly walked towards Officer Douglas' patrol vehicle, Officer Douglas recognized him from \nsomewhere.",
  "Officer Douglas told the subject \"put your hands on the car\" as the subject walked \nby Officer Douglas' patrol vehicle.",
  "Officer Douglas began to walk toward the subject.",
  "As they \napproached one another, the subject stated, \"fuck you\" and began fleeing on foot towards Willow \nRoad.",
  "Officer Douglas recalls broadcasting that he was in foot pursuit and believed that Officer \nMackdanz was behind him to the left.",
  "Officer Douglas saw Sergeant Romero's vehicle pass \neastbound on Willow Road in front of them, make a u-turn and then stop.",
  "The suspect continued \nrunning and cut through the vegetation in front of the business continuing on into the roadway of \nWillow Road.",
  "The subject put his hand in his right pocket and began running eastbound on \nWillow Road towards Middlefield Road.",
  "His movements suggested to Officer Douglas that the \nsu]?ject was trying to change direction knowing that they were closing in on him in a triangular \nfashion.",
  "As Officer Douglas passed the northbound driveway of 68  Willow Road and as he was running \nafter the fleeing subject, he took out his Taser.",
  "In the street, Officer Douglas fired his Taser at \nthe fleeing subject.",
  "Officer Douglas stated that he believed only one of the darts had contact and \nhe physically indicated the right hand side of his torso.",
  "Simultaneously, while standing in 1'te \nstreet the subject removed a white metal firearm from what Officer Douglas believed was his \nright pants pocket.",
  "Officer Douglas visually demonstrated the movements he saw the subject make by physically \npulling his arm from his right side and raising his arm up and out in 45-degree angle.",
  "Officer \nDouglas verbally described the movements he observed immediately following the subject \narming himself as he \"pulls it out ... swings it towards Sergeant Romero's position ... and then he \nwas starting to swing back this way ... as I recall, I believe a shot may have been fired ... he may \nhave fired a shot and he is spinning my way.",
  "I don't have time to get my gun out. I have a Taser \nin my hand.",
  "I dived for the ground for a number of reasons ... \"  Officer Douglas further \nrecounted that he dove to the ground because, \"I was in fear of my life.",
  "I thought this was it. I \nam either going to get shot by other police officers or the suspect.\"",
  "Officer Douglas recalled hearing other shots being fired.",
  "He did not recall how he unholstered \nhis firearm but h~ described being on the ground, laying on his right side, and firing more than \none round at the armed suspect in response to him believing the suspect fired a round in the \ndirection of Sergeant Romero.",
  "Officer Douglas stated he was unsure of the suspect's actions or whether the armed subject was \nstill standing when Officer Douglas fired to address the threat.",
  "Officer Douglas stated he sustained an injury to his knee when he dove to the ground.",
  "He did not \nrender aid to the suspect because of his injury and the chaos of the scene.",
  "Officer Douglas later \nstated, \"It was very quick, very fast, very dangerous, and I was in fear of my life.\"",
  "15 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation #1426 \n\nThe following Menlo Park Police Department policies are applicable to the officer's actions; \n\nOPINIONS & CONCLUSIONS \n\nSection 300 - Use of Force \n\nSubsection 300.2 - Policy \n\n\"It is the policy of this department that officer shall use only that amount of force \nthat reasonably appears necessary,  given the facts and circumstances perceived \nby the officer at the time of the event,  to effectively bring an incident under \ncontrol.,, \n\nSubsection 300.3 -Deadly Force Applications \n\n\"(a)  Any officer may use deadly force to protect themselves or other from what \nthey reasonably believe would be an immediate threat of death or serious bodily \ninjury.,, \n\n,._ \n\nSection 304 - Shooting Policy \n\nSubsection 304.1.1  - Policy \n\n\"It is the policy of this department to resort to the use of a firearm  under law, \nwhen it appears reasonably necessary and generally; \n\n(a)  An officer may use deadly force to protect him or herself or others from what \nthey reasonably believe would be an immediate threat of death or serious \nbodily injury.",
  ",, \n\nThis investigation revealed the following; \n\nWhile in the commission of a felony, Jerry Lee Matheny was armed with a concealed loaded \nhandgun.",
  "Upon being contacted by police, Matheny fled on foot from two police officers \n(Mackdanz & Douglas) in full uniform and towards another police sergeant (Romero) in full \nuniform.",
  "While fleeing and within close proximity to the police officers, Matheny removed and \ndisplayed the loaded handgun.",
  "Sergeant Romero, Officer Mackdanz, and Officer Douglas each \nunequivocally stated that upon seeing the firearm they were in fear for their own lives as well as \nthe lives of their fellow officers.",
  "Based upon the facts revealed during the investigation, statements provided by uninvolved third \nparties, statements provided by the involved officers, and the physical evidence recovered at the \nscene of the incident it is my opinion that Sergeant Romero, Officer Mackdanz, and Officer \nDouglas' use of deadly force was objectively reasonable given the totality of the circumstances.",
  "Sergeant Romero, Officer Mackdanz, and Officer Douglas' actions during the incident on \nNovember 11, 2014 were within policy.",
  "16 \n\n\fMenlo Park Police Department \nInternal Affairs Investigation # 1426 \n\nATTACHMENTS \n\nA) \nB) \nC) \nD) \nE) \nF) \nG) \nH) \nI) \n\nJ) \nK) \nL) \nM) \nN) \n0) \nP) \n\nSergeant Romero's Administrative Leave Notice \nOfficer Mackdanz' Administrative Leave Notice \nOfficer Douglas' Administrative Leave Notice \nSMCO DA Bureau oflnvestigation Case #CR14-1111-01 \nMenlo Park Police Department Case #14-3507 \nSergeant Romero's Blood Results \nOfficer Mackdanz' Compelled Blood Draw Notice \nOfficer Douglas' Compelled Blood Draw Notice \nSMCO Coroner's Office Pathology Report Case #14-01683 \nSMCO Coroner's Office Report of Investigation Case # 14-01683 \nSMCO Coroner's Office Verdict of Coroner \nSMCO District Attorney's Office Investigation Disposition Letter \nIncident Chronology from RIMS/ CAD I Radio Timestamps \nTranscript of Initial Suspicious Person Call for Service from 64 Willow Place \nTranscript of Primary Police Radio Channel \nOfficer Round Count \nTaser Test & Activation Report \nMenlo Park Police Department-Policy 300 Use of Force \n\n17"
]