[
  "Police Department\n\nUSE OF FORCE REVIEW\nCase # 12004548\n\nOfficers Matthew Griffin & Jeffrey Newlen\n\nPresented by\nSgt.",
  "Bill Grisafe\nAdministrative Services Division\nMarch 14, 2013\n\n\fInvolved Employee\n\nPolice Department\n\nOfficer Matthew Griffin #3135\nFOD - Team 6\nHire Date: 8/28/2008\nAge 36\n6’-0” / 210 lbs\n\nPhoto taken on March 24, 2012\n\n2\n\n\fInvolved Employee\n\nPolice Department\n\nOfficer Jeffrey Newlen #6113\nFOD - Team 6\nHire Date: 11/06/2006\nAge 31\n5’-7” / 145 lbs\n\nPhoto taken on March 24, 2012\n\n3\n\n\fIncident Briefing\n\nPolice Department\n\n• Date, Day & Time of Incident: Saturday, March 24, 2012 @ 2304 hours.",
  "Location of Call/Incident: 140 E. Orange Grove Blvd (El Carrizal Restaurant / Arturo’s Taco Truck).",
  "Use of force occurred at 751 Sunset Ave\n\nResponding Supervisor: Sergeants Paul Carpenter & Max Dahlstein\n\nSupervisor Completing Use of Force Report: Sergeant Paul Carpenter\n\n•\n\n•\n\n•\n\n•\n\n•\n\nType of Call/Incident: Armed Robbery \n\nLevel of Force: Firearm Discharge\n\n• Officers were not injured.",
  "4\n\n\fSuspect Information\n\nPolice Department\n\nKendrec L. McDade\nMale - 19 years old\n5’-8” / 169 lbs\n\nPhoto taken on March 24, 2012\n\n5\n\n\fIncident Overview\n\nPolice Department\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\nAt 11:04:10 pm PD dispatch received a report of an armed robbery that occurred at taco truck.",
  "Caller gave current location of Orange Grove Blvd & Raymond Ave and explained two suspects ran – 1 ran south \non Raymond Ave and 1 ran west on Orange Grove Blvd .",
  "The victim / caller of the robbery (Oscar Carrillo) falsely reported two suspects had handguns.",
  "Carrillo followed suspects in his vehicle and gave description of two suspects to the communication center.",
  "At 11:04:49 pm 3A22 (Griffin and Newlen) were dispatched to the robbery.",
  "Was originally broadcasted as a \nstrong arm robbery.",
  "Approximately 27 seconds later, the dispatcher upgraded call to an armed robbery.",
  "3A22 approached area from S/B Raymond Ave, north of Orange Grove Blvd.",
  "then west on Orange Grove Blvd to  \nFair Oaks Ave.\n\nGriffin was the driver of the police vehicle and Newlen was the front passenger  \n\n6\n\n\fPath of Travel (Officer’s Account)\n\nPolice Department\n\n3A22\n\nMcDade\n\n7\n\n\fIncident Overview\n\nPolice Department\n\n• When Griffin/Newlen arrived at intersection of Orange Grove Blvd and Fair Oaks, see McDade run westbound \n\nacross Fair Oaks Ave (north of Orange Grove Blvd).",
  "• McDade matched description provided by robbery victim.",
  "Suspect ran westbound into parking lot of business located at the northwest corner of intersection (711 N. Fair \nOaks Ave).",
  "Griffin/Newlen followed suspect McDade (in police vehicle) into the parking lot.",
  "Because he believed McDade was armed, Griffin removed his duty weapon from its holster while driving the \npolice vehicle.",
  "Both officers stated Newlen was attempting to broadcast updated information but was not able because of a \nlack of “air time.”  Dispatcher was providing a telephone number to unit 3A31 (approximately 2min 25 sec \nafter initial broadcast).",
  "Parking lot narrows and leads into an alley, which dumps out onto Sunset Ave.\n\nGriffin collided with alley wall causing damage to front right bumper of  police vehicle.",
  "8\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\n\fPath of Travel (Officer’s Account)\n\nPolice Department\n\nMcDade\n\n3A22\n\n9\n\n\fIncident Overview\n\nPolice Department\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\nSuspect exited alley onto Sunset Ave and continued running in a southwest direction, toward Orange Grove \nBlvd.",
  "Griffin continued to follow McDade.",
  "Driving with gun in his hand became challenging due to numerous \nturning maneuvers.",
  "Suspect ran westbound, past Sunset Ave and onto Orange Grove Blvd.",
  "Griffin/Newlen followed in vehicle.",
  "As officers turn westbound onto Orange Grove, McDade had stopped and turned to run in the opposite \ndirection.",
  "Officers recalled McDade still holding waistband.",
  "Griffin stopped the police vehicle and attempted to put the vehicle in reverse (firearm still in his hand).",
  "Newlen exited the police vehicle and began chasing suspect on foot.",
  "At 11:07:17 pm, Newlen’s first radio broadcast – included foot pursuit information and suspect description \n(this was approximately 33 seconds after dispatch provided telephone number to 3A31) .",
  "Griffin backed police vehicle and began following northbound on Sunset Ave in police vehicle.",
  "10\n\n\fIncident Overview\n\nPolice Department\n\n• McDade and Newlen ran northbound on Sunset Ave – remained on west sidewalk.",
  "•\n\n•\n\nGriffin drove the police vehicle northbound on Sunset Ave - passed Newlen and McDade.",
  "Griffin intended to “cut-off” suspect.",
  "Stopped vehicle in front of 751 Sunset Ave.\n\n• McDade left sidewalk and into street, toward Griffin’s police vehicle – driver’s door.",
  "11\n\n\fPath of Travel (Officer’s Account)\n\nPolice Department\n\n3A22\n\nMcDade\n\n12\n\n\fView of Street\n\nPolice Department\n\nPolice Vehicles & area \nof OIS\n\nID Tech Photo taken 3/25/12  4:17 a.m.\n\n13\n\nSunset Ave facing \nnorthbound from \nOrange Grove\n\n\fIncident Overview – (Griffin’s Actions)\n\nPolice Department\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\nGriffin stated by the time he had stopped the police vehicle, McDade had actually passed the vehicle and \nturned back to run towards the driver’s door of the vehicle.",
  "McDade continued to hold waistband.",
  "Griffin recalled McDade was running at him and Griffin felt trapped in the police vehicle.",
  "• When McDade was 2½ to 3 feet away, Griffin fired 4 rounds from his Wilson Combat 1911 (.45 caliber) with \n\na mounted light, while still seated in driver’s seat of vehicle.",
  "Griffin dove over toward passenger seat to avoid being shot.",
  "Griffin heard 2 shots while in this position.",
  "1 to 2 seconds after shooting, he exited police vehicle and found McDade on the ground.",
  "Once outside of vehicle, Griffin noticed blood and attempted to uncover suspect’s concealed hands.",
  "Police vehicle began rolling back towards Griffin and McDade.",
  "The open door  hits Griffin in the back –\ndamage to driver’s door occured.",
  "14\n\n\fIncident Overview – (Newlen’s Actions)\n\nPolice Department\n\n•\n\nNewlen saw McDade run toward police vehicle then heard gunshot.",
  "• McDade turned toward Newlen in a crouched / tactical position.",
  "Newlen was behind McDade and was now standing on the parkway area of the west sidewalk – was following \nMcDade’s path into the street.",
  "Newlen already had weapon drawn and had stopped on parkway.",
  "He described McDade as walking towards \nthe rear of the police vehicle after the gunshots.",
  "Fired four rounds after hearing and seeing 2nd gunshot.",
  "Continued firing until he saw the suspect fall to the \nground.",
  "Newlen fired Glock 22 (.40 caliber) from a standing position, with two hands.",
  "Newlen’s Glock was equipped with a mounted Streamlight flashlight.",
  "Light was on during foot pursuit.",
  "Put police vehicle in park to prevent further movement.",
  "Broadcasted “shots fired” and requested paramedic unit.",
  "15\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\n•\n\n\fK. McDade Injuries\n\nPolice Department\n\nFatal\n\nFatal\n\nFatal\n\n16\n\n\fK. McDade Injuries\n\nPolice Department\n\nGunshot Wound #2\n\nGunshot Wound #1\n\nGunshot Wound #1\n\nGunshot Wound #3\n\nGunshot Wound #2\n\nUPPER BODY INJURIES\n\nGunshot Wound #1\n\n17\n\n\fK. McDade Injuries\n\nPolice Department\n\nGunshot Wound #7\n\nGunshot Wound #6\n\nGunshot Wound #5\n\nGunshot Wound #4\n\nINJURIES TO EXTREMITIES\n\n18\n\n\fFindings\n\nPolice Department\n\nCase has been submitted for review by the Use of Force Board\n\n19"
]