[
  "Advances in Radiation Oncology (2020) 5, 1280-1285\n\nScientiﬁc Article\nArtiﬁcial Intelligence Research: The Utility and\nDesign of a Relational Database System\n\nwww.advancesradonc.org\n\nThomas J. Dilling, MD*\n\nDepartment of Radiation Oncology, Mofﬁtt Cancer Center\n\nReceived 13 March 2020; revised 13 April 2020; accepted 11 June 2020\n\nAbstract\nAlthough many researchers talk about a “patient database,” they typically are not referring to a database at all, but instead to a spreadsheet of\ncurated facts about a cohort of patients.",
  "This article describes relational database systems and how they differ from spreadsheets.",
  "At their core,\nspreadsheets are only capable of describing one-to-one (1:1) relationships.",
  "However, this article demonstrates that clinical medical data\nencapsulate numerous one-to-many relationships.",
  "Consequently, spreadsheets are very inefﬁcient relative to relational database systems,\nwhich gracefully manage such data.",
  "Databases provide other advantages, in that the data ﬁelds are “typed” (that is, they contain speciﬁc\nkinds of data).",
  "This prevents users from entering spurious data during data import.",
  "Because each record contains a “key,” it becomes\nimpossible to add duplicate information (ie, add the same patient twice).",
  "Databases store data in very efﬁcient ways, minimizing space and\nmemory requirements on the host system.",
  "Likewise, databases can be queried or manipulated using a highly complex language called\nSQL.",
  "Consequently, it becomes trivial to cull large amounts of data from a vast number of data ﬁelds on very precise subsets of patients.",
  "Databases can be quite large (terabytes or more in size), yet still are highly efﬁcient to query.",
  "Consequently, with the explosion of data\navailable in electronic health records and other data sources, databases become increasingly important to contain or order these data.",
  "Ultimately, this will enable the clinical researcher to perform artiﬁcial intelligence analyses across vast amounts of clinical data in a way\nheretofore impossible.",
  "This article provides initial guidance in terms of creating a relational database system.",
  "(cid:1) 2020 Published by Elsevier Inc. on behalf of American Society for Radiation Oncology.",
  "This is an open access article under the CC BY-NC-\nND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "Introduction\n\nThis issue of Advances in Radiation Oncology presents\na series of articles around applications of artiﬁcial intel-\nligence (AI) in our ﬁeld.",
  "One of the potential beneﬁts of\nAI is that it can pore through large amounts of data to\ndiscover patterns not evident to clinicians.",
  "However, this\nvast volume of data cannot be accommodated within a\nsingle spreadsheet (which is how most clinical researchers\n\nResearch data are not available at this time. Sources of support: none.",
  "Disclosures: Dr Dilling reports personal fees and nonﬁnancial sup-\nport from NCCN, personal fees from Varian, personal fees and nonﬁ-\nnancial support from Harborside Press, nonﬁnancial support from Astra\nZeneca, all outside the submitted work.",
  "* Corresponding author: Thomas J. Dilling, MD; E-mail: Thomas.",
  "Dilling@mofﬁtt.org. work when conducting standard multivariable analyses).",
  "In fact, many researchers erroneously describe spread-\nsheets as databases.",
  "This article will demonstrate both\nwhat a relational database system is and how it is superior\nto a spreadsheet.",
  "It will also discuss considerations when\nimplementing a relational database system (RDBS) for\nyour own research purposes, using an actual lung cancer\nradiation therapy database as an example.",
  "I have also\nprovided some excellent Wikipedia references\nthat\ncontain abundant additional\ninformation, beyond what\ncan be encapsulated in a single article.",
  "(These, in turn,\nreference computer science literature for the very intrepid\nreader, but such references might extend beyond the level\nof understanding of all but the most technically inclined.)",
  "One might question why a database system is neces-\nsary for AI research.",
  "This article will demonstrate that a\ndatabase enables creation of a multidimensional structure\n\nhttps://doi.org/10.1016/j.adro.2020.06.027\n2452-1094/(cid:1) 2020 Published by Elsevier Inc. on behalf of American Society for Radiation Oncology.",
  "This is an open access article under the CC BY-\nNC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "Advances in Radiation Oncology: NovembereDecember 2020\n\nAI: Database utility and design\n\n1281\n\nto cleanly and accurately contain these data.",
  "To perform\nAI analysis requires efﬁcient storage of hundreds or\nthousands of data points on a single patient or even on a\nsingle course of radiation therapy.",
  "There is a famous\nthe “data science hierarchy of needs”\nillustration of\n(Fig 1).",
  "To perform an AI analysis, one must ﬁrst create\nan RDBS to serve as the storage mechanism.",
  "This crea-\ntion of a system to store structured data entails a major\npart of the bottom row of the pyramid.",
  "To create a data-\nbase,\nthe reader down the path toward\nconducting AI research at their own institution.",
  "then, will set\n\nOrigin of Relational Databases\n\nThe concept of a RDBS was ﬁrst described in a sem-\ninal article in 1970.1 The theoretic construct was that all\ndata could be deﬁned or represented as a series of re-\nlations with or to other data.",
  "The article was quantitative\nin that it used relational algebra and tuple relational cal-\nculus to prove its points.2 IBM used this theoretic\nframework to design what became the initial SQL (pro-\nnounced “see-quell” or “ess-cue-ell”) language, which\nthey used to manipulate and retrieve data from IBM’s\noriginal RDBS.3 Since that time, the American National\nStandards Institute and the International Standards Orga-\nnization have deemed SQL to be the standard language in\nrelational database communication.2 Today, there are a\nwide variety of commercial and open-source relational\ndatabase systems available for use.",
  "These vary in their\nfeatures and relative strengths or weaknesses, but,\nfundamentally,\nthey all operate using the principles\ndeﬁned in the Codd article.1 The SQL language is well\ndeﬁned and is used to write code to query (or update) the\ndata within an RDBS.",
  "Fundamental Disadvantage of Spreadsheets\n\nSpreadsheets are designed to incorporate and analyze\none-to-one (1:1) relationships (Fig 2a).",
  "Each patient has a\nsingle birth date and a single death date.",
  "However, medical\nrecords are rife with “one-to-many” relationships (Fig 2b).",
  "A patient might receive multiple different courses of radi-\nation therapy treatment, as in the example provided, or\nmight have multiple chemotherapy administrations.",
  "To\naccommodate these data, a spreadsheet quickly balloons in\nsize (Fig 2c).",
  "Not only is this inefﬁcient (duplication of\ndata), but it also makes maintenance of the spreadsheet\nextremely cumbersome and prone to error.",
  "For instance, in\nthis example, when patient “12345” passes away, the\n“DeathDate” needs to be updated in 5 rows of the spread-\nsheet (because she had 2 courses of radiation therapy and 4\ncycles of chemotherapy).",
  "It is not difﬁcult to imagine that a\nresearcher could neglect to update the “DeathDate” in each\nplace, introducing errors.",
  "To further expound upon the\nissue, imagine a patient who takes numerous medications or\nhas variable numbers of comorbid illnesses;\nthe rows\nrequired to encapsulate 1 patient explode.",
  "To use a data\nscience term, the dimensionality of the data balloons.",
  "But,\nto reiterate the point, spreadsheets are only designed to\nencapsulate 1:1 relationships (2-dimensional data).",
  "But\npatient data are multidimensional.",
  "Fundamental Advantage of Relational\nDatabases\n\nRDBS gracefully manage one-to-many relationships.",
  "They can do so because a database is created of numerous\ndifferent tables, which are explicitly linked (Fig 3).",
  "Every\n\nFigure 1\nAbbreviation: AI Z artiﬁcial intelligence.",
  "The data science hierarchy of needs.",
  "Used with permission of Monica Rogati (aipyramid.com). For details, see text.",
  "1282\n\nT.J. Dilling\n\nAdvances in Radiation Oncology: NovembereDecember 2020\n\nFigure 2\n(a) Spreadsheets are useful where there is a one-to-one correspondence of data.",
  "For instance, each unique medical record\nnumber (MRN) represents a single patient, with a single birth/death date and a single ﬁrst and last name.",
  "(b) Spreadsheets “break down”\nwhen describing 1-to-many correspondences.",
  "In this example, 2 patients have a total of 5 courses of radiation therapy treatment between\nthem.",
  "(c) To accommodate all the data in our simple example, a spreadsheet needs to store redundant data (colored in red).",
  "The data\nstorage requirements quickly balloon.",
  "Furthermore, as additional traits and factors are added to the spreadsheet, it becomes impossible to\nfollow, as one patient will require untold numbers of rows to capture all relevant data concepts.",
  "Stated another way, the data are\nmultidimensional.",
  "Maintenance and updating of ﬁelds become error-prone (see text).",
  "Abbreviations: DOB Z date of birth; Lname Z\nlast name; Fname Z ﬁrst name; LUL Z upper lobe; MRN Z medical record number; RLL, right lower lobe; RUL Z right upper lobe;\nSBRT Z stereotactic body radiotherapy.",
  "table must also contain a key, which is a unique, required\nidentiﬁer for each row of data.",
  "Relationships between the\ntables are deﬁned when creating the database tables or\nﬁelds.",
  "In the “demographics” table, medical\nrecord\nnumber, “MRN,” is the key.",
  "For the “TreatmentCourse”\nand “Chemotherapy” tables,\nthe keys are “Treatment-\nCourse” and “ChemotherapyID,” respectively.",
  "Note that\n“TreatmentCourse 1” in the “TreatmentCourse” table\npertains to breast radiation therapy treatment.",
  "This, in\nis linked to 4 cycles of chemotherapy in the\nturn,\n“Chemotherapy” table, each of which is uniquely identi-\nﬁed in that table, in turn.",
  "When comparing Fig 3 (a database) to Fig 2c (a\nspreadsheet), note that Fig 3 contains the same informa-\ntion as Fig 2c without the addition of repetitious infor-\nmation (colored red in Fig 2c).",
  "Alternately,\nin a\nspreadsheet, the researcher could manually aggregate and\nsummarize the chemotherapy delivered into a single cell\nin a single row of the spreadsheet (ie, “ﬂatten” the data, to\nuse a data science term), but then some data would be\nlost.",
  "Using the chemotherapy administrations as an\nexample, if one were to “ﬂatten” the data down to a single\nstating “4 cycles of Adriamycin/\nspreadsheet cell\nCytoxan,” one loses the dates of administration.",
  "If one\nsummarizes the data as “4 cycles of Adriamycin/Cytoxan:\n<date1>, <date2>, <date3>, <date4>,” the dates and\nthe chemotherapy occupy the same cell and the data are\nretained but are no longer discrete; one loses the ability to\nﬁlter the spreadsheet by chemotherapy kind or by date.",
  "Conversely, a SQL database cleanly encapsulates these\nmultidimensional data (Fig 3).",
  "Each table is 2-dimensional\n\nin structure.",
  "But because it can contain multiple rows of\ndata on 1 patient (chemotherapy administrations, to follow\nthe same example), a multidimensional structure is created,\nas 4 chemotherapy cycles link to one of 2 courses of radi-\nation therapy (“TreatmentCourse” table) for 1 patient\n(“Demographics” table).",
  "Now, imagine a clinical database\nwith millions of rows of data spread across hundreds of\ntables, as in the real-life example described below.",
  "Clearly,\na spreadsheet would not be adequate.",
  "Additional Advantages of Relational Databases\n\n1.",
  "Each row of data in a table has a unique identiﬁer (a\nkey).",
  "Consequently, one cannot accidentally add a\nrow of data into a database table twice.",
  "2. Each ﬁeld in the database is speciﬁcally deﬁned as to\nwhat it contains (Fig 4).",
  "Consequently, if data are\nimported from some external source, the data types\nmust correspond or the import will fail.",
  "For example,\nif an entry contained an integer where a date was\nindicated, the database would signal that the variable\ncontained erroneous data.",
  "This feature helps maintain\nconsistency of data and minimize data errors. 3.",
  "Not only must the data types correspond, but the\ndata lengths must be observed.",
  "If the database\ndesign states that a ﬁeld is a decimal with 3 places to\nthe right of the decimal place, then a fourth decimal\nplace would be truncated at import.",
  "Alternately, the\ndatabase could declare an error, which might also\nimply that the ﬁeld contains erroneous data.",
  "Advances in Radiation Oncology: NovembereDecember 2020\n\nAI: Database utility and design\n\n1283\n\n4.",
  "A key from one table can be linked “backward” to a\nkey from another table (termed a “foreign key”).",
  "As\nan example (Fig 3), the database can be designed\nsuch that the MRN from “TreatmentCourse” must\nto an MRN already contained within the\nrefer\n“Demographics” table.",
  "If one tried to import data\ninto “TreatmentCourse” and it used an MRN not\nlisted in “Demographics,” the import would fail.",
  "Such a situation might imply, for instance, that the\nMRN was incorrect in the external data source (or in\nthe database).",
  "Or perhaps it relates to a patient who\nreceived prostate radiation therapy (but you have a\nbreast cancer database). 5.",
  "Foreign key relationships also work in the opposite\ndirection: If one realizes that a patient is represented\nin the database who should not be, one can delete\nthe patient from the “Demographics” table and the\ndatabase will delete all data about that patient from\nall the other data tables automatically.",
  "6. RDBS are speciﬁcally optimized to manage vast\namounts of data.",
  "Large spreadsheets (containing\nthousands of rows and hundreds of columns) are\nextremely slow and memory intensive.",
  "However, one\ncan query across or manipulate many gigabytes of data\nin fractions of a second in many RDBS, as the data\nstores are highly optimized and efﬁcient from both a\ncomputational and memory utilization perspective.",
  "7. RDBS are much more secure than spreadsheets.",
  "An\ninstitution’s IT team might allow one to access some\ntables within an institution’s data warehouse, but not\nothers.",
  "One’s access could be restricted to deﬁned\nsubsets of patients.",
  "One might have “read” access to\nthese data, but not “write” access (or “write” access to\nonly some subset of ﬁelds).",
  "Databases might likewise\nbe set up such that only users from speciﬁc IP ad-\ndresses or computers may access them.",
  "The login\nsystems set up by IT departments for these purposes\ntypically use state of the art encryption algorithms, 2-\nfactor authentication, and the like.",
  "In contrast, an\nExcel spreadsheet can be “locked” such that only\nsome ﬁelds are editable.",
  "But it is not possible to\nrestrict data access by user.",
  "Furthermore, this re-\nstriction is to “write” access only, not to “read” ac-\ncess.",
  "It is true that one can “hide” columns in a\nspreadsheet and then lock it, to prevent a given user\nfrom viewing them, but the spreadsheet maintainer\nmust do this manually before distributing the\nspreadsheet (time-consuming and prone to error).",
  "Beneﬁts of SQL\n\nAs described earlier, SQL is a deﬁned, standardized\nlanguage for composing queries within an RDBS, or to\n\nmanipulate and update these data.",
  "Some database systems\nprovide “extensions” to the SQL standard, to provide some\nadditional and speciﬁc functionality (details available in the\nvendors’ literature).",
  "It is beyond the scope of this article to\nteach SQL coding.",
  "However, many excellent online re-\nsources are available for the interested reader.",
  "Functionally,\nSQL allows one to search for any number of variables or\ncombinations of variables across any number of tables,\nsimultaneously.",
  "This can be extremely powerful and useful,\nboth for retrieving and for manipulating and updating data.",
  "Queries can be saved for reuse or modiﬁcation later.",
  "As\nstated above, these queries typically produce output in\nfractions of a second, even across vast pools of data.",
  "Our institution has a database of patients who have\nreceived radiation therapy to the lung, whether for pri-\nmary cancer or metastatic disease to the lung.4 The\ndatabase and some of its details of implementation are\ndescribed below, but ﬁrst, some “real-life” examples of\nwhat such an RDBS system can do (not possible when\nusing a spreadsheet):\n\n(cid:1) Real-life example 1: Find patients who might be\ncandidates for a certain lung cancer clinical trial.",
  "For\nthis particular study,\nthey must have previously\nreceived lung SBRT, have nonmetastatic disease, no\nevidence of recurrence, be alive (obviously), be at\nleast 2 years out from the end of the prior SBRT\ntreatment, and must have been seen in follow-up\nwithin the past 1.5 years.",
  "By constructing an\nappropriate SQL query, 135 patients were found (out\nof more than 4600 in the database) to pass along to\nthe PI for closer inspection.",
  "(cid:1) Real-life example 2: It takes only a few minutes to\nset up very complex queries.",
  "If one has a basic fa-\ncility with SQL, one can design a query such as:\n“Find all patients with stage II or III lung cancer\ntreated with concurrent chemoradiotherapy who\ndeveloped neutropenia during treatment, who are\nfemale, 70 years of age or older, and who take any\nantihypertensive medication (deﬁned in a certain\nlist).” Ultimately, such queries are only limited by\none’s imagination (and the richness or completeness\nof the data coming from the source systems).",
  "It is true that one can “ﬁlter” data in Excel to rapidly\nﬁnd subsets.",
  "However, this ﬁltering is limited to “true or\nfalse” matching.",
  "In this example, it would be impossible\nto discover the patients who developed neutropenia while\nundergoing radiation therapy unless one had a “neu-\ntropenia (yes or no)” column.",
  "But one cannot perform the\narithmetic “where date of neutropenia > Radiation-\nStartDate and < RadiationEndDate” to ﬁlter the data\nwithout writing code in Visual Basic, which is likely\nbeyond the ability of most.",
  "1284\n\nT.J. Dilling\n\nAdvances in Radiation Oncology: NovembereDecember 2020\n\nIn a relational database, data are stored in multiple tables, which are joined via deﬁned variables.",
  "In this ﬁctitious example,\nFigure 3\nnote that the patient only has one “DeathDate” to update.",
  "Furthermore, each course of treatment (“TreatmentCourse”) can have multiple\nchemotherapy cycles associated with it.",
  "Note, too, that medical record number (MRN) only appears in 2 of the 3 tables (it is not needed\nin the “Chemotherapy” table).",
  "If the researcher wishes to retrieve the MRN, it can be obtained via a SQL query, linking back to one of\nthe tables that contains it.",
  "Abbreviations: DOB Z date of birth.",
  "Disadvantage of SQL\n\nWith SQL, it is possible to create highly complex queries;\nit is a rich and powerful language.",
  "However, these can be\n\nquite complicated and obtuse to a nontechnical person.",
  "Some\nsystems do provide graphical tools to help build SQL queries,\nbut, even so, there are some users for whom all but the\nsimplest SQL queries will be beyond their technical skills.",
  "Figure 4 Note that each ﬁeld in this database table is speciﬁcally designed.",
  "It has a “type” (kind) and a “size” (length).",
  "When\nimporting data from numerous external sources, these deﬁnitions can prevent erroneous imports (for details, see text).",
  "Note that the\nﬁeld “MRN” is the key for this table.",
  "All the data in this table refer back to “MRN” via a one-to-one relationship.",
  "MRN can be used as\nthe key because no 2 patients have the same MRN.",
  "Abbreviations: DOB Z date of birth; MRN Z medical record number.",
  "Advances in Radiation Oncology: NovembereDecember 2020\n\nAI: Database utility and design\n\n1285\n\nDatabase Implementation\n\nDatabases may, and often do, contain many thousands\nof tables and millions of rows of data.",
  "(In other words,\nthey can contain data far in excess of the requirements of\nany one radiation oncologist or even any one radiation\noncology department).",
  "In fact, some systems allow even\nsingle tables to contain terabytes or even petabytes of\ndata.5 Consequently, there are numerous systems avail-\nable to accommodate any researcher’s needs.",
  "Some of the\nvery best are open source (free).",
  "Software is available\nacross a wide variety of operating systems.",
  "Wikipedia\nprovides an outstanding overview of the topic.5\n\nTo implement a database system, it is ﬁrst necessary to\nhave a discussion with the IT Department at your institu-\ntion.",
  "There is no single solution for creating a data re-\nresearchers across all\ntrue for\npository that holds\ninstitutions.",
  "The solution can vary, depending on the re-\nsources at your institution and the level of access the IT\nDepartment has into the underlying patient data source\nsystems (often deﬁned in the institutional contracts signed\nwith the individual vendors).",
  "Some large centers have\nelaborate data warehouse systems.",
  "Smaller centers might\nprovide access to data from individual source systems but\nmight not have compiled them into a single data warehouse.",
  "Some IT departments might have adequate resources to\nprovide output data from their data warehouse to individual\nresearchers, when needed.",
  "Others might not. Some might\nprovide a dedicated research server on which the researcher\ncan construct a database.",
  "Other researchers might need to\nrely instead upon existing servers within their department.",
  "I\ndo not recommend that one set up a database system on a\nfree-standing laptop or desktop machine, as there are Health\nInsurance Portability and Accountability Act concerns (the\ncomputer could be stolen).",
  "Data should be backed up across\na secured network electronically.",
  "Creation of a Lung Cancer Radiation Therapy\nDatabase\n\nI began my own database several years ago.",
  "My need\ngrew out of a sense of frustration regarding lack of access\nto clinical data.",
  "At the time, at my institution, it was a\ndifﬁcult (and somewhat mysterious) process to procure\ndata from the data warehouse.",
  "However, data from\nMosaiq (Elekta AB, Stockholm, Sweden), which is our\ndepartment’s record or verify system, were available.",
  "These data formed the nucleus of the original database.",
  "Basic demographic information and radiation therapy\nprescriptions, dates of treatment, dose delivered, tumor\nstage, and the like, were exported, using custom software.",
  "Research IT provided a Linux server, on which I imple-\nmented the database.",
  "I chose to use MariaDB (MariaDB\nis a powerful, well-regarded,\nFoundation, DE), as it\n\ncommercially supported, free, open-source database sys-\ntem whose SQL functions are congruent with those of\nOracle (which is a database system I had used previ-\nously).",
  "Because my institution could not support an\nimplementation of an Oracle, MariaDB was an excellent\nalternate option.",
  "MariaDB does include a Windows GUI\ndatabase administration tool for administering its data-\nbases (creating tables, writing SQL code, importing or\nexporting data, and the like).",
  "I had previously used a\nsimilar commercial database administration product called\nNavicat (Premium Cybertech Ltd, Hong Kong), which\nprovides similar functionality, so I elected to purchase\nthat.",
  "Similarly, I imported all data I had captured in\nresearch projects.",
  "More\nspreadsheets\nrecently, I have gained access to data from our data\nwarehouse and so have created numerous additional ta-\nbles to store the information.",
  "At present, the database\ncontains more than 3 million rows of data on approxi-\nmately 4800 patients, spread across more than 170 tables.",
  "for previous\n\nIncorporation of Data from Other\nInstitutional Data Systems\n\nTo import data from outside source systems requires a\nmultistep process, referred to as “ETL” (“Extraction,\nTransformation, and Loading”) in the data science liter-\nature.”6 The issues go far beyond the physical importation\nof data into the database; importing spreadsheets of data\nare a trivial task.",
  "There are numerous issues in ETL,\nwhich are critical to consider when designing a database\nand importing data into it.",
  "Furthermore, many of these\nissues are not inherently obvious.",
  "In fact, a large pro-\nportion of the time required to create a database and ﬁll it\nwith clinically useable data derives from the ETL\ninvolved.",
  "The oft-reproduced “Data Science Hierarchy of\nNeeds” illustrates this fact (Fig 1).",
  "Most of the discussion\nin this article addressed aspects of the bottom-most layer\nof the pyramid.",
  "ETL comprises the majority of the next 2\nlayers of the pyramid and is the topic of another article.",
  "References\n\n1. Codd ER. A relational model of data for large shared data banks.",
  "Commmunications of the ACM. 1970;13:377-387. 2. Wikipedia. SQL.",
  "Available at: https://en.wikipedia.org/wiki/SQL.",
  "Accessed February 14, 2020. 3. Wikipedia.",
  "IBM System R. Available at: https://en.wikipedia.org/\n\nwiki/IBM_System_R.",
  "Accessed February 14, 2020. 4. Dilling TJ.",
  "Artiﬁcial Intelligence (AI) for clinical analysis: Design\nand implementation of a suitable database resource.",
  "Int J Radiat\nOncol Biol Phys. 2019;105:E131-E132. 5. Wikipedia.",
  "Comparison of relational database managment systems.",
  "Available\nhttps://en.wikipedia.org/wiki/Comparison_of_\nrelational_database_management_systems.",
  "Accessed February 14,\n2020.\n\nat:\n\n6.",
  "Wikipedia. Extract, Transform, Load. Available at: https://en.",
  "wikipedia.org/wiki/Extract,_transform,_load. Accessed April 13,\n2020."
]