[
  "Form 4868\n\nDepartment of the Treasury  \nInternal Revenue Service\n\nApplication for Automatic Extension of Time  \nTo File U.S.",
  "Individual Income Tax Return \n Go to www.irs.gov/Form4868 for the latest information. OMB No.",
  "1545-0074\n\n2024\n\nThere are three ways to request an automatic extension of time to \nfile a U.S. individual income tax return. 1.",
  "You can pay all or part of your estimated income tax due and \nindicate that the payment is for an extension using your bank \naccount; a digital wallet such as Click to Pay, PayPal, and \nVenmo; cash; or a credit or debit card.",
  "See How To Make a \nPayment, later, and www.irs.gov/Payments for more \ninformation. 2.",
  "You can file Form 4868 electronically by accessing IRS e-file \nusing your tax software or by using a tax professional who \nuses e-file.",
  "3. You can file a paper Form 4868 and enclose payment of your \n\nestimate of tax due (optional).",
  "It’s Convenient,  \nSafe, and Secure \n\nIRS e-file is the IRS’s electronic filing program.",
  "You can get an \nautomatic extension of time to file your tax return by filing Form 4868 \nelectronically.",
  "You’ll receive an electronic acknowledgment once you \ncomplete the transaction. Keep it with your records.",
  "Don’t mail in \nForm 4868 if you file electronically, unless you’re making a payment \nwith a check or money order.",
  "See Pay by Check or Money Order, later.",
  "Complete Form 4868 to use as a worksheet.",
  "If you think you may \nowe tax when you file your return, you’ll need to estimate your total \ntax liability and subtract how much you’ve already paid (lines 4, 5, \nand 6 below).",
  "Several companies offer free e-filing of Form 4868 through the \n\nFree File Program.",
  "For more details, go to www.irs.gov/FreeFile.",
  "Pay Electronically\n\nYou don’t need to file Form 4868 if you make a payment using our \nelectronic payment options.",
  "The IRS will automatically process an \nextension of time to file when you pay part or all of your estimated \nincome tax electronically.",
  "You can pay online or by phone.",
  "See \nMaking Payments Electronically, later.",
  "E-file Using Your Tax Software \nor Through a Tax Professional \n\nRefer to your tax software package or tax preparer for ways to file \nelectronically.",
  "Be sure to have a copy of your 2023 tax return—\nyou’ll be asked to provide information from the return for taxpayer \nverification.",
  "If you wish to make a payment, you can pay by \nelectronic funds withdrawal or send your check or money order to \nthe address shown in the middle column under Where To File a \nPaper Form 4868, later.",
  "File a Paper Form 4868 \n\nIf you wish to file on paper instead of electronically, complete the \nForm 4868 below and mail it to the address shown under Where To \nFile a Paper Form 4868, later.",
  "For information on using a private delivery service, see Private \n\nDelivery Services, later.",
  "Note: If you’re a fiscal year taxpayer, you must file a paper        \nForm 4868.",
  "General Instructions \n\nPurpose of Form \nUse Form 4868 to apply for 6 more months (4 if “out of the \ncountry” (defined later under Taxpayers who are out of the country)\nand a U.S. citizen or resident) to file Form 1040, 1040-SR, 1040-NR, \nor 1040-SS.",
  "Gift and generation-skipping transfer (GST) tax return (Form 709 \nor 709-NA).",
  "An extension of time to file your 2024 calendar year \nincome tax return also extends the time to file Form 709 or 709-NA \nfor 2024.",
  "However, it doesn’t extend the time to pay any gift and \nGST tax you may owe for 2024.",
  "To make a payment of gift and GST \ntax, see Form 8892.",
  "If you don’t pay the amount due by the regular \ndue date for Form 709 or 709-NA, you’ll owe interest and may also \nbe charged penalties.",
  "If the donor died during 2024, see the \ninstructions for Forms 709 or 709-NA, and 8892.",
  "Qualifying for the Extension \nTo get the extra time, you must: \n\n1.",
  "Properly estimate your 2024 tax liability using the information \n\navailable to you, \n\n2.",
  "Enter your total tax liability on line 4 of Form 4868, and \n3.",
  "File Form 4868 by the regular due date of your return. ▲!",
  "Although you aren’t required to make a payment of the tax \nyou estimate as due, Form 4868 doesn’t extend the time to \npay taxes.",
  "If you don’t pay the amount due by the regular \nCAUTION\ndue date, you’ll owe interest.",
  "You may also be charged penalties.",
  "For more details, see Interest and Late Payment Penalty, later.",
  "Any \nremittance you make with your application for extension will be \ntreated as a payment of tax.",
  "You don’t have to explain why you’re asking for the extension.",
  "We’ll contact you only if your request is denied.",
  "Don’t file Form 4868 if you want the IRS to figure your tax or  \n\nyou’re under a court order to file your return by the regular due date.",
  "DETACH HERE \n\nApplication for Automatic Extension of Time  \nTo File U.S.",
  "Individual Income Tax Return \n\nFor calendar year 2024, or other tax year beginning \n\nOMB No.",
  "1545-0074\n\n2024\n\nForm 4868\n\nDepartment of the Treasury  \nInternal Revenue Service \n\nPart I \n1   Your name(s) (see instructions)\n\nIdentification\n\nAddress (see instructions)\n\nPart II \n\n, 2024, and ending \nIndividual Income Tax\n\n , 20  \n\n.",
  "4  Estimate of total tax liability for 2024 .",
  ". 5  Total 2024 payments\n\n. . .",
  ". . . $ \n\nSee instructions . 6  Balance due.",
  "Subtract line 5 from line 4.  \n. .",
  "7  Amount you’re paying (see instructions) .",
  "8  Check here if you’re “out of the country” and a U.S. citizen \n\n.",
  ". . . . 9 \n \n\n. or resident. See instructions \n.",
  "Check  here  if  you  file  Form  1040-NR  and  didn’t  receive \nincome  tax \nwages  as  an  employee  subject  to  U.S. \n.",
  ". withholding . Form 4868 (2024) \n\nCat.",
  "No. 13141W\n\n. . . . . . . . . . . . . . . . . .",
  "City, town, or post office\n\nState \n\nZIP code\n\n2   Your social security number\n\n3   Spouse’s social security number\n\nFor Privacy Act and Paperwork Reduction Act Notice, see page 4.",
  "Form 4868 (2024)\n\nWhen To File Form 4868 \nFile Form 4868 by April 15, 2025.",
  "Fiscal year taxpayers file Form \n4868 by the original due date of the fiscal year return.",
  "Taxpayers who are out of the country.",
  "If, on the regular due date \nof your return, you’re out of the country (as defined below) and a \nU.S. citizen or resident, you’re allowed 2 extra months to file your \nreturn and pay any amount due without requesting an extension.",
  "Interest will still be charged, however, on payments made after the \nregular due date, without regard to the extension.",
  "If you’re out of \nthe country and file a calendar year income tax return, you can pay \nthe tax and file your return or this form by June 16, 2025.",
  "File this \nform and be sure to check the box on line 8 if you need an \nadditional 4 months to file your return.",
  "If you’re out of the country and a U.S. citizen or resident, you may \nqualify for special tax treatment if you meet the bona fide residence \nor physical presence test.",
  "If you don’t expect to meet either of \nthose tests by the due date of your return, request an extension to a \ndate after you expect to meet the tests by filing Form 2350, \nApplication for Extension of Time To File U.S. Income Tax Return.",
  "You’re out of the country if: \n\n• You live outside the United States and Puerto Rico and your main \nplace of work is outside the United States and Puerto Rico, or\n• You’re in military or naval service on duty outside the United \nStates and Puerto Rico.",
  "If you qualify as being out of the country, you’ll still be eligible for \nthe extension even if you’re physically present in the United States \nor Puerto Rico on the regular due date of the return.",
  "For more information on extensions for taxpayers out of the \ncountry, see Pub.",
  "54, Tax Guide for U.S. Citizens and Resident \nAliens Abroad. Form 1040-NR filers.",
  "If you can’t file your return by the due date, \nyou should file Form 4868.",
  "You must file Form 4868 by the regular \ndue date of the return.",
  "If you didn’t receive wages as an employee subject to U.S. \nincome tax withholding, and your return is due June 16, 2025, \ncheck the box on line 9.",
  "For more information on extensions for nonresident filers, see \n\nPub.",
  "519, U.S. Tax Guide for Aliens.",
  "Total Time Allowed \nGenerally, we can’t extend the due date of your return for more than \n6 months (October 15, 2025, for most calendar year taxpayers).",
  "However, there may be an exception if you’re living out of the \ncountry.",
  "See Pub. 54 for more information.",
  "Filing Your Tax Return \nYou can file your tax return any time before the extension expires.",
  "Don’t attach a copy of Form 4868 to your return.",
  "Page 2 \n\nInterest \nYou’ll owe interest on any tax not paid by the regular due date of \nyour return, even if you qualify for the 2-month extension because \nyou were out of the country.",
  "The interest runs until you pay the tax.",
  "Even if you had a good reason for not paying on time, you will still \nowe interest.",
  "Late Payment Penalty \nThe late payment penalty is usually ½ of 1% of any tax (other than \nestimated tax) not paid by the regular due date of your return, which \nis April 15, 2025, for most people.",
  "It’s charged for each month or \npart of a month the tax is unpaid. The maximum penalty is 25%.",
  "The late payment penalty won’t be charged if you can show \n\nreasonable cause for not paying on time.",
  "Attach a statement to your \nreturn fully explaining the reason.",
  "Don’t attach the statement to \nForm 4868.",
  "You’re considered to have reasonable cause for the period \n\ncovered by this automatic extension if both of the following \nrequirements have been met. 1.",
  "At least 90% of the total tax on your 2024 return is paid on or \n\nbefore the regular due date of your return through withholding, \nestimated tax payments, or payments made with Form 4868.",
  "2. The remaining balance is paid with your return.",
  "Late Filing Penalty \nA late filing penalty is usually charged if your return is filed after the \ndue date (including extensions).",
  "The penalty is usually 5% of the \namount due for each month or part of a month your return is late. The maximum penalty is 25%.",
  "If your return is more than 60 days \nlate, the minimum penalty is $510 (adjusted for inflation) or the \nbalance of the tax due on your return, whichever is smaller.",
  "You \nmight not owe the penalty if you have a reasonable explanation for \nfiling late.",
  "Attach a statement to your return fully explaining your \nreason for filing late.",
  "Don’t attach the statement to Form 4868.",
  "How To Claim Credit for Payment Made With This \nForm \nWhen you file your 2024 return, include the amount of any payment \nyou made with Form 4868 on the appropriate line of your tax return.",
  "The instructions for the following line of your tax return will tell \n\nyou how to report the payment.",
  "• Form 1040, 1040-SR, or 1040-NR, Schedule 3, line 10.",
  "• Form 1040-SS, Part I, line 11b.",
  "If you and your spouse each filed a separate Form 4868 but later \nfile a joint return for 2024, enter the total paid with both Forms 4868 \non the appropriate line of your joint return.",
  "If you and your spouse jointly file Form 4868 but later file separate \n\nreturns for 2024, you can enter the total amount paid with Form \n4868 on either of your separate returns.",
  "Or you and your spouse \ncan divide the payment in any agreed amounts.",
  "Form 4868 (2024)\n\nPage 3 \n\nSpecific Instructions \n\nHow To Complete Form 4868 \nPart I—Identification \nEnter your name(s) and address.",
  "If you plan to file a joint return, \ninclude both spouses’ names in the order in which they will appear \non the return.",
  "If you want correspondence regarding this extension to be sent to \n\nyou at an address other than your own, enter that address.",
  "If you \nwant the correspondence sent to an agent acting for you, include \nthe agent’s name (as well as your own) and the agent’s address.",
  "If you changed your name after you filed your last return because \n\nof marriage, divorce, etc., be sure to report this to the Social \nSecurity Administration before filing Form 4868.",
  "This prevents \ndelays in processing your extension request.",
  "If you changed your mailing address after you filed your last \n\nreturn, you should use Form 8822, Change of Address, to notify the \nIRS of the change.",
  "Showing a new address on Form 4868 won’t \nupdate your record.",
  "You can download or order IRS forms at  \nwww.irs.gov/FormsPubs.",
  "If you plan to file a joint return, enter on line 2 the social security \nnumber (SSN) that you’ll show first on your return.",
  "Enter on line 3 \nthe other SSN to be shown on the joint return.",
  "If you’re filing Form \n1040-NR as an estate or trust, enter your employer identification \nnumber (EIN) instead of an SSN on line 2.",
  "In the left margin, next to \nthe EIN, write “estate” or “trust.”\nIRS individual taxpayer identification numbers (ITINs) for aliens.",
  "If you’re a nonresident or resident alien and you don’t have and \naren’t eligible to get an SSN, you must apply for an ITIN.",
  "Although \nan ITIN isn’t required to file Form 4868, you’ll need one to file your \nincome tax return.",
  "For details on how to apply for an ITIN, see Form \nW-7 and its instructions.",
  "If you already have an ITIN, enter it \nwherever an SSN is requested.",
  "If you don’t have an ITIN, enter “ITIN \nTO BE REQUESTED” wherever an SSN is requested.",
  "▲! CAUTION\n\nAn ITIN is for tax use only.",
  "It doesn’t entitle you to social \nsecurity benefits or change your employment or \nimmigration status under U.S. law.",
  "Part II—Individual Income Tax \nRounding off to whole dollars.",
  "You can round off cents to whole \ndollars on Form 4868.",
  "If you do round to whole dollars, you must \nround all amounts.",
  "To round, drop amounts under 50 cents and \nincrease amounts from 50 to 99 cents to the next dollar.",
  "For \nexample, $1.39 becomes $1 and $2.50 becomes $3.",
  "If you have to \nadd two or more amounts to figure the amount to enter on a line, \ninclude cents when adding the amounts and only round off the total.",
  "Line 4—Estimate of Total Tax Liability for 2024\nEnter on line 4 the total tax liability you expect to report on your \n2024:\n• Form 1040, 1040-SR, or 1040-NR, line 24; or\n• Form 1040-SS, Part I, line 7.",
  "If you expect this amount to be zero, enter -0-. ▲!",
  "CAUTION\n\nMake your estimate as accurate as you can with the \ninformation you have.",
  "If we later find that the estimate \nwasn’t reasonable, the extension will be null and void.",
  "Line 5—Estimate of Total Payments for 2024\nEnter on line 5 the total payments you expect to report on your \n2024:\n• Form 1040, 1040-SR, or 1040-NR, line 33 (excluding Schedule 3, \nline 10); or\n• Form 1040-SS, Part I, line 12 (excluding Part I, line 11b).",
  "Don’t include on line 5 the amount you’re paying with this \nForm 4868.",
  "▲! CAUTION\n\nLine 6—Balance Due \nSubtract line 5 from line 4.",
  "If line 5 is more than line 4, enter -0-.",
  "Line 7—Amount You’re Paying \nIf you find you can’t pay the amount shown on line 6, you can still \nget the extension.",
  "But you should pay as much as you can to limit \nthe amount of interest you’ll owe.",
  "Also, you may be charged a late \npayment penalty on the unpaid tax from the regular due date of \nyour return.",
  "See Late Payment Penalty, earlier.",
  "Line 8—Out of the Country \nIf you’re out of the country on the regular due date of your return, \ncheck the box on line 8.",
  "“Out of the country” is defined under \nTaxpayers who are out of the country, earlier.",
  "Line 9—Form 1040-NR Filers \nIf you didn’t receive wages subject to U.S. income tax withholding, \nand your return is due June 16, 2025, check the box on line 9.",
  "How To Make a Payment\n\nMaking Payments Electronically\nYou can pay online with a direct transfer from your bank account \nusing Direct Pay; Online Account; the Electronic Federal Tax \nPayment System (EFTPS); a digital wallet such as Click to Pay, \nPayPal, and Venmo; cash; or a debit or credit card.",
  "You can also \npay by phone using EFTPS or by debit or credit card.",
  "For more \ninformation, go to www.irs.gov/Payments. Confirmation number.",
  "You’ll receive a confirmation number when \nyou pay online or by phone.",
  "Enter the confirmation number below \nand keep it for your records.",
  "Enter confirmation number here:  \nNote: If you use an electronic payment method and indicate the \npayment is for an extension, you don’t have to file Form 4868.",
  "You \nshould pay the entire estimated tax owed or you could be subject to \na penalty.",
  "Your extension will be automatically processed when you \npay part or all of your estimated income tax electronically.",
  "Pay by Check or Money Order \n• When paying by check or money order with Form 4868, use the \nappropriate address in the middle column under Where To File a \nPaper Form 4868, later.",
  "• Make your check or money order payable to “United States \nTreasury.” Don’t send cash.",
  "• Write your SSN, daytime phone number, and “2024 Form 4868” \non your check or money order.",
  "• Don’t staple or attach your payment to Form 4868.",
  "Note: If you e-file Form 4868 and mail a check or money order to \nthe IRS for payment, use a completed paper Form 4868 as a \nvoucher.",
  "Please note with your payment that your extension request \nwas originally filed electronically.",
  "Notice to taxpayers presenting checks.",
  "When you provide a \ncheck as payment, you authorize us either to use information from \nyour check to make a one-time electronic fund transfer from your \naccount or to process the payment as a check transaction.",
  "When \nwe use information from your check to make an electronic fund \ntransfer, funds may be withdrawn from your account as soon as the \nsame day we receive your payment, and you will not receive your \ncheck back from your financial institution.",
  "No checks of $100 million or more accepted.",
  "The IRS can’t \naccept a single check (including a cashier’s check) for amounts of \n$100,000,000 ($100 million) or more.",
  "If you’re sending $100 million \nor more by check, you’ll need to spread the payment over two or \nmore checks with each check made out for an amount less than \n$100 million.",
  "The $100 million or more amount limit doesn’t apply \nto other methods of payment (such as electronic payments).",
  "Please \nconsider a method of payment other than check if the amount of the \npayment is $100 million or more.",
  "Form 4868 (2024)\n\n \nIf you live in: \n\nWhere To File a Paper Form 4868\n\nPage 4 \n\nAnd you’re making a payment,  \nsend Form 4868 with your payment to \nInternal Revenue Service: \n\nAnd you’re not making a payment, \nsend Form 4868 to \nDepartment of the Treasury, \nInternal Revenue Service Center: \n\nP.O.",
  "Box 1302, Charlotte, NC 28201-1302\n\nAustin, TX 73301-0045\n\nArizona, New Mexico\n\nP.O.",
  "Box 802503, Cincinnati, OH 45280-2503\n\nAustin, TX 73301-0045\n\nP.O.",
  "Box 931300, Louisville, KY 40293-1300\n\nKansas City, MO 64999-0045\n\nP.O.",
  "Box 802503, Cincinnati, OH 45280-2503\n\nOgden, UT 84201-0045\n\nArkansas, Oklahoma\n\nPennsylvania\n\nP.O.",
  "Box 931300, Louisville, KY 40293-1300\n\nAustin, TX 73301-0045\n\nP.O.",
  "Box 802503, Cincinnati, OH 45280-2503\n\nKansas City, MO 64999-0045\n\nAll foreign estate and trust Form 1040-NR filers\n\nP.O.",
  "Box 1303, Charlotte, NC 28201-1303 USA \n\nKansas City, MO 64999-0045 USA \n\nAll other Form 1040-NR and 1040-SS filers\n\nP.O.",
  "Box 1303, Charlotte, NC 28201-1303 USA \n\nAustin, TX 73301-0215 USA \n\nP.O.",
  "Box 1303, Charlotte, NC 28201-1303 USA\n\nAustin, TX 73301-0215 USA \n\nAlabama, Florida, Georgia, Louisiana, Mississippi, North \nCarolina, South Carolina, Tennessee, Texas\n\nConnecticut, Delaware, District of Columbia, Illinois, Indiana, \nIowa, Kentucky, Maine, Maryland, Massachusetts, Minnesota, \nMissouri, New Hampshire, New Jersey, New York, Rhode \nIsland, Vermont, Virginia, West Virginia, Wisconsin\n\nAlaska, California, Colorado, Hawaii, Idaho, Kansas, Michigan, \nMontana, Nebraska, Nevada, North Dakota, Ohio, Oregon, \nSouth Dakota, Utah, Washington, Wyoming\n\nA foreign country, American Samoa, or Puerto Rico, or are \nexcluding income under Internal Revenue Code section 933,  \nor use an APO or FPO address, or file Form 2555 or 4563,  \nor are a dual-status alien, or nonpermanent resident of Guam or \nthe U.S. Virgin Islands\n\nPrivate Delivery Services \nYou can use certain private delivery services designated by the IRS \nto meet the “timely mailing as timely filing/paying” rule for tax \nreturns and payments.",
  "These private delivery services include only \nthe following.",
  "• Federal Express (FedEx): FedEx First Overnight, FedEx Priority \nOvernight, FedEx Standard Overnight, FedEx 2 Day, FedEx \nInternational Next Flight Out, FedEx International Priority, FedEx \nInternational First, and FedEx International Economy.",
  "• DHL Express: DHL Express 9:00, DHL Express 10:30, DHL \nExpress 12:00, DHL Express Worldwide, DHL Express Envelope, \nDHL Import Express 10:30, DHL Import Express 12:00, and DHL \nImport Express Worldwide.",
  "• United Parcel Service (UPS): UPS Next Day Air Early AM, UPS \nNext Day Air, UPS Next Day Air Saver, UPS 2nd Day Air, UPS 2nd \nDay Air A.M., UPS Worldwide Express Plus, and UPS Worldwide \nExpress.",
  "To check for any updates to the list of designated private delivery \n\nservices, go to www.irs.gov/PDS.",
  "For the IRS mailing address to \nuse if you’re using a private delivery service, go to \nwww.irs.gov/PDSStreetAddresses.",
  "The private delivery service can tell you how to get written proof \n\nof the mailing date.",
  "▲! CAUTION\n\nPrivate delivery services can’t deliver items to P.O.",
  "boxes. You must use the U.S. Postal Service to mail any item to \nan IRS P.O.",
  "box address. Privacy Act and Paperwork Reduction Act Notice.",
  "We ask for the \ninformation on this form to carry out the Internal Revenue laws of \nthe United States.",
  "We need this information so that our records will \nreflect your intention to file your individual income tax return within 6 \nmonths after the regular due date.",
  "If you choose to apply for an \nautomatic extension of time to file, you’re required by Internal \nRevenue Code section 6081 to provide the information requested \non this form.",
  "Under Internal Revenue Code section 6109, you must \ndisclose your social security number or individual taxpayer \nidentification number.",
  "Routine uses of this information include \ngiving it to the Department of Justice for civil and criminal litigation, \nand to cities, states, the District of Columbia, and U.S. \ncommonwealths and territories for use in administering their tax \nlaws.",
  "We may also disclose this information to other countries under \na tax treaty, to federal and state agencies to enforce federal nontax \ncriminal laws, or to federal law enforcement and intelligence \nagencies to combat terrorism.",
  "If you fail to provide this information \nin a timely manner or provide incomplete or false information, you \nmay be liable for penalties.",
  "You aren’t required to provide the information requested on a \nform that is subject to the Paperwork Reduction Act unless the form \ndisplays a valid OMB control number.",
  "Books or records relating to a \nform or its instructions must be retained as long as their contents \nmay become material in the administration of any Internal Revenue \nlaw.",
  "Generally, tax returns and return information are confidential, \nas required by Internal Revenue Code section 6103.",
  "The average time and expenses required to complete and file this \n\nform will vary depending on individual circumstances.",
  "For the \nestimated averages, see the instructions for your income tax return.",
  "If you have suggestions for making this form simpler, we would \nbe happy to hear from you.",
  "See the instructions for your income tax \nreturn."
]