[
  "Your Rights \nas a Taxpayer\n\nPublication 1\n\n \nThis publication explains your rights as a taxpayer and the processes for examination, appeal, collection, and refunds.",
  "Also available in Spanish. The Taxpayer Bill of Rights\n\n1.",
  "The Right to Be Informed\nTaxpayers have the right to know what they need to do to \ncomply with the tax laws.",
  "They are entitled to clear \nexplanations of the laws and IRS procedures in all tax forms, \ninstructions, publications, notices, and correspondence.",
  "They \nhave the right to be informed of IRS decisions about their tax \naccounts and to receive clear explanations of the outcomes. 2.",
  "The Right to Quality Service\nTaxpayers have the right to receive prompt, courteous, and \nprofessional assistance in their dealings with the IRS, to be \nspoken to in a way they can easily understand, to receive clear \nand easily understandable communications from the IRS, and \nto speak to a supervisor about inadequate service.",
  "3. The Right to Pay No More than the \nCorrect Amount of Tax\nTaxpayers have the right to pay only the amount of tax legally \ndue, including interest and penalties, and to have the IRS \napply all tax payments properly. 4.",
  "The Right to Challenge the IRS’s Position \nand Be Heard\nTaxpayers have the right to raise objections and provide \nadditional documentation in response to formal IRS actions or \nproposed actions, to expect that the IRS will consider their \ntimely objections and documentation promptly and fairly, and \nto receive a response if the IRS does not agree with their \nposition.",
  "5. The Right to Appeal an IRS Decision in an \nIndependent Forum\nTaxpayers are entitled to a fair and impartial administrative \nappeal of most IRS decisions, including many penalties, and \nhave the right to receive a written response regarding the \nOffice of Appeals’ decision.",
  "Taxpayers generally have the right \nto take their cases to court. 6.",
  "The Right to Finality\nTaxpayers have the right to know the maximum amount of \ntime they have to challenge the IRS’s position as well as the \nmaximum amount of time the IRS has to audit a particular tax \nyear or collect a tax debt.",
  "Taxpayers have the right to know \nwhen the IRS has finished an audit. 7.",
  "The Right to Privacy\nTaxpayers have the right to expect that any IRS inquiry, \nexamination, or enforcement action will comply with the law \nand be no more intrusive than necessary, and will respect all \ndue process rights, including search and seizure protections, \nand will provide, where applicable, a collection due process \nhearing.",
  "8. The Right to Conﬁdentiality\nTaxpayers have the right to expect that any information they \nprovide to the IRS will not be disclosed unless authorized by \nthe taxpayer or by law.",
  "Taxpayers have the right to expect \nappropriate action will be taken against employees, return \npreparers, and others who wrongfully use or disclose taxpayer \nreturn information.",
  "9. The Right to Retain Representation\nTaxpayers have the right to retain an authorized representative \nof their choice to represent them in their dealings with the \nIRS.",
  "Taxpayers have the right to seek assistance from a Low \nIncome Taxpayer Clinic if they cannot afford representation. 10.",
  "The Right to a Fair and Just Tax System\nTaxpayers have the right to expect the tax system to consider \nfacts and circumstances that might affect their underlying \nliabilities, ability to pay, or ability to provide information timely.",
  "Taxpayers have the right to receive assistance from the \nTaxpayer Advocate Service if they are experiencing financial \ndifficulty or if the IRS has not resolved their tax issues properly \nand timely through its normal channels.",
  "The IRS Mission\n\nProvide America’s taxpayers top-quality service by helping them understand and meet \ntheir tax responsibilities and enforce the law with integrity and fairness to all. Publication 1  (Rev.",
  "9-2017)  Catalog Number 64731W  Department of the Treasury  Internal Revenue Service  www.irs.gov\n\n\fExaminations, Appeals, Collections, and Refunds\n\nExaminations (Audits) \nWe accept most taxpayers’ returns as filed.",
  "If we inquire about your return or select it \nfor examination, it does not suggest that \nyou are dishonest.",
  "The inquiry or \nexamination may or may not result in more \ntax.",
  "We may close your case without \nchange; or, you may receive a refund.",
  "The process of selecting a return for \nexamination usually begins in one of two \nways.",
  "First, we use computer programs to \nidentify returns that may have incorrect \namounts.",
  "These programs may be based \non information returns, such as Forms \n1099 and W-2, on studies of past \nexaminations, or on certain issues \nidentified by compliance projects.",
  "Second, \nwe use information from outside sources \nthat indicates that a return may have \nincorrect amounts.",
  "These sources may \ninclude newspapers, public records, and \nindividuals.",
  "If we determine that the \ninformation is accurate and reliable, we \nmay use it to select a return for \nexamination.",
  "Publication 556, Examination of Returns, \n\nAppeal Rights, and Claims for Refund, \nexplains the rules and procedures that we \nfollow in examinations.",
  "The following \nsections give an overview of how we \nconduct examinations.",
  "By Mail \nWe handle many examinations and \ninquiries by mail.",
  "We will send you a letter \nwith either a request for more information \nor a reason why we believe a change to \nyour return may be needed.",
  "You can \nrespond by mail or you can request a \npersonal interview with an examiner.",
  "If you \nmail us the requested information or \nprovide an explanation, we may or may not \nagree with you, and we will explain the \nreasons for any changes.",
  "Please do not \nhesitate to write to us about anything you \ndo not understand.",
  "By Interview \nIf we notify you that we will conduct your \nexamination through a personal interview, \nor you request such an interview, you have \nthe right to ask that the examination take \nplace at a reasonable time and place that is \nconvenient for both you and the IRS.",
  "If our \nexaminer proposes any changes to your \nreturn, he or she will explain the reasons for \nthe changes.",
  "If you do not agree with these \nchanges, you can meet with the examiner’s \nsupervisor.",
  "Repeat Examinations \nIf we examined your return for the same \nitems in either of the 2 previous years and \nproposed no change to your tax liability, \nplease contact us as soon as possible so \nwe can see if we should discontinue the \nexamination.",
  "Appeals\nIf you do not agree with the examiner’s \nproposed changes, you can appeal them to \n\nthe Appeals Office of the IRS.",
  "Most \ndifferences can be settled without \nexpensive and time-consuming court trials.",
  "Your appeal rights are explained in detail in \nboth Publication 5, Your Appeal Rights and \nHow To Prepare a Protest If You Don’t \nAgree, and Publication 556, Examination of \nReturns, Appeal Rights, and Claims for \nRefund.",
  "If you do not wish to use the Appeals \nOffice or disagree with its findings, you \nmay be able to take your case to the U.S. \nTax Court, U.S. Court of Federal Claims, or \nthe U.S. District Court where you live.",
  "If \nyou take your case to court, the IRS will \nhave the burden of proving certain facts if \nyou kept adequate records to show your \ntax liability, cooperated with the IRS, and \nmeet certain other conditions.",
  "If the court \nagrees with you on most issues in your \ncase and finds that our position was largely \nunjustified, you may be able to recover \nsome of your administrative and litigation \ncosts.",
  "You will not be eligible to recover \nthese costs unless you tried to resolve your \ncase administratively, including going \nthrough the appeals system, and you gave \nus the information necessary to resolve the \ncase.",
  "Collections \nPublication 594, The IRS Collection \nProcess, explains your rights and \nresponsibilities regarding payment of \nfederal taxes.",
  "It describes: \n(cid:127) What to do when you owe taxes.",
  "It \n\ndescribes what to do if you get a tax bill \nand what to do if you think your bill is \nwrong.",
  "It also covers making installment \npayments, delaying collection action, \nand submitting an offer in compromise.",
  "(cid:127) IRS collection actions.",
  "It covers liens, \n\nreleasing a lien, levies, releasing a levy, \nseizures and sales, and release of \nproperty.",
  "(cid:127) IRS certification to the State Department \nof a seriously delinquent tax debt, which \nwill generally result in denial of a \npassport application and may lead to \nrevocation of a passport.",
  "Your collection appeal rights are explained \nin detail in Publication 1660, Collection \nAppeal Rights.",
  "Innocent Spouse Relief \nGenerally, both you and your spouse are \neach responsible for paying the full \namount of tax, interest, and penalties due \non your joint return.",
  "However, if you \nqualify for innocent spouse relief, you may \nbe relieved of part or all of the joint \nliability.",
  "To request relief, you must file \nForm 8857, Request for Innocent Spouse \nRelief.",
  "For more information on innocent \nspouse relief, see Publication 971, Innocent \nSpouse Relief, and Form 8857.",
  "Potential Third Party Contacts \nGenerally, the IRS will deal directly with you \nor your duly authorized representative.",
  "However, we sometimes talk with other \npersons if we need information that you \nhave been unable to provide, or to verify \ninformation we have received.",
  "If we do \ncontact other persons, such as a neighbor, \nbank, employer, or employees, we will \ngenerally need to tell them limited \ninformation, such as your name.",
  "The law \nprohibits us from disclosing any more \ninformation than is necessary to obtain or \nverify the information we are seeking.",
  "Our \nneed to contact other persons may \ncontinue as long as there is activity in your \ncase.",
  "If we do contact other persons, you \nhave a right to request a list of those \ncontacted.",
  "Your request can be made by \ntelephone, in writing, or during a personal \ninterview.",
  "Refunds \nYou may file a claim for refund if you think \nyou paid too much tax.",
  "You must generally \nfile the claim within 3 years from the date \nyou filed your original return or 2 years from \nthe date you paid the tax, whichever is \nlater.",
  "The law generally provides for interest \non your refund if it is not paid within 45 \ndays of the date you filed your return or \nclaim for refund.",
  "Publication 556, \nExamination of Returns, Appeal Rights, \nand Claims for Refund, has more \ninformation on refunds.",
  "If you were due a refund but you did not \n\nfile a return, you generally must file your \nreturn within 3 years from the date the \nreturn was due (including extensions) to get \nthat refund.",
  "Taxpayer Advocate Service  \nTAS is an independent organization within \nthe IRS that can help protect your taxpayer \nrights.",
  "We can offer you help if your tax \nproblem is causing a hardship, or you’ve \ntried but haven’t been able to resolve your \nproblem with the IRS.",
  "If you qualify for our \nassistance, which is always free, we will do \neverything possible to help you.",
  "Visit \nwww.taxpayeradvocate.irs.gov or call \n1-877-777-4778.",
  "Tax Information \nThe IRS provides the following sources for \nforms, publications, and additional \ninformation.",
  "(cid:127) Tax Questions: 1-800-829-1040 \n(1-800-829-4059 for TTY/TDD)\n\n(cid:127) Forms and Publications: \n\n1-800-829-3676 (1-800-829-4059 for \nTTY/TDD) \n\n(cid:127) Internet: www.irs.gov \n(cid:127) Small Business Ombudsman: A small \nbusiness entity can participate in the \nregulatory process and comment on \nenforcement actions of the IRS by \ncalling 1-888-REG-FAIR.",
  "(cid:127) Treasury Inspector General for Tax \n\nAdministration: You can confidentially \nreport misconduct, waste, fraud, or \nabuse by an IRS employee by calling \n1-800-366-4484 (1-800-877-8339 for \nTTY/TDD). You can remain anonymous."
]