[
  "Your Appeal Rights and \nHow to Prepare a Protest  \nif You Disagree\n\nThe IRS Independent Office of Appeals Mission\nTo resolve Federal tax controversies without litigation on a basis which is fair and impartial to both the \nGovernment and the taxpayer, promotes a consistent application and interpretation of, and voluntary \ncompliance with, the Federal tax laws, and enhances public confidence in the integrity and efficiency of the \nService.",
  "Introduction\nThis publication explains actions you should take \nprior to requesting an administrative appeal of \nyour tax case if you don’t agree with the Internal \nRevenue Service’s (IRS) proposed changes or \nfindings.",
  "It also provides an overview of your \nadministrative appeal rights within the IRS and a \nsummary of your rights to have your case heard in \nthe United States Federal Courts.",
  "While this publication mainly focuses on disputes \nresulting from an examination of a tax return or \nclaim for refund or credit, the information on how \nto prepare a protest also applies to disputes \nresulting from many other types of IRS actions, \nincluding, but not limited to the following:\n\n  Denial of a request for certain penalty \n\nabatement\n\n  Denial of a request for innocent spouse relief \n\n  Rejection of an offer in compromise\n\n  Determination that you owe a penalty\n\n  Determination affecting tax-exempt status\n\n  Determination affecting qualification of a \n\nretirement plan\n\nThese actions result in a proposed change to your \nFederal tax liability, a denial of your request to \nchange your Federal tax liability, or a change to \nyour reporting requirements.",
  "This publication refers \nto all these actions as proposed changes.",
  "The Taxpayer Bill of Rights states you have the \nright to appeal an IRS decision in an independent \nforum.",
  "You are entitled to a fair and impartial \nadministrative appeal of most IRS decisions, \nincluding many penalties, and have the right to \nreceive a written response regarding the IRS \nIndependent Office of Appeals’ (hereinafter, \nAppeals) decision.",
  "You also generally have the right \nto take your case to court.",
  "For more information on \nthe Taxpayer Bill of Rights, see Publication 1, Your \nRights as a Taxpayer. Publication 5 (Rev.",
  "4-2021)  Catalog Number 46074I  Department of the Treasury  Internal Revenue Service  www.irs.gov\n\n\fgov/forms-instructions or call 800-TAX-FORM \n(800-829-3676) for IRS Publications.",
  "If your case involves… Refer to…\n\nA change in tax-exempt \nstatus\n\nAn employee plans \nexamination change\n\nAn employment tax \nexamination change\n\nDisqualification of a \nretirement plan\n\nPublication 892, How to Appeal \nan IRS Determination on Tax-\nExempt Status\n\nPublication 1020, Appeal \nProcedures Employee Plans \nExaminations\n\nPublication 5146, Employment \nTax Returns: Examinations and \nAppeal Rights\n\nPublication 5153, Appeal \nProcedures: Adverse \nDetermination Letter on \nQualification of a Retirement Plan\n\nIf you don’t agree with the changes proposed \nby the IRS, you may contact the IRS employee \nidentified in the letter you received to discuss \nthe issues.",
  "Generally, if you cannot reach an \nagreement with the IRS employee, you may \nrequest a discussion with the employee’s \nsupervisor.",
  "If you still don’t agree after your \nattempts to resolve the matter with the IRS \nemployee and/or supervisor, you may request Fast \nTrack Settlement (FTS) if your case qualifies, or an \nadministrative appeal with Appeals.",
  "See Protests \non page 3 for more information on how to request \nan administrative appeal.",
  "Additional Resources\n\nFor some types of cases, the appeals process \nand available court actions are different than a \ntax deficiency or claim disallowance case, which \nare overwhelmingly the most common disputes \nin Appeals.",
  "See www.irs.gov/appeals for more \ninformation.",
  "The letter that you received from the \nIRS proposing the changes may contain important \ninformation about the appeal rights available to \nyou for your specific type of case, including how \nto request an appeal and what will happen if you \ndecide not to appeal.",
  "If your case involves one of the issues listed in \nthe table on this page, refer to the appropriate \npublication for specific guidance. Visit www.irs.",
  "If You Don’t Agree\n\nBefore you request an appeal, make sure that \nyou have provided the IRS employee handling \nyour case with any information, documents, and \nexplanations that the employee requested, or that \nyou would like the IRS to consider.",
  "If you have \nnot submitted this information, contact the IRS \nemployee identified in the letter you received and \nprovide this information within the specified time \nlimit.",
  "If you provide new information or raise new \nissues to Appeals that the IRS has not previously \nconsidered, it may first need to be considered \nby an IRS employee, which will likely delay \nthe resolution of your case.",
  "See The Appeals \nConference on page 5.",
  "If You Do Nothing…\n\nAnd Your Case Is…\n\nThe IRS Will…\n\nAn examination of your income, estate \n(and generation-skipping transfer), gift (and \ngeneration-skipping transfer), or certain excise \ntaxes or penalties, with a proposed deficiency\n\nAn examination of your employment tax \nliabilities\n\nSend you a notice of deficiency allowing you a limited time to petition the U.S. Tax \nCourt for redetermination.",
  "If you don’t timely petition the U.S. Tax Court, the IRS will \nsend you a bill for the amount due.",
  "Send you a bill for the amount due relating to issues not reviewable by the U.S. \nTax Court.",
  "In certain instances, you may receive a Notice of Employment Tax \nDetermination Under IRC 7436 which affords you a limited time to petition the U.S. \nTax Court.",
  "If you don’t timely petition the U.S. Tax Court, the IRS will send you a bill \nfor the amount due relating to the issues included in that notice.",
  "Refer to Publication \n5146, Employment Tax Returns: Examinations and Appeal Rights; and Publication \n3953, Questions and Answers About Tax Court and the Notice of Employment Tax \nDetermination Under IRC § 7436.",
  "2\n\n\fAnd Your Case Is…\n\nThe IRS Will…\n\nA denial of a claim for refund\n\nSend you a notice of claim disallowance explaining that you have a limited time to \nfile suit with the appropriate U.S. District Court or the U.S. Court of Federal Claims.",
  "You may have already received this notice.",
  "A proposal of a trust fund recovery penalty or \ncertain information return penalties\n\nSend you a bill for the amount due.",
  "A rejection of an offer in compromise (OIC) \nbased on doubt as to liability.",
  "Continue collection action after the expiration of a 30 day period following the \nrejection, as warranted.",
  "A denial of a penalty abatement\n\nClose your case without abating the penalty.",
  "A denial of a request for innocent spouse relief\n\nGenerally send you a final determination letter regarding your request allowing you a \nlimited time to petition the U.S. Tax Court.",
  "A determination on tax-exempt status or on \nqualification of a retirement plan\n\nSend you a final adverse determination letter.",
  "In general, if you do not file a protest \nto the proposed adverse letter, you cannot appeal the final adverse determination \nletter.",
  "In addition, you must have exhausted your administrative remedies to be able \nto seek a declaratory judgment in court.",
  "Appeals Mediation Programs\n\nIn certain IRS cases, you may request an \nexpedited dispute resolution process called Fast \nTrack Settlement (FTS).",
  "The disputed issue must \nbe fully developed and the IRS must agree to \nparticipate in this process.",
  "During FTS, your case \nremains in the examiner’s jurisdiction while a \nspecially trained Appeals employee serves as a \nneutral party using dispute resolution techniques \nto facilitate an agreement between you and the \nIRS.",
  "You may withdraw from the FTS process at \nany time.",
  "You will retain your usual appeal rights if \nany issues remain unresolved.",
  "To request FTS, inform the IRS employee handling \nyour case that you are interested in FTS.",
  "If the \nexamination division agrees to participate in this \nprocess, they will work with you to jointly complete \nthe necessary form to start the process.",
  "See Publication 4167 or the Appeals Mediation  \n- Alternative Dispute Resolution (ADR) website \nat www.irs.gov/appeals/appeals-mediation-\nprograms for more information on FTS and other \nAppeals’ ADR programs.",
  "Protests\nYou must submit a written protest to request \nan Appeals conference.",
  "The Appeals employee \nassigned to your case will use your protest to \n\nprepare for the Appeals conference.",
  "Refer to Notice \n609, Privacy Act Notice, for more information about \nhow the IRS uses information you provide.",
  "Send your protest to the IRS address in the letter \nyou received within the time limit specified in the \nletter.",
  "A formal protest is required in all cases \nunless you qualify for a small case request, as \ndiscussed below, or another appeal procedure.",
  "Small Case Request\nIf the total amount of tax and penalties for each \ntax period involved is $25,000 or less in the letter \nyou received, you may make a small case request \ninstead of filing a formal written protest.",
  "See under \n“Formal Written Protest” for cases that are not \neligible for small case requests.",
  "In computing \nthe total amount, include a proposed increase or \ndecrease in tax (including penalties), or claimed \nrefund.",
  "For an offer in compromise, the entire \namount for each tax period includes total unpaid \ntax, penalty and interest due.",
  "For a small case \nrequest, you may either:\n\n  Prepare a brief written statement listing the \ndisputed issues and why you disagree, or\n\n  Complete the appeal request form included \nwith the letter you received proposing the \nchange, if applicable, or you can use Form \n12203, Request for Appeals Review.",
  "3\n\n\fFormal Written Protest\nA formal written protest is required if the proposed \nchange to the total amount of tax and penalties \nfor any tax period is more than $25,000 in the \nletter you received.",
  "The total amount includes \nthe proposed increase or decrease in tax and \npenalties or claimed refund.",
  "If more than one tax \nperiod is involved and any tax period exceeds the \n$25,000 threshold, you must file a formal written \nprotest for all periods involved.",
  "For an offer in \ncompromise, include total unpaid tax, penalties \nand interest due.",
  "A formal written protest is also \nrequired in the following cases:\n\n  Employee plan and exempt organization cases \n\nregardless of the dollar amount.",
  " Partnership and S Corporation cases \n\nregardless of the dollar amount.",
  " In all other cases, unless you qualify for \n\nthe small case request procedure, or other \nspecial appeal procedures, such as requesting \nAppeals consideration of liens, levies, seizures, \nor installment agreements.",
  "See Publication \n1660, Collection Appeal Rights, for more \ninformation on special collection appeals \nprocedures.",
  "In your formal protest, include a statement that you \nwant to appeal the changes proposed by the IRS \nand include all of the following:\n\n  Your name, address, and a daytime telephone \n\nnumber.",
  "disagree with each issue.  Facts supporting your position on each \n\ndisputed issue.",
  " Law or authority, if any, supporting your \n\nposition on each disputed issue.",
  " Penalties of perjury statement, as follows:\n\n“Under penalties of perjury, I declare to the best \nof my knowledge and belief, the information \ncontained in this protest and accompanying \ndocuments is true, correct, and complete.”\n\nNote: Representatives who submit the protest \nmust use the applicable penalties of perjury \nstatement below, based upon whether they have \npersonal knowledge regarding the information \nstated in the protest and accompanying \ndocuments:\n\n  Personal Knowledge: \n\n“Under penalties of perjury, I declare that I \nsubmitted the protest and accompanying \ndocuments, and to the best of my personal \nknowledge and belief, the information \nstated in the protest and accompanying \ndocuments is true, correct, and complete.”\n\n  No Personal Knowledge: \n\n“Under penalties of perjury, I declare that \nI submitted the protest and accompanying \ndocuments, and I have no personal \nknowledge concerning the information \nstated in the protest and accompanying \ndocuments.”\n\n  List of all disputed issues, tax periods or years \ninvolved, proposed changes, and reasons you \n\n  Your (or your representative’s) signature under \n\nthe penalties of perjury statement.",
  "IRS Independent Office of Appeals\nAppeals is an independent function of the IRS, \nseparate from the division of the IRS that proposed \nthe changes.",
  "It is the only level of administrative \nappeal within the IRS.",
  "Appeals employees fairly \nand impartially settle disputes between taxpayers \nand other divisions of the IRS by considering the \narguments made by both sides, and then applying \nthe relevant tax law (including court decisions and \nother legal authorities) to the facts of the case.",
  "Most disputes can be settled informally at the \nAppeals level without litigation.",
  "4\n\nAs an administrative function of the IRS, Appeals \ncan only consider your arguments if they are \nbased on tax laws.",
  "Appeals cannot consider \nyour arguments if they are based only on moral, \nreligious, political, constitutional, conscientious, or \nsimilar objections to the assessment or payment of \nFederal taxes.",
  "The IRS is legally required to assess proposed tax \nby a certain date in most cases.",
  "We refer to this \ndate as the statute of limitations.",
  "Generally, before \n\n\fan examination case is received in Appeals, IRS \npolicy for originating functions may require greater \nthan 365 days remain on the statute of limitations.",
  "The IRS will ask you to agree to extend this date \nif additional time is needed to meet the required \nnumber of days.",
  "If you choose not to extend the \ndate, Appeals will not accept your case.",
  "Note that \ndocketed U.S. Tax Court cases do not have the \nstatute of limitation concerns that non-docketed \ncases do.",
  "The Appeals Conference\nAppeals conferences are held in an informal \nmanner.",
  "Appeals will contact you and/or your \nauthorized representative to arrange a conference \nat a convenient time.",
  "You may represent yourself at your appeals \nconference, or you may appoint a person \nauthorized to practice before Appeals to \nrepresent you such as an attorney, certified public \naccountant, or enrolled agent.",
  "See Circular No. 230, Regulations Governing Practice Before the \nInternal Revenue Service, for more information \non qualifications to practice before Appeals.",
  "You \nmay include a person who doesn’t meet these \nqualifications in your appeals conference as a \nwitness, but they may not represent you before \nAppeals.",
  "If you want your representative to participate in \nan appeals conference without you, you must \n\nCourt Actions\nIf you do not appeal your case within the IRS, or \nwere unable to reach a settlement with Appeals, \nyou may be able to take your case to one of the \nfollowing courts if you satisfy the court’s procedural \nand jurisdictional requirements:\n\n  United States Tax Court\n\n  United States Court of Federal Claims\n\n  United States District Court in the judicial \n\ndistrict where you reside or have your principal \nplace of business\n\nYou can obtain rules from each court.",
  "These \ncourts are independent judicial bodies and have no \nconnection with the IRS.",
  "provide a properly completed power of attorney \nto the IRS before the representative can receive \nor inspect confidential information.",
  "You can use \nForm 2848, Power of Attorney and Declaration \nof Representative, or any other properly written \npower of attorney or authorization for this purpose.",
  "If you can’t afford representation, a Low Income \nTaxpayer Clinics (LITC) may be able to represent \nyou if you qualify.",
  "In addition, LITCs also provide \nassistance to taxpayers who speak English as a \nsecond language to help taxpayers understand \ntheir rights and responsibilities.",
  "You can find \nmore information about LITCs in Publication \n4134, Low Income Taxpayer Clinic List.",
  "LITCs are \nindependent from the IRS.",
  "You can get copies of \nForm 2848 or Publication 4134 from www.irs.gov, \nan IRS office, or by calling 800-TAX-FORM (800-\n829-3676).",
  "You or your authorized representative should be \nfully prepared to discuss all disputed issues and \nthe reasons you disagree with each issue at the \nconference.",
  "If you submit new information or \nraise a new issue requiring additional analysis, \nAppeals will generally return the case to the \noriginating IRS office for its determination \non the new information.",
  "You will receive the \noriginating office’s comments, have an opportunity \nto respond, and can continue to pursue your \nappeal rights.",
  "U.S. Tax Court\nYou may be able to file a petition with the U.S. Tax \nCourt to review the changes proposed by the IRS.",
  "The U.S. Tax Court is generally a “prepayment” \nforum, which means you can petition the U.S. \nTax Court before making full payment, but its \njurisdiction is limited.",
  "You generally cannot petition \nthe U.S. Tax Court unless you have received a \nnotice or determination letter that informs you that \nyou have the right to do so.",
  "However, you may also \npetition the Tax Court if you have not received a \nnotice or determination involving:  a determination \nof tax-exempt status under IRC 7428 if the IRS \nhas not made a determination after 270 days; the \n\n5\n\n\fabatement of interest if the IRS has not mailed a \nfinal determination within 180 days of a claim for \nabatement under IRC 6404; or an innocent spouse \nrelief request if the IRS has not issued a final \ndetermination letter after six months since filing \nForm 8857, Request for Innocent Spouse Relief.",
  "You must file your petition with the U.S. Tax Court \nwithin the timeframe specified in the notice, usually \n90 days (or 150 days if the notice is addressed to a \nperson outside the United States).",
  "There is a filing \nfee, but the fee may be waived if you qualify.",
  "The \nlaw sets the time to file your petition; the IRS or the \nU.S. Tax Court cannot change this time period.",
  "You \nhave only the timeframe specified to petition the \ncourt, even if you continue to talk to IRS examiners \nor Appeals.",
  "You can get more information about the U.S. Tax \nCourt’s procedures and other matters on the \ncourt’s website at www.ustaxcourt.gov or by \nwriting to:  \n\nU.S. Tax Court \nAttn: Office of the Clerk of the Court \n400 Second Street, N.W.",
  "Washington, DC 20217-0002\n\nIf you timely petition the Tax Court, and you did not \npreviously appeal your case within the IRS, you will \nnormally have an opportunity to attempt settlement \nwith Appeals while you are waiting for your trial.",
  "The \nTax Court will still follow its normal procedures to \nschedule your case for trial, but you may not need \nto appear at trial if you settle your case before the \ntrial date.",
  "If unable to settle, you may appear pro \nse (by yourself) at Tax Court or by a representative \nadmitted to the Tax Court that you appointed.",
  "Innocent Spouse Appeals\n\nIf you are the spouse who filed Form 8857, \nRequest for Innocent Spouse Relief, requesting \ninnocent spouse relief (the “requesting spouse”), \nyou can generally request an appeal if the IRS \ndenies your request in whole or in part.",
  "If you are \na non-requesting spouse, you can request an \nappeal if the IRS grants innocent spouse relief \nin whole or in part to your requesting spouse (or \nformer spouse).",
  "However, a non-requesting spouse \ncannot appeal an IRS decision to deny relief to \n\nCaution: If the Tax Court determines that your case \nis intended primarily to cause a delay, or that your \nposition is frivolous or groundless, the court can \nimpose a penalty against you of up to $25,000 in its \ndecision.",
  "District Court and the U.S. Court of \nFederal Claims\nYou can take your case to your U.S. District Court \nor the U.S. Court of Federal Claims, but generally \nonly after you have fully paid the amount and timely \nfiled a claim for refund with the IRS.",
  "If you are a \nnonresident alien, you may seek relief in the U.S. \nCourt of Federal Claims, but you generally cannot \ntake your case to a U.S. District Court because \nyou are not a resident of any United States judicial \ndistrict.",
  "If you filed a timely claim for a refund with the IRS \nbut haven’t received a written response on your \nclaim within 6 months from the date you filed it, you \ncan file suit for a refund in your U.S. District Court \nor the U.S. Court of Federal Claims.",
  "Certain types \nof cases, such as those involving some employment \ntax issues or manufacturers’ excise taxes, can only \nbe heard by these courts.",
  "Note: You have 2 years from the date of the notice \nof claim disallowance to file a refund suit.",
  "Appeals’ \nconsideration of a disallowed claim doesn’t extend \nthe 2-year period for filing suit.",
  "However, it may be \nextended by mutual agreement.",
  "You can get information about procedures for filing \nsuit in either court on their websites:\n\n  U.S. District Courts website: www.uscourts.",
  " Court of Federal Claims website: www.cofc.",
  "gov\n\nuscourts.gov\n\nthe requesting spouse (or former spouse).",
  "Your \nappeal request must be submitted in writing.",
  "You \ncan use Form 12509, Innocent Spouse Statement \nof Disagreement, to explain why you disagree \nwith the IRS’s proposed determination concerning \nyour request  or your (current or former) spouse’s \nrequest for innocent spouse relief.",
  "If you are the requesting spouse, you can petition \nthe U.S. Tax Court to review your request for \ninnocent spouse relief if:\n\n6\n\n\f1.",
  "Six months have passed since you filed \nForm 8857 and you have not received a final \ndetermination letter from the IRS; or\n\n2.",
  "You have received a final determination letter \ndenying relief in full or in part and you petition the \nU.S. Tax Court no later than 90 days after the IRS \nsent you that letter.",
  "If you petition the U.S. Tax Court for relief, the Tax \nCourt’s scope of review will be limited to the IRS’s \nadministrative record established at the time of the \ndetermination (the date of the final determination \nletter), and any newly discovered or previously \nunavailable evidence.",
  "Therefore, it is important for \nboth the requesting and non-requesting spouse to \nprovide all relevant, available evidence to the IRS \nbefore it issues its final determination.",
  "Pass-Through Entity Appeals (BBA)\n\nThe Bipartisan Budget Act of 2015 (BBA), as \namended, repealed the Tax Equity and Fiscal \nResponsibility Act of 1982 (TEFRA) partnership \nprocedures and electing large partnership \nprovisions and replaced them with an entirely \nnew centralized partnership audit regime.",
  "BBA is \ngenerally effective for tax years beginning 1/1/2018, \nwith allowances for early elect-in for tax periods \nbeginning after 11/2/2015.",
  "If the entity and tax year(s) at issue are covered \nby BBA, the entity has appeal rights.",
  "At the \nend of the Appeals process, Appeals will issue \na Notice of Proposed Partnership Adjustment \n(NOPPA) for all proposed adjustments, whether \n\nagreed or unagreed.",
  "In response to the NOPPA, \nthe partnership may request modification and an \nopportunity for a modification Appeals hearing.",
  "However, in a modification Appeals hearing, \nAppeals will not reconsider an issue that was \npreviously disputed and considered by Appeals.",
  "If a Notice of Final Partnership Adjustment (FPA) \nis issued, the partnership may elect to “push-out” \nan imputed underpayment to its partners to take \ninto account, file a petition for judicial review of the \nadjustments, or both.",
  "See www.irs.gov/businesses/partnerships/bba-\npartnership-audit-process, for more information.",
  "Recovering Administrative and Litigation Costs\nYou may be able to recover your reasonable \nadministrative and litigation costs if you are \nthe prevailing party and if you meet the other \nrequirements.",
  "For example, you must exhaust your \nadministrative remedies within the IRS including \nparticipating in the Appeals process, and you must \nnot unreasonably delay the administrative or court \nproceedings.",
  " Reasonable amounts for court costs or any \nadministrative fees or similar charges by the \nIRS.",
  " Reasonable expenses of expert witnesses.",
  " Reasonable costs of studies, analyses, tests, \nor engineering reports that are necessary to \nprepare your case.",
  " Administrative costs are costs incurred for \nadministrative proceedings on or after the \ndate you receive the first letter of proposed \ndeficiency giving you an opportunity for review \nin Appeals, the Appeals decision letter, or the \nnotice of deficiency, whichever is earliest.",
  " Litigation costs are costs incurred for court \n\nproceedings.",
  "Recoverable litigation or administrative \ncosts may include:\n\n  In general, attorney fees that do not exceed \na maximum hourly rate, which changes from \nyear to year.",
  "Fees in excess of the maximum \ncan be awarded in limited circumstances.",
  "To qualify as a prevailing party, you must\n\n  Substantially prevail on the amount in \n\ncontroversy or the most significant issue(s) \npresented, or obtain a final judgment that is \nless than or equal to a “qualified offer” that the \nIRS rejected, AND\n\n  Meet the applicable net worth and size \n\nrequirements.",
  "Net worth and size limitations:\n\n  For individuals, estates, or trusts, net worth \n\ncannot exceed $2,000,000.",
  " Charities and certain cooperatives must not \n\nhave more than 500 employees.",
  "7\n\n\f  A partnership, corporation, association, unit of \nlocal government, or organization must have a \nnet worth of $7,000,000 or less and must not \nhave more than 500 employees.",
  "of whether the Government’s position was \nsubstantially justified will also consider the \noutcome of the same issue(s) or position(s) in other \ncases the Government has already litigated.",
  " In TEFRA partnership proceedings, both the \npartnership and the requesting partner must \nmeet relevant net worth and size limitations.",
  "You are not the prevailing party if:\nThe United States establishes that its position was \nsubstantially justified.",
  "If the IRS does not follow \napplicable published guidance, the United States \nis presumed to not be substantially justified.",
  "This \npresumption is rebuttable.",
  "Applicable published \nguidance means regulations, revenue rulings, \nrevenue procedures, information releases, notices, \nannouncements, and, if they are issued to you, \nprivate letter rulings, technical advice memoranda \nand determination letters.",
  "The determination \n\nIn the context of administrative proceedings, \nAppeals will determine who is the prevailing party.",
  "You must file your claim for administrative costs \nno later than the 90th day after the IRS mails (or \notherwise furnishes) you the final determination of \ntax, penalty or interest.",
  "This means that you may \nreceive administrative costs from the IRS without \ngoing to court.",
  "If your application for administrative \ncosts is denied, you may appeal the determination \nto the U.S. Tax Court no later than the 90th day \nafter the IRS mailed you the denial letter.",
  "In the context of court proceedings, a court will \ndecide who is the prevailing party.",
  "You must \nfollow applicable court rules when filing your claim \nfor costs.",
  "Taxpayer Advocate Service (TAS) Assistance\n\nThe TAS is an independent organization within the \nIRS that helps taxpayers and protects taxpayers’ \nrights.",
  "TAS can offer free help if your tax problem \nis causing a  financial difficulty, you’ve tried but are \nunable to  resolve your issues with the IRS or you \nbelieve an IRS system, process or procedure isn’t \n\nworking as it should.",
  "If you believe you are eligible \nfor TAS assistance or would like more information, \ncall the TAS at 877-777-4778, TTY/TDD 800-829-\n4059, go to www.taxpayeradvocate.irs.gov, or \nrefer to Publication 1546, Taxpayer Advocate \nService – We Are Here to Help You.",
  "Report IRS Actions\nYou can confidentially report misconduct, waste, \nfraud, or abuse by an IRS employee to Treasury \nInspector General for Tax Administration (TIGTA) \nby calling 800-366-4484 (800-877-8339 for TTY/\nTDD). You can remain anonymous.",
  "Small Business Ombudsman\nA small business entity can participate in the \nregulatory process and comment on enforcement \nactions of IRS by calling 888-REG-FAIR (888-\n734-3247), TTY/TDD 800-877-8339, or by visiting \nhttps://www.sba.gov/ombudsman.",
  "For General Information:\n\nAppeals Website:  \nwww.irs.gov/appeals \n\nIRS Website:\nwww.irs.gov\n\nIRS Toll Free Phone Numbers: \n800-829-1040 (for individuals) \n800-829-4933 (for businesses) \n800-829-4059 /TDD\n\nIRS Forms and Publications:\nwww.irs.gov/forms-instructions \n800-TAX FORM (800-829-3676)\n\nTaxpayer Advocate Service:\nTaxpayerAdvocate.irs.gov\n\n877-777-4778\n\n8"
]