[
  "\f\f\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nMP:  Yes. MP:  Yes. MP:  Yes. MP:  Yes.",
  "DT:  And, uh, have you had a chance to review all the transcripts and audio?",
  "DT:  Additionally were you provided with video from this incident which included \n\nOfficer Coleman  body-worn camera, Officer Trudeau and Coleman  in-car \ncamera, Officer Trudeau  body-worn camera and Officer Schmidt  body-worn \nand in-car camera as well as Officer Smith  body-worn and in-car camera?",
  "DT:  And did you review all the videos I just listed?",
  "DT:  A- are you familiar with Elk Grove Police Department  use of force Policy \n\nSection 300? MP:  Yes.",
  "DT:  In your review of all the related material for this incident, do you - did you observe \n\nany use of force as defined by department policy by any officer?",
  "MP:  In this incident, yes, I did.",
  "DT:  And can you tell me who and describe that force?",
  "MP:  Um, I saw Officer Schmidt use force, uh, four times during this incident.",
  "Um, you \n\nsaid the type of force?",
  "DT:  You could describe the force, the four incidents.",
  "MP:  Um, the first was the, uh, the kick to the head or stomp or, uh, however you \n\nwould, uh, best describe it, uh, and then he also, uh, kicked each arm.",
  "Um, he \nkicked his left arm, uh, once and I believe he kicked his right arm twice, so a total \nof four from what I saw.",
  "DT:  And did you observe or note any other force used by any other officer?",
  "DT:  As defined in our policy would these, uh, kicks by Officer Schmidt require a \n\nsupervisor  use of force Blue Team entry?",
  "MP:  No, I did not. MP:  Yes, it would.",
  "DT:  In the narrative of Officer Schmidt  report and during his interview with me, \n\nPage 4 of 18\n\n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nOfficer Schmidt describes why he kicked the subject Mendoza in the head.",
  "In \nyour opinion as a use of force expert, do you have any concerns about the force \nused by Officer Schmidt in regard to this?",
  "MP:  Yes, I do. DT:  Can you explain?",
  "MP:  Uh, Officer Schmidt  uh, first kick that he used when he kicked Mendoza in the \nhead, um, in my opinion was, uh, excessive and outside of policy.",
  "Um, there  a \nnumber of reasons why - he  - his - his reasoning, his rationale from his \nstatement, uh, was that he believed that Mendoza, uh, was, uh, trying to grab a \nfirearm from the bottom of his waistband with his right hand, uh, and he was in \nfear that he was gonna shoot Officer Coleman in the back.",
  "Uh, unfortunately \nthere are no f- there  no factual information in the entire call that would indicate \nthat Mendoza or, uh, Maka - uh, we  just stick with Mendoza  \na focus of - of what Schmidt  uh, use of force was, uh, were armed.",
  "Uh, there \nwas no mention at any time during the call that anybody had any weapons.",
  "In \nfact, the, uh, CAD report, um, states, um, that at 6 - on 6-5-19 at 2043 and 07 \nseconds in the CAD entry there was no weapons.",
  "Um, throughout the whole, uh, \nrest of the CAD report there was no mention of, uh, any weapons whatsoever, \nuh, by witnesses, by victims, by reporting parties, or even the officers on scene.",
  "So, um, one of the issues - or a- well, the - the most significant issue is that in \norder to, uh, justify, um, the force that Officer Schmidt used he has to have, uh, \narticulable, factual information based upon the circumstances that were provided \nto him durin  the call for service, uh, of the event.",
  "Uh, so basically there was \nnothing to indicate to Officer Schmidt nor the other officers that, uh, Mendoza \nwas actually armed, or there was a possibility, uh, out- uh, above just, um, a \nhunch or  \nmay be armed.",
  "Um, that is outside, uh, the, um, the - \nthe justification under Graham versus Connor of justifying his use of force, the \ntype of force that he used.",
  "Um - keep goin  \n\n  think,  uh,  \n\nI know that  \n\nDT:  Yeah.",
  "MP:  Um, uh, for the - some of the other issues that he - he had, uh, just s- specifically \n\nto the kick, uh, to his head, to Mendoza  head, um, if he - if his - Officer S- uh, \nSchmidt states that he was trying to, uh,  \nI think was the word that he \nused, uh, Mendoza, um, to, uh, see what - to get his arm out from under- \nunderneath him, that his right arm, because he did say he saw the left arm and to \nsome degree, and it didn  look like it was bothering him, he saw it was fa- there \nwas nothin  there but it was his right hand that concerned him because of the \nangle of his approach, of Officer Schmidt  approach to Mendoza.",
  "Um, the - \nsorry, I lost my  train of thought.",
  "Um, or I  sorry, where - where was I goin  with \nthis?",
  "Um... \n\nJS:  From the hand displacement.",
  "Page 5 of 18\n\n \n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nprobably two to three \n\nMP:  Yes, he - oh yes, the kick.",
  "So one of the issues with him using that type of, um, \nuse of force, the - a kick to someone  head, uh, any kick to someone  head is \nlikely to cause great bodily injury, uh, or possibly leading up to death.",
  "Um, I think \nit  absolutely reasonable that you can accept - you could expect someone to be \nknocked unconscious temporarily, even for a few seconds, which it looks like, \nfrom what I could tell in - in the video that that may have actually occurred to \nMendoza after the - the leg strike from, uh, Schmidt.",
  "Um, so tryin  to, um, to \nexpect that someone after a leg strike to the head is going to - you  going to \ngain compliance, further compliance after that type of use of force, uh, is - i- is \ncompletely - it  - it  irrational and it - and it  illogical and it  - and it  - it  \ncompletely misplaced.",
  "Um, because of the leg strike to the head, Mendoza \nappeared to me to be - he was kinda mumbling, i- what it sounded like in the \nvideo, he wasn  makin  a lotta sense for that, mmm, \nseconds, um, as Schmidt is then kicking out his arms.",
  "Um, it was evident that \nMendoza was not, um - he was not - his - his frontal lobe wasn  functioning, \nessentially.",
  "He - he - he - he had been knocked kinda silly, uh, it looked like his \nhead, uh, definitely hit the concrete after the leg strike because when he did get \nhit in the head or kicked in the head his head was elevated off the concrete and it \nwas then, uh, shoved, um, pushed, and it struck the c- the - the concrete \npavement right underneath him, um, and it looked like it hit around the temple \narea and I know that the kick appeared to hit somewhere near the back of \nMendoza  head, uh, which, um, is, uh, extremely susceptible to causing, uh, \nconcussions.",
  "Uh, and I know that just from, uh, my  own personal knowledge.",
  "Uh, \nany time, you know, playin  football or whatnot, and if you get, um, hit in the back \nof the head you  gonna - you  - you  - you  - you  gonna be seein  \nTweety Birds.",
  "So, uh, I could imagine the force that Schmidt used on Mendoza \nas he was laying down on the concrete face down, uh, and then getting the - the \n- the - I mean, essentially it caused two - two, uh, two, uh, you know, two injuries.",
  "Uh, one was the kick to the back of the head, which would be obviously - uh, \ncause some probably, uh, highly likely of, uh, you know, knock him kinda \nsenseless and then his head hitting the concrete, uh, also in the temple area, uh, \nis also gonna cause some - some issues, uh, with his, uh, his brain function, uh, \nat least temporarily, which it appeared to do so.",
  "Anything else, uh, any other \nquestions to follow up on so far?",
  "Uh, I can think... \n\nDT:  No follow-up but it just - finishin  off if there  uh, any other concerns you \n\nmentioned already, several, um - about the use of force.",
  "MP:  Yeah, so, um, some of the other concerns, uh, that I saw that, um, when Schmidt \narrived on scene, Mendoza has - he had already walked - he was - he was in the \nprocess of walking out of the store, walking toward Officer Coleman and \nTrudeau, walking westbound.",
  "He was shirtless, uh, he - all he had were - it \nlooked like lightweight basketball shorts on and shoes and socks.",
  "He, um, he \nwas carrying his black, or a black, t-shirt, um, in his hand, uh, it was - to me it \n\nPage 6 of 18\n\n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nlooked like it was pretty obvious he didn  have any other weapons in his hands.",
  "Um, I think the officers on scene it was obvious to as well because they never \nmentioned that he was armed.",
  "Um, uh, Mendoza  obviously a little overweight, \num, his belly is probably hangin  over his waistband do- to a little - to - to - to \nsome degree.",
  "Um, they never saw tha- thought that they saw somethin  that \nmight have resembled a weapon in his waistband or, uh, it was clear that they \ndidn  have any concern that he was armed because none of that ever got \ncommunicated to Schmidt or amongst each other, uh, i- durin  the call for service.",
  "Um, so when Mendoza exits the - the - the - the store, it  clear he  - uh, he \nstarts to walk, he, uh, doesn  initially comply with, uh, Coleman  uh, few verbal \ncommands he gives.",
  "Uh, I think Mendoza stated somethin  about, um, his hands \nhurting or he wasn  able to go down to his belly, he made, like, a - like, an \nexcuse that he had a medical condition or somethin  I - I - I w- I didn  quite make \nit out but then that  why it sounded like he balled his fists and he went down on \nthe ground and he laid there.",
  "Um, so i- at that point he was compliant.",
  "Um, he \nwas, uh, passively layin  on the ground, uh, his hands were, uh, down to his \nsides, uh, parallel with his body, um, and he - for the most part he was doing - \nwas - w- with - uh, he - he was doing is what he was instructed to do.",
  "The only \nthing that he didn  do, uh, which, uh, Coleman gave him commands was to put \nhis arms out to his sides perpendicular to his side, to his body.",
  "Uh, he said - I \nknow he said, uh, you know, like an airplane,  \nyour arms out so you look like \nan airplane,  and I know that, uh, Mendoza failed to do that.",
  "Um, but other than \nthat he was - he was compliant and he was, uh, typically in a position of \ndisadvantage, uh, and an advantage for the officers to be able to then, uh, slow \nthe pace down and, uh, communicate in terms of who was gonna cover who, \nwho was going to handcuff,  \nyou had, uh - Maka was much closer in - in f- \nin front of Mendoza.",
  "Um, he was, uh - uh, much closer to Coleman and Trudeau \nand then Mendoza was kinda split in the middle between Schmidt and - and \nColeman  vehicles as they were facing each other.",
  "Um... \n\nJS:  I- I  \n\nMP:  Sure.",
  "JS:  ...just gonna... \n\nMP:  Yup.",
  "position of a disadvantage. MP:  Mm-hm.",
  "JS:  Can you elaborate a little bit further on - you said that, um, Mendoza was in a pi- \n\nJS:  And then our - and the officers were in a position of advantage.",
  "Can you, um, \n\nelaborate a little bit on that?",
  "Page 7 of 18\n\n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nMP:  Yeah, so, um, when Mendoza was laying on the ground, um, we had - uh, we \n\ndidn  have physical control over him but we had, um, what you - you could \nmaybe refer to as - you - you had a - a - a verbal - verbal control as in the f- a- as \nin, he was - he was complying, uh, with all commands with the exception of not \nputting his hands out to his sides, uh, perpendicular to his body.",
  "Um, he wasn  \nstanding, he didn  take an aggressive stance, all indications were that he was \ncomplying with what we wanted him to do and there was nothing there to indicate \nthat he was gonna resist, he was going to, uh, attempt to flee, um, or he was \ngonna be combative.",
  "Uh, those would all - those would all be, uh, things that \ncould then o- would obviously change, uh, the tactics that the officer would use, \nthe officers would have used on scene had that been the case, but that was not \nthe case.",
  "Um, Officer Schmidt, uh, approached, uh, he approached, uh, \nMendoza from the rear where after he parked his patrol vehicle and then he was, \nuh, facing, um, Mendoza from Mendoza  left, uh, so he was perpendicular to \nMendoza off his left side, um, where Coleman and Trudeau were facing \nMendoza head on, uh, was still deal- dealing with, uh, Ma- uh, Maka, is - Maka \nwas, uh, facing - facing him as well.",
  "So they had two subjects, uh, cl- it was clear \nMaka was completely cooperative, he had f- he - he was - for all intents and \npurposes he w- he had submitted and he was ready to submit to arrest and \ndetention based on his body posture.",
  "Mendoza, uh, I would say was in the - i- \nwas in, uh, the same circumstance, same - same body position only with the \nexception that his arms aren  out to his side.",
  "Um, at that point the officers, uh, \nshould have slowed things down and communicated more effectively in terms of, \nlike I said before, who  gonna cover and who  goin  to handcuff, uh, the whole - \nthe whole - I know we talked about in the interview as well that his interview, the \nwhole contact and cover, um, concept.",
  "Uh, he - the way Schmidt explained it, uh, \nas he knew contact and cover was not consistent with how we train it, um, I know \nhe talked about the contact and cover was, uh, he said,  \ncovering, uh, Mendoza while Coleman was contacting Maka,  and that  not how \nwe train it.",
  "It  - it  - it  essentially a pair of officers per subject or suspect.",
  "Um, \nand had that been the case, which at that time they did have the amount of \nofficers to do that, uh, they had - at the time Trudeau and Coleman were on \nscene, uh, along with Schmidt.",
  "Schmidt could have, uh - and at this - i- i- in my \nopinion, he should have just held on, um, Mendoza, uh, he had lethal coverage \non him which was, uh, totally reasonable, uh, I don  have an issue with, uh, their \nguns bein  out given the circumstances, uh, there are some unknowns so, um, \nMendoza was - was down, um, he was, uh, for all intents and purposes he was \nbeing, uh, co- uh, cooperative. Um, Maka was, uh, same thing.",
  "Uh, Coleman and \nTrudeau, uh, should have - which they did, they started to cuff Maka - um, \nactually, I  not sure if Tr- Trudeau helped, I think she was - I think Coleman cu- \nuh, cuffed Maka, Trudeau kinda covered, uh, but at the same time that was \noccurring Schmidt then, uh, advanced on Mendoza and, uh, kicked him in the \nhead and - and - and - and, you know, under his, uh - by his statement s- s- with \nthe justification sayin   \n\nI couldn  see his right hand, I thought he was gonna \n\num, I was \n\nPage 8 of 18\n\n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\npull a gun out and shoot Dan Coleman in the back.",
  "Again, there was no \nindication that Mendoza was armed.",
  "Um, I know that he was basing his, uh, \nbelief, his assumption, off of the fact that, uh, there was one mention of, um, \ngang signs, potential gang signs, uh, in the CAD call, um, at 2043 hours, uh, 57 \nseconds in the CAD call.",
  "There  one mention of gang signs, um, by the RP  or \nwitnesses inside Burlington.",
  "Schmidt associates gang members with being \narmed.",
  "That  not an unreasonable assumption but the problem is is that yo- in - \nin all circumstances we can  just assume and think a- and believe just because \nsomeone is a potential gangster, uh, that they are all armed, and - and therefore \nit justifies a, uh, a - a use of force against them without any other articulable facts \nand circumstances to justify that.",
  "So the - the problem with what Schmidt did in \nthis case, in my  opinion, is that he - he inserted, um, a fact that was not true, \nmeaning he believed that just because they threw some gang size - gang signs, \none, that these were gangsters, two, that they were armed, um, and therefore he \nbelieved that they had an intent to shoot Officer Coleman or himself or Officer \nTrudeau or whoever else in that parking lot.",
  "All other indications would conflict \nwith that assumption and that belief by Officer Schmidt.",
  "Uh, again, we get back to \nwhat were the facts that he - what were the circumstances that he faced outside \nof that - his own personal belief, um, that they were armed?",
  "Again, you have \nMendoza who came out, he was, uh, he was being, uh, cooperative, he laid \ndown in a - in a position of, um, disadvantage and a s- you know, more or less a \nsubmission to our authority.",
  "Uh, again, yes, he wasn  complying with putting his \narms out to his side, um, but that still doesn  in and of itself justify the force that \nhe used to, um, force the hands out from his side so he can ensure that he didn  \nhave a weapon.",
  "There were other tactics he should have used and could have \nused other than a kick to the head, which as I talked about, is completely, um, \nillogical and il- unreasonable to think that a kick to the head is actually - you  \ngoing to actually gain further compliance, uh, from that subject knowing that a \nstrike to the head of any magnitude, really, is going to, you know, cause some \ntype of GBI, which under the - under, you know, the definition of GBI, it  a state \nof unconsciousness, would - would, uh, would fit that.",
  "Um, let  see, what else do \nI have here?",
  "Uh... \n\nJS:  Before you go on, Mike... \n\nMP:  Sure, go ahead.",
  "JS:  ...you - you had talked about, um - so what other tactics were available to Officer \n\nSchmidt at that time?",
  "MP:  So the best thing that, uh, Officer Schmidt - I think w- I think I - I kind of touched \non it, wha- what should have happened is Officer Schmidt should have held his - \nheld his position at that tree where he was perpendicular to, uh, Mendoza, \nessentially looking at the left side of his whole body.",
  "Uh, and he had him at \ngunpoint, um, he couldn  see his - his right hand, um, but you had Coleman and \n\nPage 9 of 18\n\n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nTrudeau who were to the front of him, uh, who could see straight down, uh, \nMendoza and were able to see, uh, both hands.",
  "Uh, maybe not to great detail but \nthey would able to s- be able to see if there was any - if he was really reaching, \npossibly reaching for, uh, you know, a weapon and had he presented it, uh, they \nhad enough distance as well where, uh, their reaction time would have probably, \nuh - uh, allowed them to, uh, acquire cover and return fire had that even \nhappened.",
  "Schmidt should have stayed at cover, he should have, uh, kept, uh, \nMendoza at gunpoint, kept giving him verbal commands to put his hands out to \nhis side.",
  "Uh, he could have warned him that he was going to, uh, use his Taser, \nuh, even a bean bag, um, uh, strike to, uh, to - to gain compliance if he did not, \nyou know, give him the opportunity to comply with, uh, fa- wi- you know, with, uh, \nthe caveat of,  \nand then Coleman and Trudeau should have cuffed up Maka, and then once that \nwas done then they could then focus on Mendoza.",
  "Unfortunately that didn  \nhappen and Schmidt committed, he put himself in a - in a - in a position to \ncommit to taking action on Mendoza for, uh, really a - a - a reason that there was \nno, uh, factual basis for.",
  "Does that answer your question, Jeff?",
  "if you don  comply this is what could happen to you.",
  "Um, \n\nJS:  Yes, mm-hm. MP:  Okay. JS:  All right.",
  "DT:  And then, uh, any other concerns regarding the use of force that you haven  \n\ncovered yet?",
  "And we  talking specifically to the head, to his head?",
  "MP:  Um, yeah, no, um, you know, prior to Officer Schmidt, um, as he made his \n\nain  gonna be a good \n\napproach to Mendoza, um, he made the statement,  \nday for you, son,  quote.",
  "Um, and then right within a second or two after that, um, \nhe strikes the, uh, the, uh, he strikes Mendoza in the head with his f- with his - \nwith his - with his foot.",
  "Um, I don  know, I wasn  there to read his mind but that \ndoes maybe, um, uh, imply some maybe possible intent with the intent - I don  \nknow what he meant by that statement.",
  "Uh, I know in his - his, uh, statement, uh, \nduring his interview, IA interview, he regrets the statement and he understands, \nuh, it was unprofessional, uh, but he made it and I think it probably, uh, infers a \nmental state where he was - uh, Schmidt was at a level that was beyond what \nwas necessary, uh, or reasonable given the circumstances they were dealing \nwith at the time.",
  "Um, so, uh, i- there  that. Um, like, he - talk about the - \nimmediately after searching, uh, he didn  do that, is - I could talk... \n\nDT:  We- we  get to that in a sec.",
  "MP:  Okay, okay. Um... \n\nDT:  And then anything else to finish off regardin  the...",
  "Page 10 of 18\n\n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nMP:  The - the strike?",
  "DT:  Yeah. MP:  Uh, not at this - um, no.",
  "No, nothin  nothin  \n\nDT:  And you mentioned you saw three uses of force in regards to kickin  away \n\nMendoza  hands or arms.",
  "Did you have any concern with any of those strikes?",
  "MP:  No, I - I - I - I found the - him, um - I would - those - the strikes to the - to \n\nMendoza  arms, um, although, uh, would constitute a use of force I - I - I thought \nthey were fairly minor in nature.",
  "Um, he was more - he didn  stomp on the arms \nlike he did - appeared to me he didn  stomp on the arm or actually kick the arm, \num, like he did with, uh, Mendoza  head, which was clearly a kick or strike or \nstomp in my - in my opinion, from what I saw, uh, versus the arms which more \nlook like he was tryin  to, um, sweep the arms out from underneath Mendoza to \nget them out to be perpendicular to his body.",
  "So I didn  have any issues with the, \nuh, the - his - the - the use of force to Mendoza  arms.",
  "In fact, I would - I would \nargue that that  probably what he shoulda done if anything, if he did approach \nhe shoulda never kicked him in the head and he probably coulda mitigated the \nentire thing just by doing what he did at the end, if he had just skipped the - the \nstrike to the head and went right to sweeping the arms out, we probably wouldn  \nbe sittin  here right now.",
  "DT:  The movement of him sweepin  the arms out versus kickin  the head, um, is there \n\n- tell me the difference between how would one cause GBI and what sweepin  \nthe arms - possibly cause any injury or not, as likely to cause injury?",
  "Can you \ntouch on that? MP:  Yeah, so - so again, we talked to the - again, just to- mentioned it, so the - the - \n\nthe - the - go back to the head.",
  "The head was, from - from what I saw in the \nvideo, to me it was clear it was a - and - and even Schmidt even says he - he, uh, \nhe tried to shove, \nhe - he shoved - he, like, he wanted to use the word  \nuh, the - the suspect  uh, Mendoza  head, uh, to displace it.",
  "Uh, sh- still not \nclear on what he - what he means by the word  \nbut, um, he, um, he \nused the - uh, it appeared to - the - no, the bottom of his boot, um, to strike \nMendoza  - and o- it - it appeared, it looked like it might have just barely glanced \noff Mendoza  uh, you know, left shoulder area and then, uh, when into, uh, his \nhead, it wasn  clear.",
  "It - it - it might have occurred, if it did it was - wasn  clear in \nthe video to me.",
  "Uh, either way, um, he - the boot clearly struck Mendoza  head, \num, and again, as I talked about, any strike to the head by a leg is gonna cause - \nlikely to cause GBI.",
  "Um, uh, and - and more - mostly, at least probably, uh, to the \nstate of un- unconscious, uh, or a d- a very dazed, confused, uh, state.",
  "Um, the \nlegs appeared to me, he didn  come down on a s- uh, as a s- in a stomping \nmanner, uh, like, ele...",
  "Page 11 of 18\n\n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nJS:  You mean the arms or legs?",
  "MP:  I  sorry, the - I  sorry, the - I  sorry, the arms, I  sorry.",
  "JS:   \n\nMP:  Um, the arms didn  appear to me that his motion that he used with his - with - \n\nhe had his handgun in his hand.",
  "Um, he was using his feet to, uh, \n\nwith Officer Schmidt  own legs, it didn  look like he was stomping on Mendoza  \narms.",
  "It - it appeared to me he was, uh, tryin  to, uh, push them out by using his \nfeet  \nsweep them out from underneath, uh, Mendoza  side or from the sides of \nMendoza as he was laying there to get them out to - in the d- in the position that \nhe wanted them.",
  "So I didn  see any type of stomping to Mendoza  legs, I didn  \nsee a kick like you would, uh, kick a ball or a soccer ball or somethin  of that \nnature.",
  "Uh, to me it looked more like he used his feet as a - as a tool to create a \nwedge to pry the - the - the arms open from the sides, uh, to get them in the \nposition that he wanted them.",
  "DT:  You already mentioned, uh, your concern, right, about Officer Schmidt  tactic of \nnot maintaining cover a- at the tree, and that - do you believe that he engaged in \nany other tactics which created an exigency resultin  in less time to decide on the \nproper level of force or tactics that necessitated a use of increased level of force?",
  "MP:  Um, yeah, obviously I think had he stayed at the tree, uh, we - again, we \n\nprobably wouldn  be sittin  here right now.",
  "Uh, however, the mistake he made \nwas, uh, approaching and engaging Mendoza, uh, because what he did is he \nthen - he essentially, he put - Schmidt put himself in a position where, um, he \nwas going to have to use some type of physical force to get control of Mendoza, \nuh, be- uh, you know, and again, based upon what Schmidt n- thought he had a \nhandgun, um, he used force, uh, to try and f- uh, determine whether or not he \nwas armed or in his - like Schmidt said, he thought that he was gonna shoot \nColeman in the back so he believed that, uh, a leg strike to the head would, um, \nget Mendoza to further comply so he could see his, uh, what was in his right \nhand,  \nto make sure it was clear of a handgun.",
  "Um, yeah. I know that was what - he wanted to see what was in that right hand \n\nDT:  In, uh, Officer Schmidt  statement to me he stated, uh, it wasn  realistic in this \n\nsituation for him to warn Officers Coleman and Trudeau about Mendoza  \nperceived hand movement near or around his waistband or pocket area.",
  "Um, and \nif you need to, we  refer to Schmidt  transcript on pages 98 through 100 if that \nwould help, but I was gonna ask you, did you have any concerns about, uh, this, \nuh, Officer Schmidt not warning Coleman or Trudeau?",
  "MP:  Yeah, I - I - I - I - I re- I do recall that, uh, specifically, uh, what he - what he \nstated about, um, he didn  believe, um, he had the time to, uh, to warn, uh, \nTrudeau or Coleman, um, which, uh, I find, uh, a lot of, uh - uh, well, that \n\nPage 12 of 18\n\n \n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nstatement, I think, uh, illustrates a lot of the issue with this case and - and why it \ngot to the point that it did, uh, because Schmidt, um, decided to move at such a \nrapid pace and not slow down, which is what needs to happen on, uh, incidents \nsimilar to this.",
  "Communication is always key. Uh, we talked about earlier about \nall the incident debriefs that I attend, uh - uh, for, uh, uses of force and - and \nSWAT tactics and incidents, uh, that involve, uh, you know, deadly force, um, or \nless lethal force.",
  "The breakdown is always communication, always, always, \nalways.",
  "Somewhere along the line, had better communication been used so \npeople are informed about what actual factual information is occurring they can \nprocess that much, uh - they can process that and come up with a better decision \nand use better judgment.",
  "The fact that Schmidt decided not to tell them, I think, \nplayed a huge role in this issue, um, escalating much faster and Schmidt  \ndecision-making to take care of it on his own.",
  "Uh, had he told Coleman and \nTrudeau that it looked like he was reachin  for something then I believe, hopefully \nwhat would have happened is they would have slowed down, they would have, \nuh, used much better contact and cover tactics.",
  "Um, they - they could have even \n- I - I know that, you know, Maka was close to Trudeau but he was - appeared to \nbe, you know, very compliant, uh, they had plenty of time for what they had to \nwait for additional units which were on the way.",
  "Uh, there was no reason to, uh - \nuh, rush to cuffing both individuals, as they were proned out, uh, on the \npavement face down.",
  "Um, so for all intents and purposes they were - they were \nbeing - they were submitting to arrest and/or detention.",
  "Um, by not \ncommunicating what Schmidt saw and then it just escalated and, um, it s- it sped \nup the entire event, uh, much faster than it needed to, and I think it resulted in \nwhat - what occurred.",
  "DT:  You mentioned Schmidt  concern about, uh, Mendoza  right hand and you \nmentioned a proper tactic as trained would be to stand by the tree.",
  "Um, was \nthere an option for him to move to where Officer Coleman and Trudeau was at \nthat time?",
  "MP:  Yeah, a- absolutely. I mean, th- he didn  have to stand there, and this all goes \nback to the communication phase.",
  "They could have, uh - one, probably the best \nthing they coulda done was probably wait for another unit, um, before they - they \ndid anything, um, so they had additional officers, so you could at least had \ncontact/cover, a pair of officers on each, uh, of - of the subjects, on Maka - two \non Maka and two on Mendoza.",
  "Um, but even if they didn  decide to do that then \nthat  fine, Schmidt could have, uh, moved to where Coleman and Trudeau were \nand helped them - and he could have covered down, uh, Mendoza from behind \nthe two patrol cars that which were Trudeau  and Coleman  Um, was there - \nright, were there - there were - yeah, there was two patrol cars.",
  "They we- ye... \n\nDT:  And on this call Officer Coleman and Trudeau were doubled up.",
  "MP:  They were doubled up. Page 13 of 18\n\n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nDT:  Yes.",
  "MP:  Oaky, I  sorry, that  right.",
  "So they coulda - he could have used their patrol car, \ntheir single patrol cal- car as cover to cover down long on Mendoza.",
  "This would \nhave, one, slowed things down, two, it would have given, uh - uh - it would \nincrease the distance, uh, from Mendoza to the officers, um, so, uh, it woulda \nbeen much more difficult for Mendoza to, uh, to track the officers if he were \nactually to - want to engage them a- and shoot them, uh, which Schmidt thought \nthat that  what his - his plan was.",
  "If that truly was what he thought was gonna \nhappen, um, he was much better off getting to a place of hard cover, uh, behind \npatrol cars and holding him from gunpoint there, uh, and then coordinate with \nincoming units in terms of how they were going to address that possible threat.",
  "If \nthey really thought that he was armed, um, you know, a bean bag shotgun \nwoulda been appropriate, um, uh, because again, they didn  - he didn  - he \nthought he had a gun but he was - you know, what he we- whatever he was \ndoing making some, uh, some movements in his waistband area, uh, a bean bag \nshotgun, uh, woulda been appropriate to - to get Mendoza to comply further with \npa-  \nbeen justified, um, to some degree.",
  "But, um, yes, moving to the front of the patrol \nvehicles was definitely an option that they should have thought about and \nemployed. your arms out to your sides.",
  "Um, even a Taser, uh, yo- yo- may have \n\nDT:  In your - in your opinion do you have any concerns about Officer Schmidt leaving \nMendoza unsearched, who Officer Schmidt stated he believed to be armed and \ninstead enter Burlington to search for possible victims and/or the outstanding \nthird suspect? MP:  Yeah, I do.",
  "I, um, I - the - I- during the body-worn cameras, uh, or durin  the \n\ncameras I reviewed, it - it - it turned out to be - so once, um, Schmidt, uh, used \nforce against Mendoza he then, uh, handcuffed him and he, uh - Mendoza was \ncuffed at, uh, one minute and 45 on Schmidt  - accordin  to Schmidt  body-worn \ncameras, uh, one minute and 45 seconds into the video.",
  "Um, Schmidt leaves, \ntells one of the officers to watch Mendoza at 1:53.",
  "Schmidt comes back out and \nfrom Burlington, confirming no one else was inside, and then kinda stands \naround a little bit and then s- uh, actually finally then does search Mendoza.",
  "So \nfrom my calculation it was a minute and 21 seconds that went by, that transpired, \nuh, from the time that, um, Mendoza was cuffed and the time that he was finally \nsearched.",
  "And at that time Mendoza essentially was unsecured, he was \nhandcuffed but he was - there was not an officer, uh, solely focused on him.",
  "Um, \nColeman was kinda running back and forth dealing with Maka, putting out radio \ncalls  \nthere was a third that had left in a vehicle, um, so he was puttin  out information \nfor that, he was, uh, telling other units, you know, guiding them and giving them, \nuh, information and guidance, uh, as they came on scene.",
  "Um, when Schmidt left \nMendoza, I didn  see any even attempt to confirm that Mendoza had any \n\nthey thought there mighta been a third - or he- they believed that \n\nPage 14 of 18\n\n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nweapon in his waistband, which I thought was odd.",
  "Um, typically you see, and \ngiven my own experience being in situations similar to this, and, um, thinking that \nsomeone  armed, usually the first thing that you do after you think that they  \narmed, uh, and you get them detained, whether or not you use force against \nthem or not is you go to their waistband or where you thought that they were, uh, \ntrying to, uh, you know, acquire a weapon, whether it be a handgun or knife or \nwhatever it was, um, even after they  cuffs, just typically generally, from my \nexperiences, all the use of force visi- videos I  ever watched, uh, officers will, \nuh, unconsciously, I think, go to that area of concern.",
  "Schmidt never did that, yet \nit was so important for him to use this force because he so adamantly believed \nthat Mendoza was going to shoot Officer Coleman in the back or anybody else, \nthe first thing he does after he handcuffs him is he stands up, Schmidt, or he - he \n- he was already standing up but he, you know, he stands erect, he looks around, \nand then he runs into Burlington Coat Factory to make sure nothin  else is goin  \non.",
  "Um, I found that completely, uh - uh, out of place and not consistent with \nother officers  behavior that I  seen on the dozens of use of force videos, my \nown experience, my own training.",
  "Uh, I know the - the - the first thing we teach \nofficers once they do detain somebody in handcuffs is, do a quick Terry search, a \npat search.",
  "If you  not gonna do a - a - a complete, full search of someone \nbecause there are some rapidly evolving events occurring but you need to make \nsure you - you at least do that pat search.",
  "Officers - or I  sorry, uh, just because \nwe put someone in handcuffs doesn  mean they - they can  acquire weapons.",
  "Uh, there  been just numerous instances across the nation where people who \nare handcuffs have slipped cuffs, uh, they  uh, very nimble and they  very, \num - um, uh, um, uh, bendable flexible where they  able to maneuver their \nhands across into their waistband, uh, to the front, they can put the - put their \ncuffs i- in - uh, move their cuffs from underneath their - their back to their front.",
  "So searching someone immediately after detention in handcuffs, uh, is key, and I \nthought it was interesting, uh, and out of character, uh, and inconsistent is \nprobably the best word that I could say, uh, with everything that I  seen where \nif Schmidt was so de- uh, f- um, concerned about Mendoza having a weapon, in \nthis case a handgun, why didn  he immediately do a quick waistband search of \nMendoza?",
  "basketball shorts on, it was clear, it was a hot - it was June so it was - it was a \nhot day out.",
  "Um, I think a really quick - he probably could have, um, swept that \nwaistband area and determined if there was a weapon in less than five seconds if \nhe actually had a handgun, that he woulda - he would have found it immediately \nif he actually was armed.",
  "But he didn  and he ran inside the store, uh, you know, \nthe- and the other thing with that too is that while all this was goin  on there was \nno evidence that I found that the people from inside the store were saying,  \nthere  someone else inside, we  be- the fight is still occurring, we need help \ninside,  that never happened.",
  "Uh, there was no - Dispatch never notified, uh, \nI know the officers, you know, when you  focused and you  tryin  to \n\nhe didn  have a shirt on and he had some f- uh, floppy \n\ngive commands to people sometimes, you know, we could - we - we - we  very \n\nPage 15 of 18\n\n \n \n \n \n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\ndif- it  very difficult to multitask and he- and hear, if you  tryin  to give \ncommands yo- you - your brain automatically will shut off, uh, the input that  \ncomin  in from - from Dispatch, so it  hard to hear those things.",
  "So if you give \nhim the benefit of the doubt that they didn  hear those things and he runs into the \nstore, confirms no one  in there, he still comes out and Schmidt stands around, \nkinda looks around, there was no sense of purpose from his body actions that I \nsaw that would reaffirm his a- his - his concern that Mendoza was armed.",
  "DT:  And based on the facts as you know them, do you believe the level of force \nutilized by Officer Schmidt was within the department  use of force policy?",
  "MP:  No, I do not. DT:  And I know you touched upon it but can you explain?",
  "MP:  Yeah, again, um, the - I think probably the - the kick to the head, I - I would go \n\nback and reiterate that if Schmidt  intent was to see what was in - see what \nMendoza was doing with that right hand, um, the last thing he should have done \nwas kick him in the head.",
  "Uh, and I base that on the fact, as I stated before, that, \num, it  uh, completely reasonable to expect that a le- a leg strike, a leg stomp, a \nleg kick to someone  head is going to cause - is - is very likely to cause GBI, or \npossibly even death depending on the - you know, the - the - the impact of the \nstrike, uh, and then of course any preconditions that we  unaware of of the - of \nthe subject as well.",
  "Um, you can  expect someone to comply if they don  have \nthe mental capacity any longer because they  so dazed, confused, they  \nunconscious, um, they  dizzy, they  still tryin  to get their bearings or whatnot \nafter a leg strike, to be able to cognizantly understand and hear and process \nverbal commands by anybody.",
  "Um, so if his intent was to, uh, grab or was to get \nthe, uh, the, um, his right hand visible so he could confirm he didn  have a \nweapon, a leg strike was, um, absolutely, uh, unreasonable.",
  "Further, his - that \nleg strike - well, back up, Mendoza was, like we talked about before, being \npassively compliant, the only thing - again, he just was not putting his hands out \nto the side.",
  "Although that is a form of non-compliance, it did not reach - it does \nnot justify the level of force that Schmidt used, a kick to the head.",
  "If Schmidt \nwoulda - I - I would - I would have been perfectly fine if Schmidt would have went \nup and probably kicked Mendoza in the lower leg, I - I - I wo- I woulda said that \nwould be reasonable, um, not bein  able to see that - and I - I don  mean f- goin  \nup like a soccer kick where you just tee off on the - on the guy but, you know, a - \na - a - you know, a kick to - to get the - the suspect  uh, attention, uh, to let him \nknow that, hey, you know, do as I  tellin  you.",
  "Um, that woulda been more \nreasonable than a kick to the head.",
  "The - the kick to the head was completely, uh \n- uh, unreasonable given the circumstances.",
  "Uh, there was no factual information \nin the call to justify what Schmidt  belief was that Mendoza was armed.",
  "DT:  Lieutenant Scott, do you have any further questions?",
  "Page 16 of 18\n\n\fADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nJS:  No, just in addition to what you just, um, ex- explained, you provide a lotta other \n\ndetail, um, and the detail that you provided in this interview is also, um, your \nreasoning why the use of force was not within policy?",
  "MP:  Correct. JS:  Okay. MP:  No.",
  "DT:  All right, do you have any questions for us?",
  "DT:  You have any comments you wanna add for clarification? MP:  Uh, no, I don  think so.",
  "JS:  Um, Officer Coleman  \n\nDT:  Tha- that was covered earlier. JS:  (Unintelligible).",
  "DT:  I just wanna clarify, I asked you if, uh, if you observed any use of force and you \n\nstated only Officer Schmidt  You didn  see any other officers such as Officer \nColeman use force?",
  "MP:  No, I - I know - I know the - what you  referring to, the, um - when Officer \nColeman, and I believe that was - actually occurred when Schmidt was in \nBurlington Coat Factory after he had cuffed him... \n\nMP:  ...uh, Coleman then ran over to Mendoza, um, and was kinda hovering over him \nand - and Mendoza had sat up in a - in - in an erect position, um, and Coleman, \num, kind of, um, you know, nudged him with his knee and co- and Mendoza just \nkinda fell back over onto his side.",
  "That was not a use of force. DT:  And is there anything I did not cover that you would like to address regarding this \n\nMP:  Um, I don  think so.",
  "Let me just review my notes real quick.",
  "Yeah, no, that  all I \n\nJS:  All right, uh, Lieutenant Press, as a representative of the chief of police I  giving \n\nyou a direct order not to discuss this interview or this ongoing investigation with \n\nPage 17 of 18\n\nDT:  Mm-hm.",
  "DT:  Okay. JS:  Okay. investigation? have.",
  "ADMINISTRATIVE INTERVIEW LT. PRESS \nIA 19-024 \n\nanyone else except legal representatives of your choice until final departmental \nresolution.",
  "Do you understand? MP:  I do. DT:  This interview is concluded at 11:40 am.",
  "- INTERVIEW CONCLUDED - \n\nPage 18 of 18"
]