[
  "MINI-SYMPOSIUM: RESEARCH\n\nHow to design and use a\nresearch database\n\nSimon S Cross\n\nIan R Palmer\n\nTimothy J Stephenson\n\nAbstract\nThe vast majority of histopathology research projects based on a se-\nries of tissue samples will require a database to store and organize the\ndata.",
  "Most of these databases will be relatively simple standalone da-\ntabases that can be created in a spreadsheet application.",
  "However,\nthere are still some important considerations in the design of the data-\nbase and coding of the data that will make its subsequent use much\nmore time efﬁcient.",
  "This article reviews the scope of databases for\ncommon histopathology research projects, the ethical and legal con-\nsiderations, design of the database structure, coding of data items,\nand import and export of data from databases.",
  "Keywords anonymization; databases; histopathology\n\nIntroduction\n\nMost research projects need some method for recording and\nordering data.",
  "Sometimes this may be a complex system that\nautomatically links with other data sources, but in most cases it\nwill be a relatively simple standalone database for a single\nresearcher to maintain their research data.",
  "However, even though\nthis level of database may be relatively simple, it is still very\nimportant to give some thought to its design before starting to use\nit, as a well-designed database will make analysing results much\neasier, and a poorly-designed database can lead to much wasted\ntime which may even extend as far as having to re-enter data.",
  "What sort of database does your project need?",
  "At the start of a research project you need to make a simple\nassessment of what your database will need to do.",
  "If your\ninvolving\nresearch project\nseveral different centres and which requires data to be entered by\nseveral different personnel, then we hope you have budgeted for\n\nis a randomized controlled trial\n\nSimon S Cross MD FRCPath is Professor of Diagnostic Histopathology\nat the University of Shefﬁeld and an Honorary Consultant\nHistopathologist at Shefﬁeld Teaching Hospitals NHS Foundation,\nUK.",
  "Conﬂict of interest: There is no conﬂict of interest.",
  "Ian R Palmer BSc is the Faculty IT Manager (Medicine, Dentistry &\nHealth) and Faculty IT Liaison Corporate Information and Computing\nServices at the University of Shefﬁeld, Shefﬁeld, UK.",
  "Conﬂict of\ninterest: There is no conﬂict of interest.",
  "Timothy J Stephenson MA MD MBA FRCPath is a Consultant\nHistopathologist at Shefﬁeld Teaching Hospitals NHS Foundation\nTrust and Honorary Professor at the University of Shefﬁeld and\nShefﬁeld Hallam University, Shefﬁeld, UK.",
  "Conﬂict of interest: There\nis no conﬂict of interest.",
  "a dedicated database manager in your research grant because\nyou will need them!",
  "Such a database is well outside the scope of\nthis paper.",
  "A more tractable project might be something like a\nnumber of different immunohistochemical stains performed on a\nretrospective series of 500 cases of breast cancer with histo-\npathological data (such as tumour size, grade, lymph node sta-\ntus) and clinical follow-up (e.g.",
  "time to last follow-up, recurrent\ndisease, death not due to breast cancer, death due to breast\ncancer).",
  "A database for a project such as this would be a\nreasonable proposition for a single researcher, such as a histo-\npathology trainee working on an PhD degree, and is the scale\nof database that we use all the time in our projects.1\n\nAnonymization, ethical and legal considerations\n\nAny research database should be anonymized to the highest level\nthat is compatible with the viability of the research project.",
  "The\nrecent high proﬁle cases in the media highlighting data losses by\nGovernment agencies has shown how easy it is for data in some\nformat (laptop, hard drive, data stick, and more recently insecure\nserver etc.)",
  "to be lost or stolen.2 It is likely that you will be\nmoving your data around between computers and it is probable\nthat you will be using a laptop computer, so for security con-\nsiderations alone the database should be anonymized.",
  "Any\nresearch project will require local ethics committee approval, and\nmost ethics committees are rightly concerned about the trans-\nmission of personal medical data and usually insist that any\nresearch databases are anonymized.",
  "There are two main methods of anonymization e complete\nand linked.",
  "The most secure is complete anonymization where\nthe clinicopathological data are taken from their original source\nand entered into the research database with no linkage at all\nbetween the two.",
  "If all personal identiﬁers are excluded from the\nresearch database, then there should be no way of systematically\nidentifying patients from the data held in the research database (it\nshould, however, be noted that it might be possible to identify\noccasional individuals if they have very distinctive characteristics,\ne.g.",
  "a 16-year-old female living in city ‘x’ who was diagnosed with\nbreast cancer).",
  "The advantage of a totally anonymized database is\na lowering of the risk should it be lost or stolen.",
  "It obviously re-\nduces the risk of identiﬁcation of individuals to close to zero, but\nit does not eliminate the risk of media coverage should the lost\ndata be found somewhere inappropriate (the local newspaper\nheadline ‘Cancer patients’ data found on memory stick in car\npark’ could still be applied whether the data were anonymized or\nnot).",
  "The major disadvantage of a completely anonymized data-\nbase is that it is a static database that cannot be updated later if\nthere is a need for further data input.",
  "This may not be a problem\nfor many histopathology research projects (e.g.",
  "novel immuno-\nhistochemistry on a series of tumours) but is obviously not\ncompatible with projects with continuing patient follow-up.",
  "In linked anonymization there is some system that links the\nresearch database to identiﬁable patient data.",
  "One method of\nlinkage is to have a separate secure database that acts as a key\nbetween identiﬁable data records and the anonymized research\ndatabase.",
  "Such a database does not need to be electronic; it could\nsimply be a book with two entries on each line e the identiﬁable\ndata and the anonymized research accession number (often\nknown as the study number).",
  "Such a book could be kept securely\n\nDIAGNOSTIC HISTOPATHOLOGY 24:4\n\n149\n\n(cid:1) 2017 Published by Elsevier Ltd.\n\n\fMINI-SYMPOSIUM: RESEARCH\n\nlocked in a ﬁling cabinet in a locked ofﬁce and access could be\nrestricted to a few named individuals involved in the research\nproject; often it will be a single named individual whose sole\npurpose is to provide linkage if requested.",
  "However, this method\ninvolves setting up a separate administration system with its own\nsecurity issues.",
  "A much simpler method is to use some identiﬁer\nwhich is not identiﬁable without access to some existing infor-\nmation system.",
  "This could be the patient’s hospital number but\nmany ethics committees regard this as relatively insecure\nbecause the patient’s hospital number could open access to a\nwhole range of information in many different hospital informa-\ntion systems (and the patient’s NHS number is even less secure\nand more informative).",
  "In histopathology we are fortunate in\nhaving the laboratory accession number which is a restrictive\nsuperﬁcially-anonymous identiﬁer that is only available to those\nwith access to the laboratory information computer system, and\nthat system is already heavily protected by individual password\nlogin, automatic timing out of terminals after a short period of\nnon-use, etc.",
  "If we are conducting a research study on archival\ndiagnostic surgical material, then we will probably be using\nslides labelled with the laboratory accession number and we are\nunlikely to anonymize that number because of the slide labelling\nproblems it would cause.",
  "At present the ethics committees that\nwe have passed applications through have been happy to use the\nlaboratory accession number to anonymize the samples and data\nin studies, although they have always required a statement on\nthe circumstances in which the investigators would go back to\nthe laboratory information system for more data.",
  "Such consid-\nerations always have to be made for any research project and are\nnot exclusively a feature of research databases.",
  "It still needs to be appreciated that simple personal data, such\nas name and address, are not the only items that can identify an\nindividual.",
  "The date of birth is quite a speciﬁc item and com-\nbined with other items in a database (e.g.",
  "a woman with breast\ncancer diagnosed in 2002) could provide a strong indication of an\nindividual’s identity.",
  "It is usually better to change the date of\nbirth to a less speciﬁc age datum at the time of entering infor-\nmation into the database; age at diagnosis will probably give all\nthe information that is required.",
  "It should be noted that even when a database has been\n‘anonymized’ using relatively opaque linkage items, such as the\nlaboratory accession number, it is still not completely anony-\nmized because links can be made indirectly which could iden-\ntify the patient.",
  "Although this linked ‘anonymization’ will mini-\nmize the adverse effects of any data loss or unauthorized access\nto the data, the database is still legally regarded as personal data\nunder legislation such as the UK Data Protection Act.3,4 Under\nthis Act, only data essential to the study can be collected and they\ncan only be stored for as long as the study is active.",
  "This brings us to legal consideration as whether the database\nneeds to be registered under the terms of the Data Protection Act\nin the UK, or similar legislation in other countries.",
  "If there is no\nlinkage possible at all between the research database and per-\nsonal patient data, then it would not need to registered, but since\nthe act of creation of the database will involve some access to\npersonal data, then we would suggest that it does need regis-\ntration.",
  "In most UK institutions this is a simple process because\nthere will be an institutional Data Protection Ofﬁcer and the\ninstitution will be registered with the Government’s Information\n\nCommissioner, which will usually give generic registration for\ndatabases in that institution without the need for the registration\nof individual databases.",
  "However, you would need to check the\ndetails of your institution’s processes.",
  "A further medicolegal consideration is the duty of disclosure\nthat could occur if review of a case with identiﬁable data showed\nthat there was a misdiagnosis or mistreatment, e.g.",
  "if review of a\nseries of cases of mesothelioma showed that one of the cases\nappeared to be mesothelial hyperplasia rather than mesotheli-\noma.",
  "If there is complete anonymization, then this cannot apply.",
  "If there is linked anonymization, then it could apply and this\nneeds to be considered before the study commences.",
  "In most\nhistopathology research studies, the tissue being reviewed is only\na sample of the whole diagnostic material available on the case,\ne.g.",
  "a single block of breast cancer, so a full diagnostic review of\nthe case is not being carried out.",
  "The tissue is also being exam-\nined in a research context, e.g.",
  "a single core of tumour in a tissue\nmicroarray, where it is possible that there could have been some\ntransposition of laboratory accession numbers or rows and col-\numns in a spreadsheet and the risk of misidentiﬁcation would be\nslightly higher than in a fully functioning diagnostic histopa-\nthology laboratory.",
  "For these reasons, we include a statement in\nour ethics committee application stating that any discoveries are\nfor research purposes only and that there will be no retrograde\nﬂow of information back to patient records or individual patients.",
  "Design your database\n\nThe design of your database should reﬂect the design of your\nresearch project and it would be better to have all your aims and\nobjectives of the project clearly formulated and recorded before\nyou start to design your database.",
  "Sometimes, however, design of\nthe database and general objectives of the research project emerge\nconcurrently.",
  "A good way to design your database is to take a blank\nsheet of A3 paper and sketch out all the data items you think you\nneed in a ‘spider’ (or ‘mindmap’) diagram with clusters of related\nitems.",
  "This gets you away from a computer screen and a form\nformat, and allows you to look at all the data items with an over-\nview.",
  "It is worth spending some time doing this, possibly redraw-\ning the diagram if it becomes too cluttered by changes, because this\nis the most important stage of database design and time spent on\nthis stage will pay major dividends later in the process.",
  "You need to arrive at a design with all the data items that are\nessential for your project but no more than that.",
  "If you do not\ninclude essential data items at the start of the process, you will\ndiscover their absence later and then need to modify the database,\nand you may have to go through all your original data sources to\ninput the missing items.",
  "It is usually best to include individual raw\ndata items and use them to calculate derived data items within the\ndatabase.",
  "An example in breast cancer would be the Nottingham\nPrognostic Index.",
  "If you only include the Nottingham Prognostic\nIndex in your database as an aggregate measure of the potential\nprognostic behaviour of the tumour, then you will not have access\nto the tumour size, tumour grade and lymph node status in future\nanalyses.",
  "If you include those three items separately, then you can\ncreate a fourth derived data item that will automatically calculate\nthe Nottingham Prognostic Index from these items.",
  "If you only\nrecord axillary lymph node status in a case of breast cancer as\npositive or negative, then you will not have access to the total\n\nDIAGNOSTIC HISTOPATHOLOGY 24:4\n\n150\n\n(cid:1) 2017 Published by Elsevier Ltd.\n\n\fMINI-SYMPOSIUM: RESEARCH\n\nnumber of positive lymph nodes, whereas if you record the total\nnumber of positive lymph nodes, you will be able to create\nanother automatically derived data item for overall lymph node\nstatus.",
  "The general rule is that data items cannot be split at a later\nstage, but they can be easily, and automatically, aggregated later,\nso it is best to create a database with the simplest raw data items\nincluded instead of derivative/aggregated data items.",
  "Any variable that in its raw state is a continuous variable (e.g.",
  "tumour size in millimetres) should be stored as that continuous\nvariable rather than a category (e.g. tumours between 5 and 10\nmm).",
  "You should of course ensure that all the data items in your\ndatabase are relevant to your project’s aims and objectives\nbecause it is a waste of resources (usually your time) to enter\nirrelevant items.",
  "What software should you use? You will notice that choice of software comes after design of the\ndatabase.",
  "Too many researchers start with the software choice and\nthen their database design is inﬂuenced by what the software can\ndo, rather than what the software can do for them.",
  "There are a\nnumber of popular database software packages on the market,\nsuch as Microsoft Access and Filemaker Pro, which run on indi-\nvidual computers.",
  "There are also server-based databases, such as\nMySQL, Microsoft SQL Server or Oracle.",
  "These software packages\nare all very good and very powerful for multiuser projects with a\nnumber of interacting databases, but they are overkill for a\nresearch project such as the breast cancer tissue array project\ndescribed above.",
  "Although we have used Microsoft Access and\nFilemaker Pro in the past with success, the learning curve for using\nthese packages is relatively steep and the results are no better than\nusing our current preferred option which is Microsoft Excel.",
  "This\nspreadsheet application has enough database functions built into it\nto carry out all the necessary preprocessing before statistical\nanalysis of results in speciﬁc statistical software package, such as\nStatistical Package for Social Sciences (SPSS).",
  "It has the major\nadvantages of virtually no learning curve, if you already use its\nspreadsheet functions, no platform speciﬁcity (Microsoft Access\ndoes not run on Macintosh computers), accepts ﬁles from other\nsources in a wide range of formats, and does not allow the user to\nwaste time creating colourful graphical interfaces for entering data\nthat have no value to the project.",
  "We simply create a column for\neach data item and use a row for each case.",
  "The ‘Split Window’ and\n‘Freeze Panes’ functions (found under the Windows menu at the\ntop of the screen) allow the column headings and left-hand row\nlabels to remain on the screen all the time no matter how many\nrows or columns there are in the spreadsheet (see the Excel help\nﬁles for further details).",
  "We enter data directly into the spreadsheet\nwithout using any custom entry form, but it is easy to create one if\nyou feel that data entry would be cleaner by using one, e.g.",
  "if\nsomeone without specialist knowledge is entering the data for you.",
  "If you need multiuser entry, then a single spreadsheet be-\ncomes problematic because version control becomes very difﬁ-\ncult.",
  "In these circumstances, a server-based database is more\nuseful but it can be difﬁcult to arrange access from different in-\nstitutions.",
  "A more recent development is the availability of web-\nbased databases, which are accessible from any web browser and\nmake multiuser data entry very simple.",
  "The consideration with\nthese web-based databases is the security of the commercial\n\nproviders’ servers, but they are basing their business on a secure\nservice so the risk might be lower than for an ad-hoc server in an\nacademic institution.",
  "Coding your data\n\nYou will know which data items you want to include in your\ndatabase because you designed it before you touched the com-\nputer keyboard, but now you need to consider how you are going\nto code that data.",
  "This only requires a bit of thought about how\nyou are going to sort and use the data but again if you code your\ndata in appropriate formats it will cause a lot of rework and delay\nlater.",
  "The laboratory accession number is a simple illustrative\ncase (Tables 1 and 2).",
  "This number is usually in the form of the\nyear and then a single unique number issued in ascending order\nas specimens arrive.",
  "There may also be a separate block number if\nthe specimen cannot be embedded in a single block.",
  "If such a\nnumber is entered into a single column in its usual format, e.g.",
  "08/23156/3E, it will be treated as text rather than a number in\nExcel and there can be a number of problems when sorting data\nfor analysis.",
  "Tables 1 and 2 illustrate these problems and show\nthat the best solution is to create separate columns for each\nelement of a multipart or mixed number/text item.",
  "Binary data\nitems, such as gender or lymph node status, are easier but there is\nstill a decision to be made as to whether to use strict mathematical\nbinary code or a more descriptive code.",
  "Gender could be coded as\n1 ¼ female and 0 ¼ male, but this is an arbitrary coding that is not\nmemorable to the data inputer.",
  "Coding as f ¼ female and m ¼\nmale is memorable and so far lower rates of errors are likely\nduring the inputting of the data, i.e.",
  "make the purest possible\ntransformations of data.",
  "It is a very simple automated ‘ﬁnd and\nreplace’ function to convert these to true mathematical binary\nitems for statistical analysis.",
  "It is well worth keeping descriptive\ncodings as short as possible, because this reduces the number of\nkeystrokes when entering data.",
  "The autoﬁll function of Excel is\n\nCoding the laboratory accession number.",
  "If entered in\nthe format in column 1 the accession number sorts to the\norder in column 2 e the year order is incorrect because\nthe full year was not included.",
  "With the full year added\nand sorted, column 3, there is still a problem with the\norder of the second and third rows because zeros before\nthe accession number have not been added to numbers\nwith fewer than ﬁve digits.",
  "When this has been done,\ncolumn 4, the numbers now do sort into the correct time\norder but a better method is shown in Table 2\n\n1.",
  "Unsorted\n\n2. Sorted\n\n3. Full year\nsorted\n\n4.",
  "Full year and\npreceeding zeros\nsorted\n\n98/1119/3E\n02/34001/4F\n99/1231/2F\n00/32754/1A\n03/4567/8G\n99/12237/4D\n\n00/32754/1A\n02/34001/4F\n03/4567/8G\n98/1119/3E\n99/1231/2F\n99/12237/4D\n\n1998/1119/3E\n1999/12237/4D\n1999/1231/2F\n2000/32754/1A\n2002/34001/4F\n2003/4567/8G\n\n1998/01119/3E\n1999/01231/2F\n1999/12237/4D\n2000/32754/1A\n2002/34001/4F\n2003/04567/8G\n\nDIAGNOSTIC HISTOPATHOLOGY 24:4\n\n(cid:1) 2017 Published by Elsevier Ltd.\n\nTable 1\n\n151\n\n\fMINI-SYMPOSIUM: RESEARCH\n\nThis shows a better method for coding the laboratory\naccession number by creating a separate column for\neach element of the number.",
  "Note that in this case\npreceding zeros do not need to be included as the Excel\nsoftware is treating the numbers as actual numbers\nrather than text, as in Table 1.",
  "If you are using a single\nrepresentative section from a multipart specimen, e.g.",
  "a\nrepresentative block of breast cancer from a mastectomy\nspecimen, then always remember to include the speciﬁc\nblock number in the database, otherwise future studies\nmay have to retrieve all the slides for the case (speciﬁed\nby the year and accession number) and look at these to\nselect the representative block again e a huge amount\nof rework for no gain in value\n\nNumber\n\n1119\n1231\n12237\n32754\n34001\n4567\n\nPart\n\n3E\n2F\n4D\n1A\n4F\n8G\n\nYear\n\n1998\n1999\n1999\n2000\n2002\n2003\n\nTable 2\n\nuseful and can be optimized by choosing different ﬁrst letters for\nas many different items as possible.",
  "An example for breast cancer\nthat we have used is tumour type, where d ¼ ductal, l ¼ lobular, t\n¼ tubular, me ¼ medullary, mu ¼ mucinous, etc.",
  "It should be\nnoted that when entering text into Excel it will be case-sensitive in\nany manipulations, such as grouping or pivot data tables, so it is\nbest to use lower case letter throughout, which also reduces\nkeystrokes by not using the Shift key.",
  "Importing items into your database\n\nIf some of the data you wish to have in your database exist in\nanother database, it may be possible to import them into your\ndatabase instead of having to key them all in.",
  "The ﬁrst thing to\nensure is that the data in the other database are ‘clean’ (i.e.",
  "consistently formatted) and veriﬁed.",
  "People often volunteer data\nfrom a database which on closer examinations contains many\nformatting inconsistencies, e.g.",
  "‘yes’ coded as ‘y’, ‘Y’ or ‘1’ for a\nsingle data ﬁeld, and it then is better to start again with the\noriginal source data.",
  "Another common feature of processes\ndesigned to port data from one database to another is that IT\nprofessionals want to write complicated interface programmes\nwhich take weeks or months to develop.",
  "Whilst these are essential\nfor databases that port data between themselves on a frequent,\nrecurrent basis, this is usually completely unnecessary for a\nstandalone research database, which usually only requires a sin-\ngle transfer at a single point in time.",
  "The easiest method we have\nfound is to perform a search on the existing database to select the\nrecords that we want to import and then export those in a format\nthat Excel can read.",
  "Often the parent database will be able to\nexport in Excel format but comma or tab-delimited text is just as\nacceptable and causes no extra work.",
  "Once in Excel the imported\ndata can be quickly sorted and formatted as required.",
  "It should be\nnoted that it is best to import as the ﬁrst stage of creating your\n\nresearch database, rather than trying to add the imported data to\nan existing database which may be more problematic.",
  "Calculating derived data items within your database\n\nAs noted above it is often easier (and certainly more accurate) to\ncalculate some derived data items from raw source data items\nwithin the database.",
  "This can be done using Excel’s calculation\nfunctions and the reader is referred to Excel help ﬁles or\ninstructional books for the details of this.5 Obviously some cal-\nculations are easier than others.",
  "If your raw data item is the\nmaximum diameter of a breast cancer in millimetres and you\nwant to convert that to centimetres in the calculation of the\nNottingham Prognostic Index, then you would simply set up a\nformula such: ¼ A23/10 where A23 is the index of the cell\ncontaining the measurement in millimetres.",
  "It is a simple matter\nto propagate that formula down the whole column for size in\ncentimetres by using the ‘Fill’ ‘Down’ functions from the Edit\nmenu.",
  "Deriving the lymph node status component for the Not-\ntingham Prognostic Index from the total number of positive\nlymph nodes would be more complicated but the conditional\noperators exist in Excel to allow this, e.g.",
  "¼ IF(A23 > 3,2,0), and\nautomatic help boxes make this very easy (click the calculator\nsymbol on the Excel toolbar just to the right of the green tick\nsymbol).",
  "It should be noted that these calculated values only\nexist when the other items from which they are derived are still\npresent in the datasheet.",
  "If for any reason, such as reducing data\ndown to the core items for statistical analysis, you are going to\nremove columns from the datasheet, you must select the whole\ndatasheet, copy it and then paste it back in the same cells using\nthe Paste Special function and selecting Values.",
  "You will then\nhave a sheet in which each cell is an independent number not\ndependent on any other cell.",
  "Obviously, you should only do this\nwhen you have ﬁnished entering all the data and are ready for\ndata analysis, and you should immediately save this sheet in a\ndifferent name from the original database sheet.",
  "Verifying your data\n\nOnce you have input your data you need to make some assess-\nment of the veracity of that data.",
  "It is remarkable how many\nerrors are introduced during data entry that need to be corrected\nbefore the database is usable.",
  "Excel has some useful functions\nthat make debugging the database relatively easy.",
  "One method is\nto ensure that you have saved the database and then try sorting\nthe data in many different ways.",
  "Go to ‘Sort’ under the ‘Data’\nmenu and select any single column as the sorting factor and\nperform the sort.",
  "Now scroll through the database sheet looking\nat the column you sorted by, especially at the top and bottom of\nthe sorted sheet, and you can see all sorts of data entry errors\nfrom completely blank cells through to mispellings or duplicated\nsymbols.",
  "You could repeat these sorts for each column to check\nfor further errors in other columns.",
  "A similar, but possibly easier,\nmethod is to use the Autoﬁlter function.",
  "Highlight the complete\nsheet (by clicking the diamond symbol in the top left cell of the\nsheet), from the Data menu select the Filter option and then\nselect the Autoﬁlter option.",
  "At the top of each column there will\nnow appear an up and down arrow symbol; clicking on this\nproduces a list of all the different occurrences of data items in\nthat column, making it very easy to see errors such as ‘Y’ instead\n\nDIAGNOSTIC HISTOPATHOLOGY 24:4\n\n152\n\n(cid:1) 2017 Published by Elsevier Ltd.\n\n\fMINI-SYMPOSIUM: RESEARCH\n\nof ‘y’.",
  "When all the obvious typing errors have been corrected, it\nwould be wise to perform an audit, checking perhaps 10% of the\ncase records with their original source data to check that there\nare no systematic data entry errors.",
  "Backing up your database\n\nData only exists when it is stored in two places e this widespread\ndictum is never more true than for databases.",
  "If you are going to\nspend many hours entering data into a database, then you need to\nhave a reliable system of back-up.",
  "The best systems are automatic\nand store the data at a geographically separate location; institutions\nsuch as universities often provide such systems for their members.",
  "Excel-based databases produce ﬁles which are very manageable in\nsize and can easily be backed up to CDs or memory sticks, but be\nmindful of security issues even with a completely anonymized\ndatabase (which would still cause media interest if found in an\ninappropriate place) and keep the copies in secure locations.",
  "Many\nNHS institutions are now so wary of data loss through sources such\nas memory sticks, that they are considering disabling USB ports on\ntheir computers so automated back-ups onto servers within the\ninstitution’s ﬁrewall may well become the norm.",
  "Exporting data for analysis\n\nThe function of a database is to store and order data for a\nresearch project that can then be analysed.",
  "By using Excel as the\ndatabase software, many statistical functions and analysis can be\nused directly within Excel.",
  "However more sophisticated analyses\nwill require preprocessing and export to other programmes such\nas SSPS.",
  "The preprocessing will mainly consist of converting\ndescriptive variables into numerical values, e.g.",
  "‘f’ to ‘1’, which\nis easily done using the search and replace functions of Excel.",
  "The labels of the columns may have to be shortened to be read by\nsome statistical programmes, e.g.",
  "SPSS will only read the ﬁrst\neight characters of variable names.",
  "Again, you must remember to\nsave the spreadsheet with a different ﬁlename before beginning\ndata preprocessing, as it will destroy some of the data, or\ncertainly its format.",
  "Most specialist statistical programmes, such\nas SPSS, will read Excel ﬁles but data can be output in comma- or\ntab-delimited text from Excel if necessary.",
  "Research notes ‘database’\n\nAny researcher 15 years ago would have had supplementary ‘da-\ntabases’ for their research projects, usually an index box with cards\nwith the authors and title of published papers and a number that\nreferred to a folder in a ﬁling cabinet.",
  "They might also have had a\nbound book with notes, or possibly a pile of loose papers with\nvarious notes e they still might have those on their desk today.",
  "A\nsupervised researcher working in a well-organized laboratory\nshould still have a bound book as a record of their experiments and\nprimary data, but there are now more useful ways of storing other\ninformation than a pile of loose papers.",
  "The widespread availability\nof electronic PDF versions of published paper and the information\ndisplayed on numerous authoritative websites has widened the\nscope for electronic databases of collected research ‘notes’.",
  "These\nshould be much easier to search, can have direct links to PDF ﬁles\nstored on the computer and direct links to relevant websites, and\ncould signiﬁcantly improve a researcher’s productivity.",
  "A number\n\nof software programmes that perform this task are available.",
  "On\nMacintosh computers TapForms6 appears to be the current market\nleader and is extremely easy to use.",
  "On PCs Microsoft Ofﬁce One-\nNote (available as part of the MS Ofﬁce 2016 Ofﬁce Suite) is a\ncomprehensive electronic documentation application that allows\norganization and storage of information from a wide range of\nsources.7 It also allows resources to be shared securely with project\ncollaborators via the internet.",
  "Conclusions\n\nA research database for even relatively sophisticated histopa-\nthology research projects, e.g.",
  "immunohistochemical staining of\ntissue arrays with hundreds of tumours, is easy to construct and\nuse provided that care is taken in its overall design and the\ncoding of data items.",
  "The purpose of the database should always\nbe to serve the overall aims of the research project and it should\nnot become an isolated resource-consuming entity.",
  "For most\nhistopathology projects, a simple spreadsheet programme, such\nas Microsoft Excel, will provide all\nthe necessary database\nfunctions with the minimum amount of infra-structural effort.",
  "Conﬂicts of interest\n\nThe authors have no conﬂicts of interest to declare.",
  "A\n\nREFERENCES\n1 Balasubramanian SP, Cross SS, Globe J, Cox A, Brown NJ,\n\nReed MW.",
  "Endostatin gene variation and protein levels in breast\ncancer susceptibility and severity.",
  "BMC Cancer 2007; 7: 107. 2 BBC News website.",
  "Thousands of Welsh NHS staff’s data stolen in\n\nhack.",
  "Avaliable at: http://www.bbc.co.uk/news/uk-wales-\n39249975 (accessed 4 June 2017). 3 Data Protection Act.",
  "Available at: http://www.legislation.gov.uk/\n\nukpga/1998/29/contents (accessed 4 June 2017).",
  "4 Iversen A, Liddell K, Fear N, Hotopf M, Wessely S. Consent,\n\nconﬁdentiality and the data protection act.",
  "BMJ 2006; 332: 165e9. 5 Walkenbach J. Excel 2016 bible.",
  "Hoboken, New Jersey: John Wiley\n\n& Sons, 2015. June 2017). 6 TapForms.",
  "Avaliable at: https://www.tapforms.com/ (accessed 4\n\n7 Microsoft Ofﬁce OneNote.",
  "Avaliable at: https://www.onenote.com/\n\n(accessed 4 June 2017).",
  "Practice points\n\nC Any research database should be anonymized as completely as is\n\nfeasible for the speciﬁc research project\n\nC A research database should always be part of a project approved\nby a research ethics committee and should be speciﬁed within the\nresearch protocol\n\nC A research database should comply with appropriate data pro-\n\ntection legislation, the Data Protection Act in the UK\n\nC The design of the database should be speciﬁed by the aims and\nobjectives of the research project and not by software capabilities\nC Care should be taken to code data items in a format that retains\nall potentially relevant information and which allows them to be\nselected and sorted in a consistent manner\n\nDIAGNOSTIC HISTOPATHOLOGY 24:4\n\n153\n\n(cid:1) 2017 Published by Elsevier Ltd."
]