[
  "SUPERIOR COURT OF CALIFORNIA\nCOUNTY OF ORANGE\n\nSelf-Help Services\nwww.occourts.org/self-help\n\nWAGE GARNISHMENT\n\nSELF-HELP FORM PACKET\n\nSHC-CPJ-04  (Rev.",
  "04/18/2025)\n\nSelf-Help Services can review your completed forms before you file them\nwith the Court.",
  "To request review of your completed forms:\n\n1.",
  "2. 3. Complete the attached forms in black ink.",
  "Scan your completed forms and save as a single PDF file.",
  "Go to www.occourts.org/self-help (click the button labeled  \nClick Here to Contact Self-Help Services), attach the PDF, and   \ncomplete the online request form.",
  "Make sure to select   \n CIVIL as the case type on the form.",
  "www.occourts.org/self-help \n\n\fMC-013-INFO\n\nINFORMATION SHEET FOR CALCULATING INTEREST\nAND AMOUNT OWED ON A JUDGMENT \n\nWhat can the judgment creditor recover?",
  "Under California law, the amount recoverable by a judgment creditor includes: \n\n\n\n\n\n\n\nThe total amount of the judgment entered by the court (principal), plus costs;\nCosts after judgment under Code of Civil Procedure section 685.070; and \nAccrued interest on the total amount.",
  "Costs After Judgment \nA judgment creditor is entitled to reimbursement for the “reasonable and necessary” costs of enforcing a judgment.",
  "These \ncosts must be reported to the court within two years of the date incurred.",
  "The judgment amount includes costs ordered by \nthe court after the judgment.",
  "(For information on recovering costs and a detailed list of costs that can be recovered see \nCode of Civil Procedure sections 685.040, 685.050 et seq., 685.070(b), and 685.090; see also “Requesting Costs and \nInterest” below).",
  "Accrued Interest (See Code Civ.",
  "Proc., §§ 685.010, 685.020(a), and Cal. Const., art. XV, § 1.)",
  "Interest accrues on an unpaid judgment amount at the legal rate of 10% per year (7% if the judgment debtor is a state or \nlocal government entity) generally from the date of entry of the judgment.",
  "Interest begins to accrue on the amount of costs \nadded to a judgment from the date ordered by the court or from the date costs are allowed following expiration of the time \nto object.",
  "(Code Civ. Proc., § 685.070(d).)",
  "Also, upon renewal of a judgment, interest begins to accrue on the day the \nrenewed judgment is entered.",
  "If the judgment is payable in installments, interest accrues from the date each installment is \ndue.",
  "Requesting Costs and Interest\nTo have costs and interest added to the enforceable amount owed, the judgment creditor must file and serve a \nMemorandum of Costs After Judgment (form MC-012).",
  "On this form, the judgment creditor must include the exact \namount of all costs and accrued interest.",
  "This means the judgment creditor is responsible for calculating the amount of \ninterest that accrues on the judgment.",
  "It is useful to update this calculation after receiving payments.",
  "Crediting Payments Received \nAny payments received by the judgment creditor must be “credited” in a specific order. (Code Civ. Proc., § 695.220.)",
  "After specific costs go directly to the levying officer and to the court for fees, the judgment creditor is required to credit \npayments received first toward accrued interest and then toward the judgment principal (including costs approved by the \ncourt after entry of the judgment).",
  "Calculation of Interest on Judgment and Amount Due\nFollowing are various formulas and examples to assist with the calculation of interest on a judgment using a 10% interest \nrate:\n\n\nCalculating Daily Interest on a Judgment Using 10% Interest Rate\nFollowing is the formula for figuring out the amount of interest earned per day on a judgment.",
  "Formula: Total amount of judgment owed x 10% (or 0.10) = interest earned per year.",
  "Divide that number by 365 = daily interest earned.",
  "Example: Judgment debtor owes the judgment creditor $5,000 (the “judgment principal”).",
  "$5,000 x 0.10 = $500 \n$500/365 = $1.37 daily interest\n\nThe amount of interest earned will be $1.37 per day as long as the unpaid amount remains $5,000.",
  "Calculating the Total Amount Due, Including Interest, on the date of payment\nStep 1: Calculate the amount of interest owed on the date of payment.",
  "This amount will equal the daily interest rate \ncalculated above, multiplied by the number of days since the court entered the final judgment.",
  "1. Figure out the total number of days that have passed since the court entered the final judgment up to the day of \npayment.",
  "Multiply the total days by the amount of daily interest.",
  "The result is the amount of interest owing on the day of \npayment. 2.",
  "Form Approved for Optional Use \nJudicial Council of California\nMC-013-INFO [New January 1, 2018] \n\nINFORMATION SHEET FOR CALCULATING INTEREST\nAND AMOUNT OWED ON A JUDGMENT\n\nPage 1 of 2 \n\nMC-013-INFO\n\n\fMC-013-INFO\n\nExample: Assume a $5,000 judgment was entered on June 1 and paid on September 8; 100 days from the entry of \nthe judgment have passed.",
  "The daily interest is $1.37 (see above calculation).",
  "$1.37 per day x 100 days = $137 interest owed on the date of payment.",
  "The judgment debtor owes $137 in interest on the principal of $5,000 on the date of payment.",
  "Step 2: Add the amount of interest that has accrued to the amount of the judgment.",
  "$5,000 judgment amount + $137 interest = $5,137.",
  "The judgment debtor owes a total of $5,137 on the 100th day after the court entered the judgment.",
  "\n\nCrediting Partial Payments and Recalculating the Amount Due\n\nIf the judgment debtor does not pay all that is owed at one time, the partial payments the debtor makes are credited\nto the interest first and then to the judgment amount (the principal) owed.",
  "Example: Judgment principal of $5,000.",
  " First Payment: After 200 days, the judgment debtor pays $1,000\n\nStep 1: Calculate the amount of interest owed on the date of payment\n\nFollowing the above example: $1.37 per day x 200 days.",
  "After 200 days, $274 in interest will have accrued \non the $5,000 judgment (200 days x $1.37 per day).",
  "Step 2: Apply payment to interest \n\nThe debtor paid $1,000, which must first be used to credit the $274 of accrued interest.",
  "That leaves a balance of $726 to be credited toward the $5,000 principal ($1,000 - $274 = $726).",
  "Step 3: Apply remainder to principal\n\nThe remaining credit of $726 is applied to the $5,000 judgment principal ($5,000 - $726 = $4,274).",
  "The judgment debtor now owes $4,274 on the judgment principal.",
  "Step 4: Calculate the new daily interest rate \n\nDaily interest would then accrue at a rate of $1.17/day.",
  "$4,274 x 10% = $427.40 interest earned per year.",
  "$427.40/365 = $1.17 interest earned per day.",
  " Second Payment: After 100 days, a payment of $500 is made (calculate using steps 1–4)\n\nThe amount of interest that accrues in the next 100 days:\n100 days x $1.17 = $117.",
  "The payment of $500 must first be credited towards the interest of $117, leaving a balance of $383 to be \ncredited against the principal ($500 - $117 = $383).",
  "3. The credit of $383 is then subtracted from the judgment principal of $4,274, leaving an unpaid balance of\n\n$3,891.",
  "The new daily interest would then accrue on the principal going forward at a rate of $1.07/day:\n$3,891 x 10% = $389.10/365. 1. 2. 4.",
  "MC-013-INFO [New January 1, 2018]\n\nINFORMATION SHEET FOR CALCULATING INTEREST\nAND AMOUNT OWED ON A JUDGMENT\n\nPage 2 of 2 \n\n\fATTORNEY OR PARTY WITHOUT ATTORNEY\n\nSTATE BAR NUMBER:\n\nMC-012\n\nFOR COURT USE ONLY\n\nSTATE:\n\nFAX NO.",
  ":\n\nZIP CODE:\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF\nSTREET ADDRESS:\n\nNAME:\n\nFIRM NAME:\n\nSTREET ADDRESS:\n\nCITY:\n\nTELEPHONE NO.",
  ":\n\nE-MAIL ADDRESS:\n\nATTORNEY FOR (name):\n\nMAILING ADDRESS:\n\nCITY AND ZIP CODE:\n\nBRANCH NAME:\n\nPLAINTIFF:\n\nDEFENDANT:\n\nMEMORANDUM OF COSTS AFTER JUDGMENT, ACKNOWLEDGMENT OF \nCREDIT, AND DECLARATION OF ACCRUED INTEREST\n\nCASE NUMBER:\n\n1.",
  "Postjudgment costs\n\na. \n\nI claim the following costs after judgment incurred within the last two years (indicate if there are multiple items in any category):\n\nDates Incurred\n\nAmount\n\n(5)\n\n(6) \n\n(1) \n(2) \n(3)\n(4)\n\n(specify county):\n\nPreparing and issuing abstract of judgment\nRecording and indexing abstract of judgment\nFiling notice of judgment lien on personal property\nIssuing writ of execution, to extent not satisfied by Code Civ.",
  "Proc.,  \n§ 685.050 \nLevying officers fees, to extent not satisfied by Code Civ.",
  "Proc.,  \n§ 685.050 or wage garnishment\nApproved fee on application for order for appearance of judgment \ndebtor, or other approved costs under Code Civ.",
  "Proc., § 708.110 \net seq. Attorney fees, if allowed by Code Civ.",
  "Proc., § 685.040\nOther:\nTotal of claimed costs for current memorandum of costs (add items (1)–(8))\n\n(7) \n(8)\n(9)\nAll previously allowed postjudgment costs\nTotal of all postjudgment costs (add items a and b)\n\n(Statute authorizing cost):\n\n$\n$\n$\n$\n\n$\n\n$\n\n$\n$\n$\n$\n$\n\nb.\nc.\n\na. \n\nb. 2.",
  "Credits to interest and principal\n\n$\nI acknowledge total payments to date in the amount of:   \nThe payments received are applied first to the amount of accrued interest, and then to the judgment principal (including\n$\npostjudgment costs allowed) as follows: credit to accrued interest:                          ; credit to judgment principal                          .",
  "$\nPrincipal remaining due: The amount of judgment principal remaining due is   \n.",
  "(See Code Civ. Proc., § 680.300)\n\n(including returns on levy process and direct payments). $\n\n3. 4.",
  "Accrued interest remaining due: I declare interest accruing (at the legal rate) from the date of entry or renewal and on \nbalances from the date of any partial satisfactions (or other credits reducing the principal) remaining due in the amount \n$\nof   \nI am the:\nI have knowledge of the facts concerning the costs claimed above.",
  "To the best of my knowledge and belief, the costs claimed are \ncorrect, reasonable, and necessary, and have not been satisfied.",
  ". judgment creditor \n\nattorney for the judgment creditor.",
  "agent for the judgment creditor\n\nI declare under penalty of perjury under the laws of the State of California that the foregoing is true and correct.",
  "Date:\n\n(TYPE OR PRINT NAME)\n\n(SIGNATURE OF DECLARANT)\n\nNOTICE TO THE JUDGMENT DEBTOR \n\nIf this memorandum of costs is filed at the same time as an application for a writ of execution, any statutory costs, not exceeding \n$100 in aggregate and not already allowed by the court, may be included in the writ of execution.",
  "The fees sought under this \nmemorandum may be disallowed by the court upon a motion to tax filed by the debtor, notwithstanding the fees having been \nincluded in the writ of execution.",
  "(Code Civ. Proc., § 685.070(e).)",
  "A motion to tax costs claimed in this memorandum must be filed \nwithin 10 days after service of the memorandum.",
  "(Code Civ. Proc., § 685.070(c).)",
  "Form Adopted for Mandatory Use \n Judicial Council of California \nMC-012 [Rev.",
  "September 1, 2018]\n\nMEMORANDUM OF COSTS AFTER JUDGMENT, \nACKNOWLEDGMENT OF CREDIT, AND DECLARATION \nOF ACCRUED INTEREST \n\nPage 1 of 2\n\nCode of Civil Procedure, \n§§ 685.040, 685.070, 695.220 \nwww.courts.ca.gov\n\n\fShort Title:\n\nCASE NUMBER:\n\nMC-012\n\nPROOF OF SERVICE\n\nMail\n\nPersonal Service\n\nAt the time of service I was at least 18 years of age and not a party to this legal action.",
  "My residence or business address is:\n\nI mailed or personally delivered a copy of the Memorandum of Costs After Judgment, Acknowledgment of Credit, and\nDeclaration of Accrued Interest as follows (complete either a or b):\n\na.",
  "(1)\n\nMail. I am a resident of or employed in the county where the mail occurred.",
  "I enclosed a copy in an envelope AND\n(a)\n(b)\n\ndeposited the sealed envelope with the United States Postal Service with the postage fully prepaid.",
  "placed the envelope for collection and mailing on the date and at the place shown in items below following our \nordinary business practices.",
  "I am readily familiar with this business's practice for collecting and processing \ncorrespondence for mailing.",
  "On the same day that correspondence is placed for collection and mailing, it is \ndeposited in the ordinary course of business with the United States Postal Service in a sealed envelope with \npostage fully prepaid.",
  "(2) The envelope was addressed and mailed as follows:\n\nName of person served:\nAddress on envelope:\nDate of mailing:\n\n(a)\n(b)\n(c)\n(d) Place of mailing (city and state):\n\nb.",
  "Personal delivery. I personally delivered a copy as follows.",
  "Name of person served:\n(1)\n(2)\nAddress where delivered:\n(3)\nDate delivered:\n(4) Time delivered:\n\nI declare under penalty of perjury under the laws of the State of California that the foregoing is true and correct.",
  "1. 2. 3. Date:\n\n(TYPE OR PRINT NAME)\n\n(SIGNATURE OF DECLARANT)\n\nMC-012 [Rev.",
  "September 1, 2018]\n\nPage 2 of 2\n\nMEMORANDUM OF COSTS AFTER JUDGMENT, \nACKNOWLEDGMENT OF CREDIT, AND DECLARATION \nOF ACCRUED INTEREST \n\n\fATTORNEY OR PARTY WITHOUT ATTORNEY:\n\nSTATE BAR NO.",
  ":\n\nFOR COURT USE ONLY\n\nEJ-130\n\nSTATE:\n\nFAX NO.",
  ":\n\nZIP CODE:\n\nATTORNEY FOR\n\nORIGINAL JUDGMENT CREDITOR\n\nASSIGNEE OF RECORD\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF\nSTREET ADDRESS:\n\nNAME:\n\nFIRM NAME:\n\nSTREET ADDRESS:\n\nCITY:\n\nTELEPHONE NO.",
  ":\n\nEMAIL ADDRESS:\n\nATTORNEY FOR (name):\n\nMAILING ADDRESS:\n\nCITY AND ZIP CODE:\n\nBRANCH NAME:\n\nPLAINTIFF/PETITIONER:\n\nDEFENDANT/RESPONDENT:\n\nCASE NUMBER:\n\nEXECUTION (Money Judgment)\n\nWRIT OF\n\nPOSSESSION OF\n\nSALE\n\nPersonal Property\nReal Property\n\nLimited Civil Case \n(including Small Claims)\n\nUnlimited Civil Case\n(including Family and Probate)\n\n1.",
  "To the Sheriff or Marshal of the County of:\nYou are directed to enforce the judgment described below with daily interest and your costs as provided by law.",
  "2. To any registered process server: You are authorized to serve this writ only in accordance with CCP 699.080 or CCP 715.040.",
  "3. (Name):\n\nis the\n\noriginal judgment creditor\n\nassignee of record \n\nwhose address is shown on this form above the court’s name.",
  "4. Judgment debtor (name, type of legal entity if not a \nnatural person, and last known address):\n\n9.",
  "10. Writ of Possession/Writ of Sale information on next page.",
  "This writ is issued on a sister-state judgment.",
  "For items 11–17, see form MC-012 and form MC-013-INFO.",
  "Additional judgment debtors on next page\n\nJudgment entered on (date):\n(See type of judgment in item 22.)",
  "Judgment renewed on  (dates):\n\n7.",
  "Notice of sale under this writ:\n\nhas not been requested.",
  "has been requested (see next page). 8.",
  "Joint debtor information on next page. 5. 6.\n\na.\nb. [SEAL]\n\n11.",
  "Total judgment (as entered or renewed)\n\n12.",
  "Costs after judgment (CCP 685.090)\n\n13.",
  "Subtotal (add 11 and 12) \n\n14. 15. 16. 17. 18. 19.",
  "Credits to principal (after credit to interest)\n\nPrincipal remaining due (subtract 14 from 13) \nAccrued interest remaining due per  \nCCP 685.050(b) (not on GC 6103.5 fees)\nFee for issuance of writ (per GC 70626(a)(l))\nTotaI amount due (add 15, 16, and 17)\nLevying officer: \na.",
  "Add daily interest from date of writ (at  \nthe legal rate on 15) (not on  \nGC 6103.5 fees) .",
  ". . . . . . . . . . . . . . . Pay directly to court costs included in \n11 and 17 (GC 6103.5, 68637;  \nCCP 699.520(j))  .",
  ". . . . . . . . . . . . . . . b.",
  "$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n20.",
  "The amounts called for in items 11–19 are different for each \ndebtor.",
  "These amounts are stated for each debtor on  \nAttachment 20.",
  "Date:\n\nClerk, by\n\nNOTICE TO PERSON SERVED: SEE PAGE 3 FOR IMPORTANT INFORMATION.",
  ", Deputy\n\nPage 1 of 3\n\nForm Approved for Optional Use \nJudicial Council of California \nEJ-130 [Rev.",
  "September 1, 2020]\n\nWRIT OF EXECUTION\n\nCode of Civil Procedure, §§ 699.520, 712.010, 715.010 \nGovernment Code, § 6103.5 \nwww.courts.ca.gov\n\n\fPlaintiff/Petitioner:\n\nDefendant/Respondent:\n\nCASE NUMBER:\n\nEJ-130\n\n21.",
  "Additional judgment debtor(s) (name, type of legal entity if not a natural person, and last known address):\n\n22.",
  "The judgment is for (check one):\n\na.\nb.\n\nc.\n\nwages owed.",
  "child support or spousal support. other. 23.",
  "Notice of sale has been requested by (name and address):\n\n24.",
  "Joint debtor was declared bound by the judgment (CCP 989-994)\n\na.\nb.\n\non (date):\nname, type of legal entity if not a natural person, and \nlast known address of joint debtor:\n\na.\nb.\n\non (date):\nname, type of legal entity if not a natural person, and \nlast known address of joint debtor:\n\nc.\n\nAdditional costs against certain joint debtors are itemized:\n\nbelow\n\non Attachment 24c.",
  "25.\n\na. (1)\n\n(2)\n\n(3)\n\n(Writ of Possession or Writ of Sale) Judgment was entered for the following:\n\nPossession of real property: The complaint was filed on\n(Check (1) or (2).",
  "Check (3) if applicable. Complete (4) if (2) or (3) have been checked.)",
  "(date):\n\nThe Prejudgment Claim of Right to Possession was served in compliance with CCP 415.46.",
  "The \njudgment includes all tenants, subtenants, named claimants, and other occupants of the premises.",
  "The Prejudgment Claim of Right to Possession was NOT served in compliance with CCP 415.46.",
  "The unlawful detainer resulted from a foreclosure sale of a rental housing unit.",
  "(An occupant not named in the \njudgment may file a Claim of Right to Possession at any time up to and including the time the levying officer returns \nto effect eviction, regardless of whether a Prejudgment Claim of Right to Possession was served.)",
  "(See CCP \n415.46 and 1174.3(a)(2).)",
  "(4)\n\nIf the unlawful detainer resulted from a foreclosure (item 25a(3)), or if the Prejudgment Claim of Right to Possession was \nnot served in compliance with CCP 415.46 (item 25a(2)), answer the following:\n\nThe daily rental value on the date the complaint was filed was\n\n$\n\n(a)\n\n(b)\n\nThe court will hear objections to enforcement of the judgment under CCP 1174.3 on the following dates (specify):\n\nEJ-130 [Rev.",
  "September 1, 2020]\n\nPage 2 of 3\n\nItem 25 continued on next page\n\nWRIT OF EXECUTION\n\n\fCASE NUMBER:\n\nEJ-130\n\nPlaintiff/Petitioner:\n\nDefendant/Respondent:\n\n25.\n\nb.",
  "Possession of personal property.",
  "If delivery cannot be had, then for the value (itemize in 25e) specified in the judgment or supplemental order.",
  "c.\n\nd.\ne.\n\nSale of personal property. Sale of real property.",
  "The property is described\n\nbelow\n\non Attachment 25e.",
  "NOTICE TO PERSON SERVED \n\nWRIT OF EXECUTION OR SALE.",
  "Your rights and duties are indicated on the accompanying Notice of Levy (form EJ-150).",
  "WRIT  OF  POSSESSION OF PERSONAL PROPERTY.",
  "If the levying officer is not able to take custody of the property, the levying \nofficer will demand that you turn over the property.",
  "If custody is not obtained following demand, the judgment may be enforced as a \nmoney judgment for the value of the property specified in the judgment or in a supplemental order.",
  "WRIT OF POSSESSION OF REAL PROPERTY.",
  "If the premises are not vacated within five days after the date of service on the  \noccupant or, if service is by posting, within five days after service on you, the levying officer will remove the occupants from the real  \nproperty and place the judgment creditor in possession of the property.",
  "Except for a mobile home, personal property remaining on the \npremises will be sold or otherwise disposed of in accordance with CCP 1174 unless you or the owner of the property pays the \njudgment creditor the reasonable cost of storage and takes possession of the personal property not later than 15 days after the time \nthe judgment creditor takes possession of the premises.",
  "EXCEPTION IF RENTAL HOUSING UNIT WAS FORECLOSED.",
  "If the residential property that you are renting was sold in a \nforeclosure, you have additional time before you must vacate the premises.",
  "If you have a lease for a fixed term, such as for a year, you \nmay remain in the property until the term is up.",
  "If you have a periodic lease or tenancy, such as from month-to-month, you may remain \nin the property for 90 days after receiving a notice to quit.",
  "A blank form Claim of Right to Possession and Notice of Hearing (form \nCP10) accompanies this writ.",
  "You may claim your right to remain on the property by filling it out and giving it to the sheriff or levying \nofficer.",
  "EXCEPTION IF YOU WERE NOT SERVED WITH A FORM CALLED PREJUDGMENT CLAIM OF RIGHT TO POSSESSION.",
  "If you \nwere not named in the judgment for possession and you occupied the premises on the date on which the unlawful detainer case was \nfiled, you may object to the enforcement of the judgment against you.",
  "You must complete the form Claim of Right to Possession and \nNotice of Hearing (form CP10) and give it to the sheriff or levying officer.",
  "A blank form accompanies this writ.",
  "You have this right \nwhether or not the property you are renting was sold in a foreclosure. EJ-130 [Rev.",
  "September 1, 2020]\n\nWRIT OF EXECUTION\n\nPage 3 of 3\n\n\fATTORNEY OR PARTY WITHOUT ATTORNEY (Name, State Bar number,  and address):\n\nLEVYING OFFICER (Name and Address):\n\nWG-001\n\nFAX NO.",
  ":\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF\n:\n\nTELEPHONE NO.",
  ":\n\nE-MAIL ADDRESS:\n\nATTORNEY FOR (Name):\n\n   STREET ADDRESS:\n\n  MAILING ADDRESS:\n\nCITY AND ZIP CODE:\n\n  BRANCH NAME:\n\n       PLAINTIFF/PETITIONER:\n\nDEFENDANT/RESPONDENT:\n\nAPPLICATION FOR EARNINGS WITHHOLDING ORDER \n(Wage Garnishment)\n\nTO THE SHERIFF OR ANY MARSHAL OR CONSTABLE OF THE COUNTY OF: \nOR ANY REGISTERED PROCESS SERVER\n\n1.",
  "The judgment creditor (name):\nissuance of an Earnings Withholding Order directing the employer to withhold the earnings of the judgment debtor (employee).",
  "requests\n\nName and address of employer\n\nName and address of employee\n\nCOURT CASE NUMBER:\n\nLEVYING OFFICER FILE NUMBER:\n\n2.",
  "The amounts withheld are to be paid to\na.",
  "The attorney (or party without an attorney)\nnamed at the top of this page.",
  "3. a. Judgment was entered on (date):\n\nSocial Security no.",
  "on form WG-035\n\nunknown\n\nb. Other (name, address, and telephone):\n\nb.",
  "Collect the amount directed by the Writ of Execution unless a lesser amount is specified here:  $\n\n4.",
  "Check any that apply:\n\nThe Writ of Execution was issued to collect delinquent amounts payable for the support of a child, former spouse, or \nspouse of the employee.",
  "The Writ of Execution was issued to collect a judgment based entirely on a claim for elder or dependent adult financial \nabuse.",
  "The Writ of Execution was issued to collect a judgment based in part on a claim for elder or dependent adult financial abuse.",
  "The amount that arises from the claim for elder or dependent adult financial abuse is (state amount):  $\n\na.\n\nb.\n\nc.\n\na.\n\nb.",
  "5. Special instructions (specify):\n\n6.",
  "Check a or b:\n\nI have not previously obtained an order directing this employer to withhold the earnings of this employee.",
  "OR\nI have previously obtained such an order, but that order (check one):\n\nwas terminated by a court order, but I am entitled to apply for another Earnings Withholding Order under \nthe provisions of Code of Civil Procedure section 706.105(h).",
  "was ineffective. (TYPE OR PRINT NAME)\n\n(SIGNATURE OF ATTORNEY OR PARTY WITHOUT ATTORNEY) \n\nI declare under penalty of perjury under the laws of the State of California that the foregoing is true and correct.",
  "Date:\n\n(TYPE OR PRINT NAME)\n\nForm Adopted for Mandatory Use\nJudicial Council of California\nWG-001 [Rev.",
  "January 1, 2012]\n\nAPPLICATION FOR EARNINGS WITHHOLDING ORDER \n(Wage Garnishment)\n\n(SIGNATURE OF DECLARANT)\n\nPage 1 of 1\n\nCode Civ.",
  "Procedure, § 706.121\nwww.courts.ca.gov\n\n\fATTORNEY OR PARTY WITHOUT ATTORNEY:\n\nSTATE BAR NO.",
  ":\n\nWG-002\n\nLEVYING OFFICER (Name and address):\n\nSTATE:\n\nFAX NO.",
  ":\n\nZIP CODE:\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF\nSTREET ADDRESS:\n\nOrange\n\nNAME:\n\nFIRM NAME:\n\nSTREET ADDRESS:\n\nCITY:\n\nTELEPHONE NO.",
  ":\n\nE-MAIL ADDRESS:\n\nATTORNEY FOR (name):\n\nMAILING ADDRESS:\n\nCITY AND ZIP CODE:\n\nBRANCH NAME:\n\n       PLAINTIFF/PETITIONER:\n\nDEFENDANT/RESPONDENT:\n\nEARNINGS WITHHOLDING ORDER \n(Wage Garnishment)\n\nLEVYING OFFICER FILE NO.",
  ":\n\nCOURT CASE NO. :\n\nEMPLOYEE: KEEP YOUR COPY OF THIS LEGAL PAPER.",
  "EMPLEADO: GUARDE ESTE PAPEL OFICIAL.",
  "EMPLOYER: Enter the following date to assist your recordkeeping.",
  "Date this order was received by employer (specify the date of personal delivery by levying officer\nor registered process server or the date mail receipt was signed):\n\nTO THE EMPLOYER REGARDING YOUR EMPLOYEE:\n\nName and address of employer\n\nName and address of employee\n\nSocial Security No.",
  "on form WG-035           unknown \n\n1.",
  "A judgment creditor has obtained this order to collect a court judgment against your employee.",
  "You are directed to withhold part of\nthe earnings of the employee (see instructions on reverse of this form).",
  "Pay the withheld sums to the levying officer (name and\naddress above).",
  "If the employee works for you now, you must give the employee a copy of this order and the Employee Instructions (form\nWG-003) within 10 days after receiving this order.",
  "Complete both copies of the form Employer's Return (form WG-005) and mail them to the levying officer within 15 days \nafter receiving this order, whether or not the employee works for you.",
  "2. The total amount due is: $\n\nCount 10 calendar days from the date when you received this order.",
  "If your employee's pay period ends before the 10th day, do\nnot withhold earnings payable for that pay period.",
  "Do withhold from earnings that are payable for any pay period ending on or after\nthat 10th day.",
  "Continue withholding for all pay periods until you withhold the amount due.",
  "The levying officer will notify you of an assessment you\nshould withhold in addition to the amount due.",
  "Do not withhold more than the total of these amounts.",
  "Never withhold any earnings\npayable before the beginning of the earnings withholding period. 3.",
  "The judgment was entered in the court on (date):\n\nThe judgment creditor (if different from the plaintiff) is (name):\n\n4.",
  "The INSTRUCTIONS TO EMPLOYER on the reverse tell you how much of the employee's earnings to withhold each payday and\nanswer other questions you may have.",
  "Date:\n\nForm Adopted for Mandatory Use\nJudicial Council of California\nWG-002 [Rev.",
  "July 1, 2016] \n\n(TYPE OR PRINT NAME)\n\n(SIGNATURE)\n\n(cid:47)(cid:40)(cid:57)(cid:60)(cid:44)(cid:49)(cid:42)(cid:3)(cid:50)(cid:41)(cid:41)(cid:44)(cid:38)(cid:40)(cid:53)\n\n(cid:53)(cid:40)(cid:42)(cid:44)(cid:54)(cid:55)(cid:40)(cid:53)(cid:40)(cid:39)(cid:3)(cid:51)(cid:53)(cid:50)(cid:38)(cid:40)(cid:54)(cid:54)(cid:3)(cid:54)(cid:40)(cid:53)(cid:57)(cid:40)(cid:53)\n\n(Employer's Instructions on reverse)\n\nEARNINGS WITHHOLDING ORDER \n(Wage Garnishment)\n\nCode of Civil Procedure, §§ 706.022, 706.108, 706.125\nwww.courts.ca.gov\n\nPage 1 of 2\n\n\fINSTRUCTIONS TO EMPLOYER ON\nEARNINGS WITHHOLDING ORDERS \n\nWG-002\n\nThe instructions in paragraph 1 on the reverse of this form describe your\nearly duties to provide information to your employee and the levying\nofficer.",
  "Your other duties are TO WITHHOLD THE CORRECT AMOUNT OF\nEARNINGS (if any) and PAY IT TO THE LEVYING OFFICER during the\nwithholding period.",
  "The withholding period is the period covered by the Earnings With-\nholding Order (this order).",
  "The withholding period begins 10 calendar days\nafter you receive the order and continues until the total amount due, plus\nadditional amounts for costs and interest (which will be listed in a levying\nofficer's notice), is withheld.",
  "It may end sooner if (1) you receive a written notice signed by the\nlevying officer specifying an earlier termination date, or (2) an order of\nhigher priority (explained on the reverse of the Employer's Return (form\nWG-005) is received.",
  "You are entitled to rely on and must obey all written notices signed by the\nlevying officer.",
  "The Employer's Return (form WG-005) describes several situations that\ncould affect the withholding period for this order.",
  "If you receive more than\none Earnings Withholding Order during a withholding period, review that\nform (Employer's Return) for instructions.",
  "If the employee stops working for you, the Earnings Withholding Order\nends after no amounts are withheld for a continuous 180-day period.",
  "If\nwithholding ends because the earnings are subject to an order of higher\npriority, the Earnings Withholding Order ends after a continuous two-year\nperiod during which no amounts are withheld under the order.",
  "Return the\nEarnings Withholding Order to the levying officer with a statement of\nthe reason it is being returned.",
  "WHAT TO DO WITH THE MONEY\nThe amounts withheld during the withholding period must be paid to the\nlevying officer by the 15th of the next month after each payday.",
  "If you wish\nto pay more frequently than monthly, each payment must be made within\n10 days after the close of the pay period.",
  "Be sure to mark each check with the case number, the levying officer's file\nnumber,\nif different, and the employee's name so the money will be\napplied to the correct account.",
  "The garnishment\nlaw is contained in the Code of Civil Procedure\nbeginning with section 706.010.",
  "Sections 706.022, 706.025, 706.050, and\n706.104 explain the employer's duties.",
  "The Federal Wage Garnishment Law and federal rules provide the basic\nthe\nprotections on which the California law is based.",
  "federal law will be answered by mail, telephone, or personal interview at\nany office of the Wage and Hour Division of the U.S. Department of Labor.",
  "Offices are listed in the telephone directory under the U.S. Department of\nLabor in the U.S. Government listing.",
  "Inquiries about\n\nCOMPUTATION INSTRUCTIONS\n\nCalifornia law provides how much earnings to withhold, if any, for different\namounts of disposable earnings and different pay periods, and takes into\nconsideration different minimum wage amounts.",
  "The method of calculation\nis at Code of Civil Procedure section 706.050 and is described in the\ncolumn to the right.",
  "You may also look on the California Courts Self-Help\nwebsite for assistance in determining the maximum withholding amounts\nfor different amounts of disposable income, for different pay periods, and\nwith different minimum wage amounts.",
  "The information is at\nwww.courts.ca.gov/self-help-employerwagecivil.htm.",
  "THESE COMPUTATION INSTRUCTIONS APPLY UNDER NORMAL \nCIRCUMSTANCES.",
  "THEY  DO NOT APPLY TO ORDERS FOR THE \nSUPPORT OF A SPOUSE, FORMER SPOUSE, OR CHILD.",
  "State law limits the amount of earnings that can be withheld.",
  "The\nlimitations are based on the employee's disposable earnings, which are\ndifferent from gross pay or take-home pay.",
  "(A) To determine the CORRECT AMOUNT OF EARNINGS TO BE WITH-\nHELD (if any), first compute the employee's disposable earnings.",
  "Earnings\nsalary,\ncalled wages,\ncommissions, bonuses, or anything else) that is paid by an employer to an\nemployee for personal services.",
  "Vacation or sick pay is subject\nto\nis received by the employee.",
  "Tips are generally not\nwithholding as it\nincluded as earnings because they are not paid by the employer.",
  "any money\n\n(whether\n\ninclude\n\nDisposable earnings are the earnings left after subtracting the part of the\nearnings a state or federal law requires an employer to withhold.",
  "Generally\nthese required deductions are (1) federal\nincome tax, (2) federal social\nsecurity, (3) state income tax, (4) state disability insurance, and \n(5) payments to public employee retirement systems.",
  "Disposable earnings\nwill change when the required deductions change.",
  "(B) After the employee's disposable earnings are known, to determine\nwhat amount should be withheld, you may look to the statute, follow the\ndirections below in (C), or seek assistance on the California Courts Self-\nHelp website at www.courts.ca.gov/self-help-employerwagecivil.htm.",
  "Note that you also need to know the amount of the minimum wage in the\nlocation where the employee works.",
  "(C) Calculate the maximum amount\nthat may be withheld from the\nemployee's disposable earnings, which is the lesser of the following two\namounts:\n\n(cid:129) 25 percent of disposable earnings for that week; or\n(cid:129)  50 percent of\nthe amount by which the employee's disposable\nearnings that week exceed the applicable minimum wage.",
  "If there is a\nlocal minimum wage in effect in the location where the employee works\nthat exceeds the state minimum wage at the time the earnings are\npayable, the local minimum wage is the applicable minimum wage.",
  "To calculate the correct amount, follow the steps below: \nStep 1: Determine the applicable minimum wage per pay period.",
  "(cid:129) For a daily or weekly pay period, multiply the applicable hourly\n\n(cid:129) For a biweekly pay period, multiply the applicable hourly minimum\n\nwage by 80.",
  "(cid:129) For a semimonthly pay period, multiply the applicable hourly\n\nminimum wage by 86 2/3.",
  "(cid:129) For a monthly pay period, multiply the applicable hourly minimum\n\nwage by 173 1/3.",
  "Step 2: Subtract the amount from Step 1 from the employee's disposable\nearnings during that pay period.",
  "Step 3: If the amount from Step 2 is less than zero, do not withhold any\nmoney from the employee's earnings.",
  "Step 4: If the amount from Step 2 is greater than zero, multiply that\namount by one-half.",
  "Step 5:\nthe\nIf\nemployee's disposable earnings, withhold this amount.",
  "If it is greater than\n25 percent of the employee's disposable earnings, withhold 25 percent of\nthe disposable earnings.",
  "from Step 4 is lower than 25 percent of\n\nthe amount\n\nOccasionally, the employee's earnings will also be subject to a Wage\nand Earnings Assignment Order, an order available from family law\ncourts for child, spousal, or family support.",
  "The amount required to be\nto be\nwithheld for\nwithheld for this order.",
  "that order should be deducted from the amount\n\nWHAT IF YOU STILL HAVE QUESTIONS? minimum wage by 40. 1. 2. 3.",
  "IMPORTANT WARNINGS\nIT IS AGAINST THE LAW TO FIRE THE EMPLOYEE BECAUSE OF EARNINGS WITHHOLDING ORDERS FOR THE PAYMENT OF ONLY ONE\nINDEBTEDNESS.",
  "No matter how many orders you receive, so long as they all relate to a single indebtedness (no matter how many debts are\nrepresented in that judgment), the employee may not be fired.",
  "IT IS ILLEGAL TO AVOID AN EARNINGS WITHHOLDING ORDER BY POSTPONING OR ADVANCING THE PAYMENT OF EARNINGS.",
  "The\nemployee's pay period must not be changed to prevent the order from taking effect.",
  "IT IS ILLEGAL NOT TO PAY AMOUNTS WITHHELD FOR THE EARNINGS WITHHOLDING ORDER TO THE LEVYING OFFICER.",
  "Your duty is\nto pay the money to the levying officer who will pay the money in accordance with the law that applies to this case.",
  "IF YOU VIOLATE ANY OF THESE LAWS YOU MAY BE HELD LIABLE TO PAY CIVIL DAMAGES AND YOU MAY BE SUBJECT TO CRIMINAL\nPROSECUTION! WG-002 [Rev.",
  "July 1, 2016]\n\nPage 2 of 2\n\nEARNINGS WITHHOLDING ORDER \n(Wage Garnishment)\n\n\fATTORNEY OR PARTY WITHOUT ATTORNEY\n\nSTATE BAR NUMBER:\n\nLEVYING OFFICER (name and address):\n\nWG-005\n\nSTATE:\n\nFAX NO.",
  ":\n\nZIP CODE:\n\nNAME:\n\nFIRM NAME:\n\nSTREET ADDRESS:\n\nCITY:\n\nTELEPHONE NO.",
  ":\n\nE-MAIL ADDRESS:\n\nATTORNEY FOR (name):\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF\nSTREET ADDRESS:\n\nMAILING ADDRESS:\n\nCITY AND ZIP CODE:\n\nBRANCH NAME:\n\nPLAINTIFF/PETITIONER:\n\nDEFENDANT/RESPONDENT:\n\nEMPLOYER'S RETURN \n(Wage Garnishment)\n\nCOURT CASE NUMBER:\n\nLEVYING OFFICER FILE NUMBER:\n\nEMPLOYER: You must complete both copies of this form and mail them to the levying officer within 15 days.",
  "Please correct any errors in the mailing information below and provide any missing information, including the \nname of the person to whom notices should be directed.",
  "FAILURE TO COMPLETE AND RETURN THESE FORMS MAY SUBJECT YOU TO PAYMENT OF ATTORNEY FEES \nAND OTHER CIVIL PENALTIES.",
  "Name and address of employer\n\nName and address of employee\n\nAttn:\n\n(Insert name above)\n\n1.",
  "I received the Earnings Withholding Order on\n\n(date):\n\n2.",
  "The employee is\n\nSocial Security No.",
  "on form WG-035\n\nunknown\n\nnot employed by this employer (if not employed, omit items 2b through 6 and proceed to the declaration at the end of this \nform).",
  "now employed by this employer and in the last pay period had gross earnings of: \n\n$\n\na.\n\nb.\n\na.\n\nd.\n\n3.",
  "The employee's pay period is\n\ndaily\n\ntwice a month\n\nb.\n\ne.\n\nweekly\n\nmonthly\n\nc.\n\nf.\n\nevery two weeks\n\nother\n\n(specify):\n\n(IF YOU HAVE RECEIVED NO OTHER ORDERS THAT PRESENTLY AFFECT THIS EMPLOYEE'S EARNINGS, OMIT ITEMS 4, 5 \nAND 6, AND PROCEED TO THE DECLARATION AT THE END OF THIS FORM.)",
  "The Federal Wage Garnishment Law and federal rules provide the basic protections on which the California law is based.",
  "Form Adopted for Mandatory Use \nJudicial Council of California \nWG-005 [Rev.",
  "September 1, 2017]\n\n(Continued on reverse)\n\nEMPLOYER'S RETURN \n(Wage Garnishment)\n\nPage 1 of 2\n\nCode of Civil Procedure, § 706.126 \nwww.courts.ca.gov\n\n\fSHORT TITLE:\n\nLEVYING OFFICER FILE NUMBER:\n\nCOURT CASE NUMBER:\n\nWG-005\n\nIf you have received other orders that presently affect this employee's earnings, another order may have priority over this \none.",
  "The following list indicates the priority of orders:\n\nWage and Earnings Assignment Order (for Support)\nEarnings Withholding Order for Support\nEarnings Withholding Order for Taxes\nEarnings Withholding Order for Elder or Dependent Adult Financial Abuse\nEarnings Withholding Order\n\nFirst priority\nSecond priority\nThird priority\nFourth priority\nFifth priority\n\nIf two or more orders have the same priority, comply with the one received first.",
  "If both were received on the same date, \ncomply with the one with the earlier date of judgment.",
  "If the dates of judgment are the same, you may select which order you \nchoose to comply with.",
  "This order appears to have higher priority than any other order.",
  "Earnings will be withheld for this order in accord with the \nEMPLOYER'S INSTRUCTIONS (on reverse of Earnings Withholding Order).",
  "The employer has received another order affecting the employee's earnings and earnings are being withheld for the other\norder because: \n\nThe other order was received first.",
  "The other order was received on (date):\n\nThis order does not have higher priority.",
  "A copy of the other order is attached.",
  "(Retain original for your records.",
  "If a copy is not attached, complete item d.)\n\nA copy of the other order is NOT attached.",
  "Describe the other order by providing the following information:\n\n(1)\n\nCourt name, address, and case number:\n\n(2) Levying officer name, address, and file number:\n\n(3)\n\nTotal amount to be withheld:  $\n\n6.",
  "This order is not effective for the reason shown in item 5.",
  "It is returned to the levying officer with this return.",
  "I declare under penalty of perjury under the laws of the State of California that the foregoing is true and correct.",
  "(TYPE OR PRINT NAME)\n\n(SIGNATURE OF DECLARANT)\n\nIf an Earnings Withholding Order is not effective when served, for any reason, do not hold it.",
  "Return it to the levying officer\nwith this return.",
  "FAILURE TO COMPLETE AND RETURN THIS FORM MAY SUBJECT AN EMPLOYER TO CIVIL PENALTIES\nAND ATTORNEY FEES.",
  "WG-005 [Rev. September 1, 2017]\n\nPage 2 of 2\n\nEMPLOYER'S RETURN \n(Wage Garnishment)\n\n4.",
  "5.\n\na.\n\nb.\n\nc.\n\nd.\n\nDate:\n\n\fSER-001\n\nRequest for Sheriff to Serve Court Papers\n\nInstructions: Each county in California has a sheriff (and sometimes a \nmarshal’s office) that can serve different types of court papers, including \nrestraining orders.",
  "Note that the sheriff cannot guarantee that they will be \nsuccessful in finding the person you need served, but they will try to serve \nbased on the information you put on this form.",
  "Complete this form for each set of papers you need served.",
  "You must \ncomplete a separate form for each person you need served.",
  "CONFIDENTIAL\n\nTo Court Clerk: Do not file this form.",
  "Sheriff File Number (for sheriff to \ncomplete, if needed):\n\nFind out where the person you need served is located.",
  "Give your papers to \nthe sheriff or marshal’s office in that county.",
  "Fill in case number:\nCourt Case Number:\n\nYou may have to pay for service of some court papers.",
  "For more \ninformation, see page 5 of this form, or go to https://selfhelp.courts.ca.gov/\nsheriff-serves.",
  "Do not use this form if you are asking the sheriff to enforce a wage \ngarnishment order on an employer.",
  "Instead, use forms WG-001, Application \nfor Earnings Withholding Order, and WG-035, Confidential Statement of \nJudgment Debtor’s Social Security Number.",
  "If you want the sheriff to enforce a writ or levy, complete this form and form \nSER-001A, Special Instructions for Writs and Levies—Attachment.",
  "All information is required unless it is listed as optional or does not apply to your case.",
  "To the Sheriff or Marshal of (name of county):\n\n1\n\n2\n\nYour Information \n\na.",
  "Your name (party requesting service):\n\nb.",
  "Your lawyer’s information (if you have one)\n\nName:\nFirm name:\n\nc.\n\nCourt case name:\n(example: Garcia v. Smith)\n\nd. Contact information for the sheriff or marshal to reach you\n\n(Give an address where you can receive mail regularly, like a post office box, a Safe at Home address, or \nanother safe address.",
  "If you have a lawyer, give the lawyer’s information.)",
  "Address to receive mail:\nCity:\nTelephone number (optional):\n\nState:\n\nZip:\n\nEmail address (optional): \n\nCONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "Judicial Council of California, www.courts.ca.gov \nNew January 1, 2024, Mandatory Form \nGovernment Code, §§ 7927.430, 26666, 26666.5,  \n26666.10\n\nRequest for Sheriff to Serve Court Papers\n\nSER-001, Page 1 of 5\n\n\fCourt Case Number:\n\n3\n\nInformation About Person or Entity You Want Served \n(Check a or b)\n\na.\n\nI ask the sheriff to serve a person (complete section below)\n\n(1) Name of person:\n\nNicknames or aliases (optional):\n\n(2) Telephone number (optional):\n\n(3) Can you describe the person?",
  "No, I do not have any information about the person’s description.",
  "Male\n\nWeight:\n\nYes (complete the section below with any information you have):\nGender:\nFemale\nHeight:\nDate of birth or age (give estimate, if unknown):\nRace/Ethnicity:\nSpecial marks or features (tattoos, scars, etc.",
  "):\nVehicle (type, model, year, color, plate number):\n\nHair color:\n\nNonbinary\n\nEye color:\n\nCheck here if you are including a picture of the person.",
  "(4) Do you know of any safety or accessibility issues?",
  "No\nYes (complete the section below with any information you have):\n\nThe person (check all that apply):\nHas a gun or other weapon.",
  "Has a history of violence or abuse.",
  "Has special training (examples: military, first responder). Is deaf or hard of hearing.",
  "Does not speak English  (list language):\nAdd any other information about safety or accessibility that you know about:\n\nIs on probation or parole.",
  "Has an aggressive animal. Has mental health issues.",
  "b.\n\nI ask the sheriff to serve an entity (examples: business or government agency)\n\n(1) Name and type of entity:\n\nTelephone number (optional):\n\n(2)\n\n(3)\n\nIf there is a specific person who should be served, give name:\n\nIf there is an agent for service of process, give name:\n\n(4) List any safety or accessibility issues (examples: weapons, aggressive animals, language barrier):\n\nCONFIDENTIAL\n\nThis is not a court form.",
  "Do not file with the court. New January 1, 2024\n\nRequest for Sheriff to Serve Court Papers\n\nSER-001, Page 2 of 5\n\n\fCourt Case Number:\n\n4 Address Where Person or Entity Should Be Served \n\n(The sheriff typically serves during normal business hours.",
  "Check with the sheriff’s office for the exact times.)",
  "Address:\nCity:\nGate code or special instructions:\nBest time to serve at this address (example: 8 a.m.–noon):\n\nCheck here if the person is in jail or prison  (give name of facility):\n\nState:\n\nZip:\n\nHome\n\nBusiness\n\nAlternate address (optional) \n(If the person cannot be found at the address listed above, some sheriffs may try a second address if it’s in the \nsame county.",
  "If you have a second address for the person you want served, complete the section below.)",
  "Address:\nCity:\nGate code or special instructions:\nBest time to serve at this address (example: 8 a.m.–noon):\n\nState:\n\nZip:\n\nHome\n\nBusiness\n\n5\n\nInformation About Your Request \n\na.",
  "What type of court papers are you giving the sheriff to serve (examples: summons, restraining order, eviction, \n\nsmall claims, bank levy, or writ of attachment)?",
  "b. List all forms or court papers you want served on the person in        a. (optional).",
  "3\n\n(Note: You can list each form by its form number (example: FL-100, SC-100).",
  "If there is no form number, give \nthe title of the document.",
  "The court may have ordered you to serve certain papers.",
  "Look at the court’s order and \nlist all forms required.",
  "If you do not know which papers you need to serve, ask a lawyer, or contact your local \nself-help center for free information.)",
  "c.\n\nIs there a court hearing (court date)?",
  "I don’t know\nNo\nYes  (if yes, give date of hearing):\n\nCONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "New January 1, 2024\n\nRequest for Sheriff to Serve Court Papers\n\nSER-001, Page 3 of 5\n\n\fCourt Case Number:\n\n5\n\nd. Is there a deadline for service?",
  "I don’t know\n\nNo\nYes  (if yes, give deadline):\n\ne.\n\nHas the court allowed you to serve your court papers in another way besides personal service (example: \nsubstituted service)?",
  "I don’t know\nNo\nYes (if yes, include a copy of the order allowing another type of service)\n\nf.\n\nIs there any other information you want or need to give to the sheriff to serve your court papers?",
  "No\n\nYes \n\n(if yes, give information below):\n\n6 Enforcement of Writ or Levy\n\nIf you want the sheriff to enforce a writ or levy, you must complete form SER-001A, Special Instructions  for \nWrits and Levies—Attachment, and turn it in with this form.",
  "(Only complete this section if you want the sheriff to enforce a writ or levy.)",
  "Do you want the sheriff to both serve your court papers and act as levying officer?",
  "Yes\n\nNo. I only want the sheriff to act as levying officer.",
  "A registered process server has or will serve my papers.",
  "Your Signature (party asking for service, or their lawyer)\n\nDate:\n\nType or print your name\n\nSign your name (may be electronic)\n\nCONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "New January 1, 2024\n\nRequest for Sheriff to Serve Court Papers\n\nSER-001, Page 4 of 5\n\n\fCourt Case Number:\n\nYour Next Steps\n\nFind out if you need to pay a fee for service by asking the court’s self-help center, a lawyer, or the sheriff’s office.",
  "Here are some situations where you do not need to pay for service: \n\nIf you have a fee waiver in your case (fee waiver granted by a judge on form FW-003 or FW-005).",
  "If you are serving a domestic violence, elder abuse, or gun violence restraining order.",
  "If you have a civil harassment, workplace violence, or school violence restraining order based on a credible threat of\nviolence or stalking.",
  "Give this form and a copy of all the court papers you need served to the sheriff or marshal, including a copy of a fee \nwaiver (if you have one).",
  "If you do not have to pay a fee to the sheriff, you can send your papers electronically.",
  "If you \nhave to pay a fee, contact the sheriff to find out your options for turning in your request.",
  "Note that you can always turn \nin your request in person.",
  "You should get a form back from the sheriff.",
  "If the sheriff was able to serve your court papers, you should receive a form (called a proof of service).",
  "Make sure \nyou get a copy from the sheriff and file it with the court.",
  "Note that if there is a court stamp at the top right corner \nof the first page, it has already been filed and you do not need to file it with the court.",
  "If the sheriff was unable to serve your court papers, you should receive a form (sometimes called declaration of due \ndiligence) that tells you that service was unsuccessful and will give details about when the sheriff tried to serve the \nperson.",
  "If the sheriff was unable to serve your papers, you can ask a lawyer or court’s self-help center about your \nnext steps.",
  "To find your local court self-help center, go to https://selfhelp.courts.ca.gov/.",
  "Self-help center staff will not act as your \nlawyer but may be able to give you information to help you decide what to do in your case.",
  "Services are free. To Sheriff or Marshal\n\nThis form is confidential and must not be made public.",
  "Any papers submitted with this form should be served and listed on the applicable proof of service form.",
  "Note that       b is optional and may help to identify documents that should have been submitted but were not \n5\nreceived by your office.",
  "Under Government Code section 26666.2, once you’ve received a completed copy of this form and forms for \nservice, you must attempt service unless: \n\nAny order submitted does not have a judge’s signature or other representation of a judge’s signature; clerk’s \nendorsement; or court stamp, seal, or other court endorsement; or\n\nA court case number is not listed on the order, summons, or other notice.",
  "CONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "New January 1, 2024\n\nRequest for Sheriff to Serve Court Papers\n\nSER-001, Page 5 of 5\n\n\fSER-001A Special Instructions for  \n\nWrits and Levies—Attachment\n\nInstructions    \nGenerally, you will not need to complete this form if you are asking the sheriff \nto serve a complaint (unless with a writ of attachment) or a restraining order.",
  "Complete this form if you want the sheriff or marshal to enforce a writ.",
  "You \nmust complete this form and form SER-001, Request for Sheriff to Serve \nCourt Paper, and turn both forms in to the sheriff or marshal.",
  "You must include any writ and related order you want the sheriff to enforce.",
  "CONFIDENTIAL\n\nSheriff File Number (for sheriff to \ncomplete, if needed):\n\nFill in case number:\n\nCourt Case Number:\n\nThis form is attached to form SER-001, Request for Sheriff to Serve Court Papers.",
  "All information is required unless it is listed as optional or does not apply to your case.",
  "For more information about what may be required in your case, go to   \n\n https://selfhelp.courts.ca.gov/sheriff-serves.",
  "1 Additional Information About You (Person Requesting Service) \nAre you a judgment creditor (person awarded money or property by the court)?",
  "Yes \nNo (complete the section below):\n\n(a) What is your role in the case?",
  ":\n\n(b)\n\nIs there a judgment creditor in your case?",
  "No\nYes (list the names of all judgment creditors):\n\n2 Additional Information About Person or Entity You Want Served\nThe person or entity you want served (listed in item      of form SER-001): \n(check one)\n\n3\n\nOwes you money in this case (judgment debtor).",
  "Is not a party in this case but has the property.",
  "Is a person who lives on the property.",
  "Other (explain):\n\nCONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "Judicial Council of California,  \nNew January 1, 2024, Mandatory Form \nGovernment Code, §§ 7927.430, 26666, 26666.5,  \n26666.10\n\nwww.courts.ca.gov\n\nSpecial Instructions for Writs and  \nLevies—Attachment\n\nSER-001A, Page 1 of 3\n\n\fCourt Case Number:\n\n3\n\nInformation About the Writ and Judgment \n\na.",
  "Date writ was issued:\n\nb. The writ included with this request is (check one):\n\nAn original writ.",
  "A copy of the original writ issued by the court as an electronic record and has not already been given to the \nlevying officer (sheriff or marshal).",
  "A copy of the original writ that has already been given to the levying officer (sheriff or marshal).",
  "c. Has a judgment been issued by the court?",
  "No\nYes (complete section below):\n\n(1) Date judgment was issued:\n(2)\n(3) List all judgment debtors (people who owe money) if there are any in this case:\n\nIf it is a money judgment, give amount:\n\nIf the judgment debtor is not a person, also include the type of organization (example: corporation).",
  "4\n\nInformation About the Property to Levy \n\na.",
  "Describe the property in as much detail as possible.",
  "For example: \n\nFor bank accounts, give account number (if known).",
  "For personal property, describe property and give the address where property is located.",
  "For vehicles, give license plate number and address where vehicle is located.",
  "For evictions, give address, and any information needed to access the property.",
  "For real property (other than evictions), give legal description, address, and assessor’s parcel number.",
  "If requester is not the person receiving the property, give clear instructions on who will receive the property\nand how.",
  "Check here if you are including a map or other document to describe property.",
  "New January 1, 2024\n\nSER-001A, Page 2 of 3\n\nCONFIDENTIAL\n\nThis is not a court form.",
  "Do not file with the court. Special Instructions for Writs and  \nLevies—Attachment\n\n\fCourt Case Number:\n\n4\n\nb.",
  "Is the property in the judgment debtor’s name?",
  "Yes\nNo (list the names of owners and explain their interest in the property, including any leasehold interest):\n\n(Note: You may also need to have the people listed above served with your court papers.",
  "Check the Code of \nCivil Procedure for service requirements or talk with a lawyer.",
  "Your local court self-help center provides help \nfor free and may be able to help you.",
  "To find your local self-help center, go to \n  \nfind.)",
  "www.selfhelp.courts.ca.gov/\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nc. Are you asking the sheriff to levy on property that is a dwelling (a place someone can live in)?",
  "No\nYes (complete the section below):\nThe dwelling is (check one):\n\nReal property (examples: house, condo, other building attached to land)\nPersonal property (examples: house boat, RV)\n\n5 Special Instructions for Sheriff\n\nIn some situations, you will have to give detailed instructions on how you want the sheriff to enforce the order.",
  "Use \nthe space below to list any instructions.",
  "Some examples of when instructions may be needed include:\n\nInstructions to serve the summons and complaint with a writ of attachment, if not previously served (see Code of\nCivil Procedure section 488.020(c)).",
  "Instructions that the levying officer must place a keeper in charge of the property (see Code of Civil Procedure \nsections 700.070 and 700.080).",
  "Instructions to seize personal property from a private place (see Code of Civil Procedure section 699.030).",
  "• \n\n• \n\n• \n\nCheck here if you need more space to list instructions.",
  "Use a separate piece of paper and write “SER-001A, \nSpecial Instructions for Sheriff” at the top.",
  "Turn it in with this form. CONFIDENTIAL\n\nThis is not a court form. Do not file with the court.",
  "New January 1, 2024\n\nSpecial Instructions for Writs and  \nLevies—Attachment\n\nSER-001A, Page 3 of 3\n\nFor your protection and privacy, please press the Clear\nThis Form button after you have printed the form.",
  "Print this form\n\nSave this form\n\nClear this form"
]